pdietl/arm_mcu/inc/stm32g474xx_asm.h
#include "core_cm4.h"             /* Cortex-M4 processor and core peripherals */

/**
  * @brief Analog to Digital Converter
  */

#define ADCx_REG_IER 0x04 /*!< ADC interrupt enable register */
#define ADCx_REG_CR 0x08 /*!< ADC control register */
#define ADCx_REG_CFGR 0x0C /*!< ADC configuration register 1 */
#define ADCx_REG_CFGR2 0x10 /*!< ADC configuration register 2 */
#define ADCx_REG_SMPR1 0x14 /*!< ADC sampling time register 1 */
#define ADCx_REG_SMPR2 0x18 /*!< ADC sampling time register 2 */
#define ADCx_REG_RESERVED1 0x1C /*!< Reserved */
#define ADCx_REG_TR1 0x20 /*!< ADC analog watchdog 1 threshold register */
#define ADCx_REG_TR2 0x24 /*!< ADC analog watchdog 2 threshold register */
#define ADCx_REG_TR3 0x28 /*!< ADC analog watchdog 3 threshold register */
#define ADCx_REG_RESERVED2 0x2C /*!< Reserved */
#define ADCx_REG_SQR1 0x30 /*!< ADC group regular sequencer register 1 */
#define ADCx_REG_SQR2 0x34 /*!< ADC group regular sequencer register 2 */
#define ADCx_REG_SQR3 0x38 /*!< ADC group regular sequencer register 3 */
#define ADCx_REG_SQR4 0x3C /*!< ADC group regular sequencer register 4 */
#define ADCx_REG_DR 0x40 /*!< ADC group regular data register */
#define ADCx_REG_RESERVED3 0x44 /*!< Reserved */
#define ADCx_REG_RESERVED4 0x48 /*!< Reserved */
#define ADCx_REG_JSQR 0x4C /*!< ADC group injected sequencer register */
#define ADCx_REG_RESERVED5 0x5C /*!< Reserved */
#define ADCx_REG_OFR1 0x60 /*!< ADC offset register 1 */
#define ADCx_REG_OFR2 0x64 /*!< ADC offset register 2 */
#define ADCx_REG_OFR3 0x68 /*!< ADC offset register 3 */
#define ADCx_REG_OFR4 0x6C /*!< ADC offset register 4 */
#define ADCx_REG_RESERVED6 0x7C /*!< Reserved */
#define ADCx_REG_JDR1 0x80 /*!< ADC group injected rank 1 data register */
#define ADCx_REG_JDR2 0x84 /*!< ADC group injected rank 2 data register */
#define ADCx_REG_JDR3 0x88 /*!< ADC group injected rank 3 data register */
#define ADCx_REG_JDR4 0x8C /*!< ADC group injected rank 4 data register */
#define ADCx_REG_RESERVED7 0x09C /*!< Reserved */
#define ADCx_REG_AWD2CR 0xA0 /*!< ADC analog watchdog 2 configuration register */
#define ADCx_REG_AWD3CR 0xA4 /*!< ADC analog watchdog 3 Configuration Register */
#define ADCx_REG_RESERVED8 0x0A8 /*!< Reserved */
#define ADCx_REG_RESERVED9 0x0AC /*!< Reserved */
#define ADCx_REG_DIFSEL 0xB0 /*!< ADC differential mode selection register */
#define ADCx_REG_CALFACT 0xB4 /*!< ADC calibration factors */
#define ADCx_REG_RESERVED10 0x0BC /*!< Reserved */
#define ADCx_REG_GCOMP 0xC0 /*!< ADC calibration factors */

#define ADC_COMMON_REG_CSR 0x00 /*!< ADC common status register */
#define ADC_COMMON_REG_RESERVED1 0x04 /*!< Reserved */
#define ADC_COMMON_REG_CCR 0x08 /*!< ADC common configuration register */
#define ADC_COMMON_REG_CDR 0x0C /*!< ADC common group regular data register Address offset: 0x300 +  */

/**
  * @brief FD Controller Area Network
  */

#define FDCANx_REG_CREL 0x000 /*!< FDCAN Core Release register */
#define FDCANx_REG_ENDN 0x004 /*!< FDCAN Endian register */
#define FDCANx_REG_RESERVED1 0x008 /*!< Reserved */
#define FDCANx_REG_DBTP 0x00C /*!< FDCAN Data Bit Timing & Prescaler register */
#define FDCANx_REG_TEST 0x010 /*!< FDCAN Test register */
#define FDCANx_REG_RWD 0x014 /*!< FDCAN RAM Watchdog register */
#define FDCANx_REG_CCCR 0x018 /*!< FDCAN CC Control register */
#define FDCANx_REG_NBTP 0x01C /*!< FDCAN Nominal Bit Timing & Prescaler register */
#define FDCANx_REG_TSCC 0x020 /*!< FDCAN Timestamp Counter Configuration register */
#define FDCANx_REG_TSCV 0x024 /*!< FDCAN Timestamp Counter Value register */
#define FDCANx_REG_TOCC 0x028 /*!< FDCAN Timeout Counter Configuration register */
#define FDCANx_REG_TOCV 0x02C /*!< FDCAN Timeout Counter Value register */
#define FDCANx_REG_RESERVED2 0x03C /*!< Reserved */
#define FDCANx_REG_ECR 0x040 /*!< FDCAN Error Counter register */
#define FDCANx_REG_PSR 0x044 /*!< FDCAN Protocol Status register */
#define FDCANx_REG_TDCR 0x048 /*!< FDCAN Transmitter Delay Compensation register */
#define FDCANx_REG_RESERVED3 0x04C /*!< Reserved */
#define FDCANx_REG_IR 0x050 /*!< FDCAN Interrupt register */
#define FDCANx_REG_IE 0x054 /*!< FDCAN Interrupt Enable register */
#define FDCANx_REG_ILS 0x058 /*!< FDCAN Interrupt Line Select register */
#define FDCANx_REG_ILE 0x05C /*!< FDCAN Interrupt Line Enable register */
#define FDCANx_REG_RESERVED4 0x07C /*!< Reserved */
#define FDCANx_REG_RXGFC 0x080 /*!< FDCAN Global Filter Configuration register */
#define FDCANx_REG_XIDAM 0x084 /*!< FDCAN Extended ID AND Mask register */
#define FDCANx_REG_HPMS 0x088 /*!< FDCAN High Priority Message Status register */
#define FDCANx_REG_RESERVED5 0x08C /*!< Reserved */
#define FDCANx_REG_RXF0S 0x090 /*!< FDCAN Rx FIFO 0 Status register */
#define FDCANx_REG_RXF0A 0x094 /*!< FDCAN Rx FIFO 0 Acknowledge register */
#define FDCANx_REG_RXF1S 0x098 /*!< FDCAN Rx FIFO 1 Status register */
#define FDCANx_REG_RXF1A 0x09C /*!< FDCAN Rx FIFO 1 Acknowledge register */
#define FDCANx_REG_RESERVED6 0x0BC /*!< Reserved */
#define FDCANx_REG_TXBC 0x0C0 /*!< FDCAN Tx Buffer Configuration register */
#define FDCANx_REG_TXFQS 0x0C4 /*!< FDCAN Tx FIFO/Queue Status register */
#define FDCANx_REG_TXBRP 0x0C8 /*!< FDCAN Tx Buffer Request Pending register */
#define FDCANx_REG_TXBAR 0x0CC /*!< FDCAN Tx Buffer Add Request register */
#define FDCANx_REG_TXBCR 0x0D0 /*!< FDCAN Tx Buffer Cancellation Request register */
#define FDCANx_REG_TXBTO 0x0D4 /*!< FDCAN Tx Buffer Transmission Occurred register */
#define FDCANx_REG_TXBCF 0x0D8 /*!< FDCAN Tx Buffer Cancellation Finished register */
#define FDCANx_REG_TXBTIE 0x0DC /*!< FDCAN Tx Buffer Transmission Interrupt Enable register */
#define FDCANx_REG_TXBCIE 0x0E0 /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register */
#define FDCANx_REG_TXEFS 0x0E4 /*!< FDCAN Tx Event FIFO Status register */
#define FDCANx_REG_TXEFA 0x0E8 /*!< FDCAN Tx Event FIFO Acknowledge register */
#define FDCANx_REG_CKDIV 0x100 /*!< FDCAN clock divider register */

#define COMPx_REG_CSR 0x00 /*!< COMP control and status register */

/**
  * @brief CRC calculation unit
  */

#define CRC_REG_DR 0x00 /*!< CRC Data register */
#define CRC_REG_IDR 0x04 /*!< CRC Independent data register */
#define CRC_REG_CR 0x08 /*!< CRC Control register */
#define CRC_REG_RESERVED0 0x0C /*!< Reserved */
#define CRC_REG_INIT 0x10 /*!< Initial CRC value register */
#define CRC_REG_POL 0x14 /*!< CRC polynomial register */

/**
  * @brief Clock Recovery System
  */

