pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define CRS_REG_CR 0x00 /*!< CRS ccontrol register */
#define CRS_REG_CFGR 0x04 /*!< CRS configuration register */
#define CRS_REG_ISR 0x08 /*!< CRS interrupt and status register */
#define CRS_REG_ICR 0x0C /*!< CRS interrupt flag clear register */

/**
  * @brief Digital to Analog Converter
  */

#define DACx_REG_CR 0x00 /*!< DAC control register */
#define DACx_REG_SWTRIGR 0x04 /*!< DAC software trigger register */
#define DACx_REG_DHR12R1 0x08 /*!< DAC channel1 12-bit right-aligned data holding register */
#define DACx_REG_DHR12L1 0x0C /*!< DAC channel1 12-bit left aligned data holding register */
#define DACx_REG_DHR8R1 0x10 /*!< DAC channel1 8-bit right aligned data holding register */
#define DACx_REG_DHR12R2 0x14 /*!< DAC channel2 12-bit right aligned data holding register */
#define DACx_REG_DHR12L2 0x18 /*!< DAC channel2 12-bit left aligned data holding register */
#define DACx_REG_DHR8R2 0x1C /*!< DAC channel2 8-bit right-aligned data holding register */
#define DACx_REG_DHR12RD 0x20 /*!< Dual DAC 12-bit right-aligned data holding register */
#define DACx_REG_DHR12LD 0x24 /*!< DUAL DAC 12-bit left aligned data holding register */
#define DACx_REG_DHR8RD 0x28 /*!< DUAL DAC 8-bit right aligned data holding register */
#define DACx_REG_DOR1 0x2C /*!< DAC channel1 data output register */
#define DACx_REG_DOR2 0x30 /*!< DAC channel2 data output register */
#define DACx_REG_SR 0x34 /*!< DAC status register */
#define DACx_REG_CCR 0x38 /*!< DAC calibration control register */
#define DACx_REG_MCR 0x3C /*!< DAC mode control register */
#define DACx_REG_SHSR1 0x40 /*!< DAC Sample and Hold sample time register 1 */
#define DACx_REG_SHSR2 0x44 /*!< DAC Sample and Hold sample time register 2 */
#define DACx_REG_SHHR 0x48 /*!< DAC Sample and Hold hold time register */
#define DACx_REG_SHRR 0x4C /*!< DAC Sample and Hold refresh time register */
#define DACx_REG_STR1 0x58 /*!< DAC Sawtooth register */
#define DACx_REG_STR2 0x5C /*!< DAC Sawtooth register */
#define DACx_REG_STMODR 0x60 /*!< DAC Sawtooth Mode register */

/**
  * @brief Debug MCU
  */

#define DBGMCU_REG_IDCODE 0x00 /*!< MCU device ID code */
#define DBGMCU_REG_CR 0x04 /*!< Debug MCU configuration register */
#define DBGMCU_REG_APB1FZR1 0x08 /*!< Debug MCU APB1 freeze register 1 */
#define DBGMCU_REG_APB1FZR2 0x0C /*!< Debug MCU APB1 freeze register 2 */
#define DBGMCU_REG_APB2FZ 0x10 /*!< Debug MCU APB2 freeze register */

/**
  * @brief DMA Controller
  */

#define DMA_CHANNELx_REG_CCR  0x00 /*!< DMA channel x configuration register        */
#define DMA_CHANNELx_REG_CNDTR 0x04 /*!< DMA channel x number of data register       */
#define DMA_CHANNELx_REG_CPAR  0x08 /*!< DMA channel x peripheral address register   */
#define DMA_CHANNELx_REG_CMAR  0x0C /*!< DMA channel x memory address register       */

#define DMAx_REG_ISR 0x00 /*!< DMA interrupt status register */
#define DMAx_REG_IFCR 0x04 /*!< DMA interrupt flag clear register */

/**
  * @brief DMA Multiplexer
  */

#define DMAMUX_REG_CCR 0x0004 /*!< DMA Multiplexer Channel x Control Register * (channel x) */

#define DMAMUX_REG_CSR 0x0080 /*!< DMA Channel Status Register   */
#define DMAMUX_REG_CFR 0x0084 /*!< DMA Channel Clear Flag Register   */

#define DMAMUX_REG_RGCR 0x0100 /*!< DMA Request Generator x Control Register + 0x0004 * (Req Gen x) */

#define DMAMUX_REG_RGSR 0x0140 /*!< DMA Request Generator Status Register   */
#define DMAMUX_REG_RGCFR 0x0144 /*!< DMA Request Generator Clear Flag Register   */

/**
  * @brief External Interrupt/Event Controller
  */

#define EXTI_REG_IMR1 0x00 /*!< EXTI Interrupt mask register 1 */
#define EXTI_REG_EMR1 0x04 /*!< EXTI Event mask register 1 */
#define EXTI_REG_RTSR1 0x08 /*!< EXTI Rising trigger selection register 1 */
#define EXTI_REG_FTSR1 0x0C /*!< EXTI Falling trigger selection register 1 */
#define EXTI_REG_SWIER1 0x10 /*!< EXTI Software interrupt event register 1 */
#define EXTI_REG_PR1 0x14 /*!< EXTI Pending register 1 */
#define EXTI_REG_IMR2 0x20 /*!< EXTI Interrupt mask register 2 */
#define EXTI_REG_EMR2 0x24 /*!< EXTI Event mask register 2 */
#define EXTI_REG_RTSR2 0x28 /*!< EXTI Rising trigger selection register 2 */
#define EXTI_REG_FTSR2 0x2C /*!< EXTI Falling trigger selection register 2 */
#define EXTI_REG_SWIER2 0x30 /*!< EXTI Software interrupt event register 2 */
#define EXTI_REG_PR2 0x34 /*!< EXTI Pending register 2 */

/**
  * @brief FLASH Registers
  */

#define FLASH_REG_ACR 0x00 /*!< FLASH access control register */
#define FLASH_REG_PDKEYR 0x04 /*!< FLASH power down key register */
#define FLASH_REG_KEYR 0x08 /*!< FLASH key register */
#define FLASH_REG_OPTKEYR 0x0C /*!< FLASH option key register */
#define FLASH_REG_SR 0x10 /*!< FLASH status register */
#define FLASH_REG_CR 0x14 /*!< FLASH control register */
#define FLASH_REG_ECCR 0x18 /*!< FLASH ECC register */
#define FLASH_REG_RESERVED1 0x1C /*!< Reserved1 */
#define FLASH_REG_OPTR 0x20 /*!< FLASH option register */
#define FLASH_REG_PCROP1SR 0x24 /*!< FLASH bank1 PCROP start address register */
#define FLASH_REG_PCROP1ER 0x28 /*!< FLASH bank1 PCROP end address register */
#define FLASH_REG_WRP1AR 0x2C /*!< FLASH bank1 WRP area A address register */
#define FLASH_REG_WRP1BR 0x30 /*!< FLASH bank1 WRP area B address register */
#define FLASH_REG_RESERVED2 0x34 /*!< Reserved2 */
#define FLASH_REG_PCROP2SR 0x44 /*!< FLASH bank2 PCROP start address register */
#define FLASH_REG_PCROP2ER 0x48 /*!< FLASH bank2 PCROP end address register */
#define FLASH_REG_WRP2AR 0x4C /*!< FLASH bank2 WRP area A address register */
#define FLASH_REG_WRP2BR 0x50 /*!< FLASH bank2 WRP area B address register */
#define FLASH_REG_RESERVED3 0x54 /*!< Reserved3 */
#define FLASH_REG_SEC1R 0x70 /*!< FLASH Securable memory register bank1 */
#define FLASH_REG_SEC2R 0x74 /*!< FLASH Securable memory register bank2 */

/**
  * @brief FMAC
  */

#define FMAC_REG_X1BUFCFG 0x00 /*!< FMAC X1 Buffer Configuration register          */
#define FMAC_REG_X2BUFCFG 0x04 /*!< FMAC X2 Buffer Configuration register          */
#define FMAC_REG_YBUFCFG 0x08 /*!< FMAC Y Buffer Configuration register          */
#define FMAC_REG_PARAM 0x0C /*!< FMAC Parameter register          */
#define FMAC_REG_CR 0x10 /*!< FMAC Control register          */
#define FMAC_REG_SR 0x14 /*!< FMAC Status register          */
#define FMAC_REG_WDATA 0x18 /*!< FMAC Write Data register          */
#define FMAC_REG_RDATA 0x1C /*!< FMAC Read Data register          */

/**
  * @brief Flexible Memory Controller
  */

#define FMC_BANK1_REG_BTCR 0x00 /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR)-1C */
#define FMC_BANK1_REG_PCSCNTR 0x20 /*!< PSRAM chip-select counter register */

/**
  * @brief Flexible Memory Controller Bank1E
  */

#define FMC_BANK1E_REG_BWTR 0x104 /*!< NOR/PSRAM write timing registers-0x11C */

/**
  * @brief Flexible Memory Controller Bank3
  */

#define FMC_BANK3_REG_PCR 0x80 /*!< NAND Flash control register */
#define FMC_BANK3_REG_SR 0x84 /*!< NAND Flash FIFO status and interrupt register */
#define FMC_BANK3_REG_PMEM 0x88 /*!< NAND Flash Common memory space timing register */
#define FMC_BANK3_REG_PATT 0x8C /*!< NAND Flash Attribute memory space timing register */
#define FMC_BANK3_REG_ECCR 0x94 /*!< NAND Flash ECC result registers */

/**
  * @brief General Purpose I/O
  */

#define GPIOx_REG_MODER 0x00 /*!< GPIO port mode register      */
#define GPIOx_REG_OTYPER 0x04 /*!< GPIO port output type register      */
#define GPIOx_REG_OSPEEDR 0x08 /*!< GPIO port output speed register      */
#define GPIOx_REG_PUPDR 0x0C /*!< GPIO port pull-up/pull-down register      */
#define GPIOx_REG_IDR 0x10 /*!< GPIO port input data register      */
#define GPIOx_REG_ODR 0x14 /*!< GPIO port output data register      */
#define GPIOx_REG_BSRR 0x18 /*!< GPIO port bit set/reset  register      */
#define GPIOx_REG_LCKR 0x1C /*!< GPIO port configuration lock register      */
#define GPIOx_REG_AFR 0x20 /*!< GPIO alternate function registers-0x24 */
#define GPIOx_REG_BRR 0x28 /*!< GPIO Bit Reset register      */

/**
  * @brief Inter-integrated Circuit Interface
  */

#define I2Cx_REG_CR1 0x00 /*!< I2C Control register 1 */
#define I2Cx_REG_CR2 0x04 /*!< I2C Control register 2 */
#define I2Cx_REG_OAR1 0x08 /*!< I2C Own address 1 register */
#define I2Cx_REG_OAR2 0x0C /*!< I2C Own address 2 register */
#define I2Cx_REG_TIMINGR 0x10 /*!< I2C Timing register */
#define I2Cx_REG_TIMEOUTR 0x14 /*!< I2C Timeout register */
#define I2Cx_REG_ISR 0x18 /*!< I2C Interrupt and status register */
#define I2Cx_REG_ICR 0x1C /*!< I2C Interrupt clear register */
#define I2Cx_REG_PECR 0x20 /*!< I2C PEC register */
#define I2Cx_REG_RXDR 0x24 /*!< I2C Receive data register */
#define I2Cx_REG_TXDR 0x28 /*!< I2C Transmit data register */

/**
  * @brief Independent WATCHDOG
  */

