pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define IWDG_REG_KR 0x00 /*!< IWDG Key register */
#define IWDG_REG_PR 0x04 /*!< IWDG Prescaler register */
#define IWDG_REG_RLR 0x08 /*!< IWDG Reload register */
#define IWDG_REG_SR 0x0C /*!< IWDG Status register */
#define IWDG_REG_WINR 0x10 /*!< IWDG Window register */

/**
  * @brief LPTIMER
  */

#define LPTIM_REG_ISR 0x00 /*!< LPTIM Interrupt and Status register */
#define LPTIM_REG_ICR 0x04 /*!< LPTIM Interrupt Clear register */
#define LPTIM_REG_IER 0x08 /*!< LPTIM Interrupt Enable register */
#define LPTIM_REG_CFGR 0x0C /*!< LPTIM Configuration register */
#define LPTIM_REG_CR 0x10 /*!< LPTIM Control register */
#define LPTIM_REG_CMP 0x14 /*!< LPTIM Compare register */
#define LPTIM_REG_ARR 0x18 /*!< LPTIM Autoreload register */
#define LPTIM_REG_CNT 0x1C /*!< LPTIM Counter register */
#define LPTIM_REG_OR 0x20 /*!< LPTIM Option register */

/**
  * @brief Operational Amplifier (OPAMP)
  */

#define OPAMP_REG_CSR 0x00 /*!< OPAMP control/status register */
#define OPAMP_REG_RESERVED 0x04 /*!< OPAMP offset trimming register for normal mode */
#define OPAMP_REG_TCMR 0x18 /*!< OPAMP timer controlled mux mode register */

/**
  * @brief Power Control
  */

#define PWR_REG_CR1 0x00 /*!< PWR power control register 1 */
#define PWR_REG_CR2 0x04 /*!< PWR power control register 2 */
#define PWR_REG_CR3 0x08 /*!< PWR power control register 3 */
#define PWR_REG_CR4 0x0C /*!< PWR power control register 4 */
#define PWR_REG_SR1 0x10 /*!< PWR power status register 1 */
#define PWR_REG_SR2 0x14 /*!< PWR power status register 2 */
#define PWR_REG_SCR 0x18 /*!< PWR power status reset register */
#define PWR_REG_RESERVED 0x1C /*!< Reserved */
#define PWR_REG_PUCRA 0x20 /*!< Pull_up control register of portA */
#define PWR_REG_PDCRA 0x24 /*!< Pull_Down control register of portA */
#define PWR_REG_PUCRB 0x28 /*!< Pull_up control register of portB */
#define PWR_REG_PDCRB 0x2C /*!< Pull_Down control register of portB */
#define PWR_REG_PUCRC 0x30 /*!< Pull_up control register of portC */
#define PWR_REG_PDCRC 0x34 /*!< Pull_Down control register of portC */
#define PWR_REG_PUCRD 0x38 /*!< Pull_up control register of portD */
#define PWR_REG_PDCRD 0x3C /*!< Pull_Down control register of portD */
#define PWR_REG_PUCRE 0x40 /*!< Pull_up control register of portE */
#define PWR_REG_PDCRE 0x44 /*!< Pull_Down control register of portE */
#define PWR_REG_PUCRF 0x48 /*!< Pull_up control register of portF */
#define PWR_REG_PDCRF 0x4C /*!< Pull_Down control register of portF */
#define PWR_REG_PUCRG 0x50 /*!< Pull_up control register of portG */
#define PWR_REG_PDCRG 0x54 /*!< Pull_Down control register of portG */
#define PWR_REG_RESERVED1 0x58 /*!< Reserved                             Address  - 0x7C */
#define PWR_REG_CR5 0x80 /*!< PWR power control register 5 */

/**
  * @brief QUAD Serial Peripheral Interface
  */

#define QUADSPI_REG_CR 0x00 /*!< QUADSPI Control register */
#define QUADSPI_REG_DCR 0x04 /*!< QUADSPI Device Configuration register */
#define QUADSPI_REG_SR 0x08 /*!< QUADSPI Status register */
#define QUADSPI_REG_FCR 0x0C /*!< QUADSPI Flag Clear register */
#define QUADSPI_REG_DLR 0x10 /*!< QUADSPI Data Length register */
#define QUADSPI_REG_CCR 0x14 /*!< QUADSPI Communication Configuration register */
#define QUADSPI_REG_AR 0x18 /*!< QUADSPI Address register */
#define QUADSPI_REG_ABR 0x1C /*!< QUADSPI Alternate Bytes register */
#define QUADSPI_REG_DR 0x20 /*!< QUADSPI Data register */
#define QUADSPI_REG_PSMKR 0x24 /*!< QUADSPI Polling Status Mask register */
#define QUADSPI_REG_PSMAR 0x28 /*!< QUADSPI Polling Status Match register */
#define QUADSPI_REG_PIR 0x2C /*!< QUADSPI Polling Interval register */
#define QUADSPI_REG_LPTR 0x30 /*!< QUADSPI Low Power Timeout register */

/**
  * @brief Reset and Clock Control
  */

#define RCC_REG_CR 0x00 /*!< RCC clock control register */
#define RCC_REG_ICSCR 0x04 /*!< RCC internal clock sources calibration register */
#define RCC_REG_CFGR 0x08 /*!< RCC clock configuration register */
#define RCC_REG_PLLCFGR 0x0C /*!< RCC system PLL configuration register */
#define RCC_REG_RESERVED0 0x10 /*!< Reserved */
#define RCC_REG_RESERVED1 0x14 /*!< Reserved */
#define RCC_REG_CIER 0x18 /*!< RCC clock interrupt enable register */
#define RCC_REG_CIFR 0x1C /*!< RCC clock interrupt flag register */
#define RCC_REG_CICR 0x20 /*!< RCC clock interrupt clear register */
#define RCC_REG_RESERVED2 0x24 /*!< Reserved */
#define RCC_REG_AHB1RSTR 0x28 /*!< RCC AHB1 peripheral reset register */
#define RCC_REG_AHB2RSTR 0x2C /*!< RCC AHB2 peripheral reset register */
#define RCC_REG_AHB3RSTR 0x30 /*!< RCC AHB3 peripheral reset register */
#define RCC_REG_RESERVED3 0x34 /*!< Reserved */
#define RCC_REG_APB1RSTR1 0x38 /*!< RCC APB1 peripheral reset register 1 */
#define RCC_REG_APB1RSTR2 0x3C /*!< RCC APB1 peripheral reset register 2 */
#define RCC_REG_APB2RSTR 0x40 /*!< RCC APB2 peripheral reset register */
#define RCC_REG_RESERVED4 0x44 /*!< Reserved */
#define RCC_REG_AHB1ENR 0x48 /*!< RCC AHB1 peripheral clocks enable register */
#define RCC_REG_AHB2ENR 0x4C /*!< RCC AHB2 peripheral clocks enable register */
#define RCC_REG_AHB3ENR 0x50 /*!< RCC AHB3 peripheral clocks enable register */
#define RCC_REG_RESERVED5 0x54 /*!< Reserved */
#define RCC_REG_APB1ENR1 0x58 /*!< RCC APB1 peripheral clocks enable register 1 */
#define RCC_REG_APB1ENR2 0x5C /*!< RCC APB1 peripheral clocks enable register 2 */
#define RCC_REG_APB2ENR 0x60 /*!< RCC APB2 peripheral clocks enable register */
#define RCC_REG_RESERVED6 0x64 /*!< Reserved */
#define RCC_REG_AHB1SMENR 0x68 /*!< RCC AHB1 peripheral clocks enable in sleep and stop modes register */
#define RCC_REG_AHB2SMENR 0x6C /*!< RCC AHB2 peripheral clocks enable in sleep and stop modes register */
#define RCC_REG_AHB3SMENR 0x70 /*!< RCC AHB3 peripheral clocks enable in sleep and stop modes register */
#define RCC_REG_RESERVED7 0x74 /*!< Reserved */
#define RCC_REG_APB1SMENR1 0x78 /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 1 */
#define RCC_REG_APB1SMENR2 0x7C /*!< RCC APB1 peripheral clocks enable in sleep mode and stop modes register 2 */
#define RCC_REG_APB2SMENR 0x80 /*!< RCC APB2 peripheral clocks enable in sleep mode and stop modes register */
#define RCC_REG_RESERVED8 0x84 /*!< Reserved */
#define RCC_REG_CCIPR 0x88 /*!< RCC peripherals independent clock configuration register */
#define RCC_REG_RESERVED9 0x8C /*!< Reserved */
#define RCC_REG_BDCR 0x90 /*!< RCC backup domain control register */
#define RCC_REG_CSR 0x94 /*!< RCC clock control & status register */
#define RCC_REG_CRRCR 0x98 /*!< RCC clock recovery RC register */
#define RCC_REG_CCIPR2 0x9C /*!< RCC peripherals independent clock configuration register 2 */

/**
  * @brief Real-Time Clock
  */
/*
* @brief Specific device feature definitions
*/
#define RTC_TAMP_INT_6_SUPPORT
#define RTC_TAMP_INT_NB        4u

#define RTC_TAMP_NB            3u
#define RTC_BACKUP_NB          32u


#define RTC_REG_TR 0x00 /*!< RTC time register */
#define RTC_REG_DR 0x04 /*!< RTC date register */
#define RTC_REG_SSR 0x08 /*!< RTC sub second register */
#define RTC_REG_ICSR 0x0C /*!< RTC initialization control and status register */
#define RTC_REG_PRER 0x10 /*!< RTC prescaler register */
#define RTC_REG_WUTR 0x14 /*!< RTC wakeup timer register */
#define RTC_REG_CR 0x18 /*!< RTC control register */
#define RTC_REG_RESERVED0 0x1C /*!< Reserved                                                   Address  */
#define RTC_REG_RESERVED1 0x20 /*!< Reserved                                                   Address  */
#define RTC_REG_WPR 0x24 /*!< RTC write protection register */
#define RTC_REG_CALR 0x28 /*!< RTC calibration register */
#define RTC_REG_SHIFTR 0x2C /*!< RTC shift control register */
#define RTC_REG_TSTR 0x30 /*!< RTC time stamp time register */
#define RTC_REG_TSDR 0x34 /*!< RTC time stamp date register */
#define RTC_REG_TSSSR 0x38 /*!< RTC time-stamp sub second register */
#define RTC_REG_RESERVED2 0x3C /*!< Reserved                                                   Address  */
#define RTC_REG_ALRMAR 0x40 /*!< RTC alarm A register */
#define RTC_REG_ALRMASSR 0x44 /*!< RTC alarm A sub second register */
#define RTC_REG_ALRMBR 0x48 /*!< RTC alarm B register */
#define RTC_REG_ALRMBSSR 0x4C /*!< RTC alarm B sub second register */
#define RTC_REG_SR 0x50 /*!< RTC Status register */
#define RTC_REG_MISR 0x54 /*!< RTC Masked Interrupt Status register */
#define RTC_REG_RESERVED3 0x58 /*!< Reserved                                                   Address  */
#define RTC_REG_SCR 0x5C /*!< RTC Status Clear register */

/**
  * @brief Tamper and backup registers
  */

#define TAMP_REG_CR1 0x00 /*!< TAMP configuration register 1 */
#define TAMP_REG_CR2 0x04 /*!< TAMP configuration register 2 */
#define TAMP_REG_RESERVED0 0x08 /*!< no configuration register 3 */
#define TAMP_REG_FLTCR 0x0C /*!< TAMP filter control register */
#define TAMP_REG_RESERVED1 0x10 /*!< Reserved                                Address  - 0x24 */
#define TAMP_REG_RESERVED2 0x28 /*!< Reserved                                Address  */
#define TAMP_REG_IER 0x2C /*!< TAMP Interrupt enable register */
#define TAMP_REG_SR 0x30 /*!< TAMP Status register */
#define TAMP_REG_MISR 0x34 /*!< TAMP Masked Interrupt Status register   Address  */
#define TAMP_REG_RESERVED3 0x38 /*!< Reserved                                Address  */
#define TAMP_REG_SCR 0x3C /*!< TAMP Status clear register */
#define TAMP_REG_RESERVED4 0x040 /*!< Reserved                                Address  - 0xFC */
#define TAMP_REG_BKP0R 0x100 /*!< TAMP backup register 0 */
#define TAMP_REG_BKP1R 0x104 /*!< TAMP backup register 1 */
#define TAMP_REG_BKP2R 0x108 /*!< TAMP backup register 2 */
#define TAMP_REG_BKP3R 0x10C /*!< TAMP backup register 3 */
#define TAMP_REG_BKP4R 0x110 /*!< TAMP backup register 4 */
#define TAMP_REG_BKP5R 0x114 /*!< TAMP backup register 5 */
#define TAMP_REG_BKP6R 0x118 /*!< TAMP backup register 6 */
#define TAMP_REG_BKP7R 0x11C /*!< TAMP backup register 7 */
#define TAMP_REG_BKP8R 0x120 /*!< TAMP backup register 8 */
#define TAMP_REG_BKP9R 0x124 /*!< TAMP backup register 9 */
#define TAMP_REG_BKP10R 0x128 /*!< TAMP backup register 10 */
#define TAMP_REG_BKP11R 0x12C /*!< TAMP backup register 11 */
#define TAMP_REG_BKP12R 0x130 /*!< TAMP backup register 12 */
#define TAMP_REG_BKP13R 0x134 /*!< TAMP backup register 13 */
#define TAMP_REG_BKP14R 0x138 /*!< TAMP backup register 14 */
#define TAMP_REG_BKP15R 0x13C /*!< TAMP backup register 15 */
#define TAMP_REG_BKP16R 0x140 /*!< TAMP backup register 16 */
#define TAMP_REG_BKP17R 0x144 /*!< TAMP backup register 17 */
#define TAMP_REG_BKP18R 0x148 /*!< TAMP backup register 18 */
#define TAMP_REG_BKP19R 0x14C /*!< TAMP backup register 19 */
#define TAMP_REG_BKP20R 0x150 /*!< TAMP backup register 20 */
#define TAMP_REG_BKP21R 0x154 /*!< TAMP backup register 21 */
#define TAMP_REG_BKP22R 0x158 /*!< TAMP backup register 22 */
#define TAMP_REG_BKP23R 0x15C /*!< TAMP backup register 23 */
#define TAMP_REG_BKP24R 0x160 /*!< TAMP backup register 24 */
#define TAMP_REG_BKP25R 0x164 /*!< TAMP backup register 25 */
#define TAMP_REG_BKP26R 0x168 /*!< TAMP backup register 26 */
#define TAMP_REG_BKP27R 0x16C /*!< TAMP backup register 27 */
#define TAMP_REG_BKP28R 0x170 /*!< TAMP backup register 28 */
#define TAMP_REG_BKP29R 0x174 /*!< TAMP backup register 29 */
#define TAMP_REG_BKP30R 0x178 /*!< TAMP backup register 30 */
#define TAMP_REG_BKP31R 0x17C /*!< TAMP backup register 31 */

/**
  * @brief Serial Audio Interface
  */

#define SAI_REG_GCR 0x00 /*!< SAI global configuration register */
#define SAI_REG_RESERVED 0x04 /*!< Reserved to 0x40 */
#define SAI_REG_PDMCR 0x44 /*!< SAI PDM control register */
#define SAI_REG_PDMDLY 0x48 /*!< SAI PDM delay register */

#define SAI_REG_CR1 0x04 /*!< SAI block x configuration register 1 */
#define SAI_REG_CR2 0x08 /*!< SAI block x configuration register 2 */
#define SAI_REG_FRCR 0x0C /*!< SAI block x frame configuration register */
#define SAI_REG_SLOTR 0x10 /*!< SAI block x slot register */
#define SAI_REG_IMR 0x14 /*!< SAI block x interrupt mask register */
#define SAI_REG_SR 0x18 /*!< SAI block x status register */
#define SAI_REG_CLRFR 0x1C /*!< SAI block x clear flag register */
#define SAI_REG_DR 0x20 /*!< SAI block x data register */

/**
  * @brief Serial Peripheral Interface
  */

#define SPIx_REG_CR1 0x00 /*!< SPI Control register 1 */
#define SPIx_REG_CR2 0x04 /*!< SPI Control register 2 */
#define SPIx_REG_SR 0x08 /*!< SPI Status register */
#define SPIx_REG_DR 0x0C /*!< SPI data register */
#define SPIx_REG_CRCPR 0x10 /*!< SPI CRC polynomial register */
#define SPIx_REG_RXCRCR 0x14 /*!< SPI Rx CRC register */
#define SPIx_REG_TXCRCR 0x18 /*!< SPI Tx CRC register */
#define SPIx_REG_I2SCFGR 0x1C /*!< SPI_I2S configuration register */
#define SPIx_REG_I2SPR 0x20 /*!< SPI_I2S prescaler register */

/**
  * @brief System configuration controller
  */

#define SYSCFG_REG_MEMRMP 0x00 /*!< SYSCFG memory remap register      */
#define SYSCFG_REG_CFGR1 0x04 /*!< SYSCFG configuration register 1      */
#define SYSCFG_REG_EXTICR 0x08 /*!< SYSCFG external interrupt configuration registers-0x14 */
#define SYSCFG_REG_SCSR 0x18 /*!< SYSCFG CCMSRAM control and status register      */
#define SYSCFG_REG_CFGR2 0x1C /*!< SYSCFG configuration register 2      */
#define SYSCFG_REG_SWPR 0x20 /*!< SYSCFG CCMSRAM write protection register      */
#define SYSCFG_REG_SKR 0x24 /*!< SYSCFG CCMSRAM Key Register      */

/**
  * @brief TIM
  */

#define TIMx_REG_CR1 0x00 /*!< TIM control register 1 */
#define TIMx_REG_CR2 0x04 /*!< TIM control register 2 */
#define TIMx_REG_SMCR 0x08 /*!< TIM slave mode control register */
#define TIMx_REG_DIER 0x0C /*!< TIM DMA/interrupt enable register */
#define TIMx_REG_SR 0x10 /*!< TIM status register */
#define TIMx_REG_EGR 0x14 /*!< TIM event generation register */
#define TIMx_REG_CCMR1 0x18 /*!< TIM capture/compare mode register 1 */
#define TIMx_REG_CCMR2 0x1C /*!< TIM capture/compare mode register 2 */
#define TIMx_REG_CCER 0x20 /*!< TIM capture/compare enable register */
#define TIMx_REG_CNT 0x24 /*!< TIM counter register */
#define TIMx_REG_PSC 0x28 /*!< TIM prescaler */
#define TIMx_REG_ARR 0x2C /*!< TIM auto-reload register */
#define TIMx_REG_RCR 0x30 /*!< TIM repetition counter register */
#define TIMx_REG_CCR1 0x34 /*!< TIM capture/compare register 1 */
#define TIMx_REG_CCR2 0x38 /*!< TIM capture/compare register 2 */
#define TIMx_REG_CCR3 0x3C /*!< TIM capture/compare register 3 */
#define TIMx_REG_CCR4 0x40 /*!< TIM capture/compare register 4 */
#define TIMx_REG_BDTR 0x44 /*!< TIM break and dead-time register */
#define TIMx_REG_CCR5 0x48 /*!< TIM capture/compare register 5 */
#define TIMx_REG_CCR6 0x4C /*!< TIM capture/compare register 6 */
#define TIMx_REG_CCMR3 0x50 /*!< TIM capture/compare mode register 3 */
#define TIMx_REG_DTR2 0x54 /*!< TIM deadtime register 2 */
#define TIMx_REG_ECR 0x58 /*!< TIM encoder control register */
#define TIMx_REG_TISEL 0x5C /*!< TIM Input Selection register */
#define TIMx_REG_AF1 0x60 /*!< TIM alternate function option register 1 */
#define TIMx_REG_AF2 0x64 /*!< TIM alternate function option register 2 */
#define TIMx_REG_OR 0x68 /*!< TIM option register */
#define TIMx_REG_RESERVED0 0x6C /*!< Reserved */
#define TIMx_REG_DCR 0x3DC /*!< TIM DMA control register */
#define TIMx_REG_DMAR 0x3E0 /*!< TIM DMA address for full transfer */

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

