pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define USARTx_REG_CR1 0x00 /*!< USART Control register 1  */
#define USARTx_REG_CR2 0x04 /*!< USART Control register 2  */
#define USARTx_REG_CR3 0x08 /*!< USART Control register 3  */
#define USARTx_REG_BRR 0x0C /*!< USART Baud rate register  */
#define USARTx_REG_GTPR 0x10 /*!< USART Guard time and prescaler register  */
#define USARTx_REG_RTOR 0x14 /*!< USART Receiver Timeout register  */
#define USARTx_REG_RQR 0x18 /*!< USART Request register  */
#define USARTx_REG_ISR 0x1C /*!< USART Interrupt and status register  */
#define USARTx_REG_ICR 0x20 /*!< USART Interrupt flag Clear register  */
#define USARTx_REG_RDR 0x24 /*!< USART Receive Data register  */
#define USARTx_REG_TDR 0x28 /*!< USART Transmit Data register  */
#define USARTx_REG_PRESC 0x2C /*!< USART Prescaler register  */

/**
  * @brief Universal Serial Bus Full Speed Device
  */

#define USB_REG_EP0R 0x00 /*!< USB Endpoint 0 register */
#define USB_REG_EP1R 0x04 /*!< USB Endpoint 1 register */
#define USB_REG_EP2R 0x08 /*!< USB Endpoint 2 register */
#define USB_REG_EP3R 0x0C /*!< USB Endpoint 3 register */
#define USB_REG_EP4R 0x10 /*!< USB Endpoint 4 register */
#define USB_REG_EP5R 0x14 /*!< USB Endpoint 5 register */
#define USB_REG_EP6R 0x18 /*!< USB Endpoint 6 register */
#define USB_REG_EP7R 0x1C /*!< USB Endpoint 7 register */
#define USB_REG_CNTR 0x40 /*!< Control register */
#define USB_REG_ISTR 0x44 /*!< Interrupt status register */
#define USB_REG_FNR 0x48 /*!< Frame number register */
#define USB_REG_DADDR 0x4C /*!< Device address register */
#define USB_REG_BTABLE 0x50 /*!< Buffer Table address register */
#define USB_REG_LPMCSR 0x54 /*!< LPM Control and Status register */
#define USB_REG_BCDR 0x58 /*!< Battery Charging detector register */

/**
  * @brief VREFBUF
  */

#define VREFBUF_REG_CSR 0x00 /*!< VREFBUF control and status register */
#define VREFBUF_REG_CCR 0x04 /*!< VREFBUF calibration and control register */

/**
  * @brief Window WATCHDOG
  */

#define WWDG_REG_CR 0x00 /*!< WWDG Control register */
#define WWDG_REG_CFR 0x04 /*!< WWDG Configuration register */
#define WWDG_REG_SR 0x08 /*!< WWDG Status register */

/**
  * @brief RNG
  */

#define RNG_REG_CR 0x00 /*!< RNG control register */
#define RNG_REG_SR 0x04 /*!< RNG status register */
#define RNG_REG_DR 0x08 /*!< RNG data register */

/**
  * @brief CORDIC
  */

#define CORDIC_REG_CSR 0x00 /*!< CORDIC control and status register */
#define CORDIC_REG_WDATA 0x04 /*!< CORDIC argument register */
#define CORDIC_REG_RDATA 0x08 /*!< CORDIC result register */

/**
  * @brief UCPD
  */

#define UCPD_REG_CFG1 0x00 /*!< UCPD configuration register 1 */
#define UCPD_REG_CFG2 0x04 /*!< UCPD configuration register 2 */
#define UCPD_REG_RESERVED0 0x08 /*!< UCPD reserved register */
#define UCPD_REG_CR 0x0C /*!< UCPD control register */
#define UCPD_REG_IMR 0x10 /*!< UCPD interrupt mask register */
#define UCPD_REG_SR 0x14 /*!< UCPD status register */
#define UCPD_REG_ICR 0x18 /*!< UCPD interrupt flag clear register         Address  */
#define UCPD_REG_TX_ORDSET 0x1C /*!< UCPD Tx ordered set type register */
#define UCPD_REG_TX_PAYSZ 0x20 /*!< UCPD Tx payload size register */
#define UCPD_REG_TXDR 0x24 /*!< UCPD Tx data register */
#define UCPD_REG_RX_ORDSET 0x28 /*!< UCPD Rx ordered set type register */
#define UCPD_REG_RX_PAYSZ 0x2C /*!< UCPD Rx payload size register */
#define UCPD_REG_RXDR 0x30 /*!< UCPD Rx data register */
#define UCPD_REG_RX_ORDEXT1 0x34 /*!< UCPD Rx ordered set extension 1 register */
#define UCPD_REG_RX_ORDEXT2 0x38 /*!< UCPD Rx ordered set extension 2 register */

/**
  * @brief High resolution Timer (HRTIM)
  */

#define c7amba_hrtim1_v2_0

#define HRTIM_MASTER_REG_MCR 0x00 /*!< HRTIM Master Timer control register */
#define HRTIM_MASTER_REG_MISR 0x04 /*!< HRTIM Master Timer interrupt status register */
#define HRTIM_MASTER_REG_MICR 0x08 /*!< HRTIM Master Timer interupt clear register */
#define HRTIM_MASTER_REG_MDIER 0x0C /*!< HRTIM Master Timer DMA/interrupt enable register         Address  */
#define HRTIM_MASTER_REG_MCNTR 0x10 /*!< HRTIM Master Timer counter register */
#define HRTIM_MASTER_REG_MPER 0x14 /*!< HRTIM Master Timer period register */
#define HRTIM_MASTER_REG_MREP 0x18 /*!< HRTIM Master Timer repetition register */
#define HRTIM_MASTER_REG_MCMP1R 0x1C /*!< HRTIM Master Timer compare 1 register */
#define HRTIM_MASTER_REG_MCMP2R 0x24 /*!< HRTIM Master Timer compare 2 register */
#define HRTIM_MASTER_REG_MCMP3R 0x28 /*!< HRTIM Master Timer compare 3 register */
#define HRTIM_MASTER_REG_MCMP4R 0x2C /*!< HRTIM Master Timer compare 4 register */

/* HRTIM Timer A to F registers definition */

#define HRTIMx_REG_TIMxCR 0x00 /*!< HRTIM Timerx control register  */
#define HRTIMx_REG_TIMxISR 0x04 /*!< HRTIM Timerx interrupt status register  */
#define HRTIMx_REG_TIMxICR 0x08 /*!< HRTIM Timerx interrupt clear register  */
#define HRTIMx_REG_TIMxDIER 0x0C /*!< HRTIM Timerx DMA/interrupt enable register  */
#define HRTIMx_REG_CNTxR 0x10 /*!< HRTIM Timerx counter register  */
#define HRTIMx_REG_PERxR 0x14 /*!< HRTIM Timerx period register  */
#define HRTIMx_REG_REPxR 0x18 /*!< HRTIM Timerx repetition register  */
#define HRTIMx_REG_CMP1xR 0x1C /*!< HRTIM Timerx compare 1 register  */
#define HRTIMx_REG_CMP1CxR 0x20 /*!< HRTIM Timerx compare 1 compound register  */
#define HRTIMx_REG_CMP2xR 0x24 /*!< HRTIM Timerx compare 2 register  */
#define HRTIMx_REG_CMP3xR 0x28 /*!< HRTIM Timerx compare 3 register  */
#define HRTIMx_REG_CMP4xR 0x2C /*!< HRTIM Timerx compare 4 register  */
#define HRTIMx_REG_CPT1xR 0x30 /*!< HRTIM Timerx capture 1 register  */
#define HRTIMx_REG_CPT2xR 0x34 /*!< HRTIM Timerx capture 2 register */
#define HRTIMx_REG_DTxR 0x38 /*!< HRTIM Timerx dead time register */
#define HRTIMx_REG_SETx1R 0x3C /*!< HRTIM Timerx output 1 set register */
#define HRTIMx_REG_RSTx1R 0x40 /*!< HRTIM Timerx output 1 reset register */
#define HRTIMx_REG_SETx2R 0x44 /*!< HRTIM Timerx output 2 set register */
#define HRTIMx_REG_RSTx2R 0x48 /*!< HRTIM Timerx output 2 reset register */
#define HRTIMx_REG_EEFxR1 0x4C /*!< HRTIM Timerx external event filtering 1 register */
#define HRTIMx_REG_EEFxR2 0x50 /*!< HRTIM Timerx external event filtering 2 register */
#define HRTIMx_REG_RSTxR 0x54 /*!< HRTIM Timerx Reset register */
#define HRTIMx_REG_CHPxR 0x58 /*!< HRTIM Timerx Chopper register */
#define HRTIMx_REG_CPT1xCR 0x5C /*!< HRTIM Timerx Capture 1 register */
#define HRTIMx_REG_CPT2xCR 0x60 /*!< HRTIM Timerx Capture 2 register */
#define HRTIMx_REG_OUTxR 0x64 /*!< HRTIM Timerx Output register */
#define HRTIMx_REG_FLTxR 0x68 /*!< HRTIM Timerx Fault register */
#define HRTIMx_REG_TIMxCR2 0x6C /*!< HRTIM Timerx Control register 2 */
#define HRTIMx_REG_EEFxR3 0x70 /*!< HRTIM Timerx external event filtering 3 register */

