pdietl/arm_mcu/inc/stm32g474xx_asm.h
/* HRTIM common register definition */

#define HRTIM_COMMON_REG_CR1 0x00 /*!< HRTIM control register1 */
#define HRTIM_COMMON_REG_CR2 0x04 /*!< HRTIM control register2 */
#define HRTIM_COMMON_REG_ISR 0x08 /*!< HRTIM interrupt status register */
#define HRTIM_COMMON_REG_ICR 0x0C /*!< HRTIM interrupt clear register */
#define HRTIM_COMMON_REG_IER 0x10 /*!< HRTIM interrupt enable register */
#define HRTIM_COMMON_REG_OENR 0x14 /*!< HRTIM Output enable register */
#define HRTIM_COMMON_REG_ODISR 0x18 /*!< HRTIM Output disable register */
#define HRTIM_COMMON_REG_ODSR 0x1C /*!< HRTIM Output disable status register */
#define HRTIM_COMMON_REG_BMCR 0x20 /*!< HRTIM Burst mode control register */
#define HRTIM_COMMON_REG_BMTRGR 0x24 /*!< HRTIM Busrt mode trigger register */
#define HRTIM_COMMON_REG_BMCMPR 0x28 /*!< HRTIM Burst mode compare register */
#define HRTIM_COMMON_REG_BMPER 0x2C /*!< HRTIM Burst mode period register */
#define HRTIM_COMMON_REG_EECR1 0x30 /*!< HRTIM Timer external event control register1 */
#define HRTIM_COMMON_REG_EECR2 0x34 /*!< HRTIM Timer external event control register2 */
#define HRTIM_COMMON_REG_EECR3 0x38 /*!< HRTIM Timer external event control register3 */
#define HRTIM_COMMON_REG_ADC1R 0x3C /*!< HRTIM ADC Trigger 1 register */
#define HRTIM_COMMON_REG_ADC2R 0x40 /*!< HRTIM ADC Trigger 2 register */
#define HRTIM_COMMON_REG_ADC3R 0x44 /*!< HRTIM ADC Trigger 3 register */
#define HRTIM_COMMON_REG_ADC4R 0x48 /*!< HRTIM ADC Trigger 4 register */
#define HRTIM_COMMON_REG_DLLCR 0x4C /*!< HRTIM DLL control register */
#define HRTIM_COMMON_REG_FLTINR1 0x50 /*!< HRTIM Fault input register1 */
#define HRTIM_COMMON_REG_FLTINR2 0x54 /*!< HRTIM Fault input register2 */
#define HRTIM_COMMON_REG_BDMUPR 0x58 /*!< HRTIM Burst DMA Master Timer update register */
#define HRTIM_COMMON_REG_BDTAUPR 0x5C /*!< HRTIM Burst DMA Timerx update register */
#define HRTIM_COMMON_REG_BDTBUPR 0x60 /*!< HRTIM Burst DMA Timerx update register */
#define HRTIM_COMMON_REG_BDTCUPR 0x64 /*!< HRTIM Burst DMA Timerx update register */
#define HRTIM_COMMON_REG_BDTDUPR 0x68 /*!< HRTIM Burst DMA Timerx update register */
#define HRTIM_COMMON_REG_BDTEUPR 0x6C /*!< HRTIM Burst DMA Timerx update register */
#define HRTIM_COMMON_REG_BDMADR 0x70 /*!< HRTIM Burst DMA Master Data register */
#define HRTIM_COMMON_REG_BDTFUPR 0x74 /*!< HRTIM Burst DMA Timerx update register */
#define HRTIM_COMMON_REG_ADCER 0x78 /*!< HRTIM ADC Extended Trigger register */
#define HRTIM_COMMON_REG_ADCUR 0x7C /*!< HRTIM ADC Trigger Update register */
#define HRTIM_COMMON_REG_ADCPS1 0x80 /*!< HRTIM ADC Post Scaler Register 1 */
#define HRTIM_COMMON_REG_ADCPS2 0x84 /*!< HRTIM ADC Post Scaler Register 2 */
#define HRTIM_COMMON_REG_FLTINR3 0x88 /*!< HRTIM Fault input register3 */
#define HRTIM_COMMON_REG_FLTINR4 0x8C /*!< HRTIM Fault input register4 */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE            (0x08000000) /*!< FLASH (up to 512 kB) base address */
#define SRAM1_BASE            (0x20000000) /*!< SRAM1(up to 80 KB) base address */
#define SRAM2_BASE            (0x20014000) /*!< SRAM2(16 KB) base address */
#define CCMSRAM_BASE          (0x10000000) /*!< CCMSRAM(32 KB) base address */
#define PERIPH_BASE           (0x40000000) /*!< Peripheral base address */
#define FMC_BASE              (0x60000000) /*!< FMC base address */
#define QSPI_BASE             (0x90000000) /*!< QUADSPI memories accessible over AHB base address */

#define FMC_R_BASE            (0xA0000000) /*!< FMC  control registers base address */
#define QSPI_R_BASE           (0xA0001000) /*!< QUADSPI control registers base address */
#define SRAM1_BB_BASE         (0x22000000) /*!< SRAM1(80 KB) base address in the bit-band region */
#define SRAM2_BB_BASE         (0x22280000) /*!< SRAM2(16 KB) base address in the bit-band region */
#define CCMSRAM_BB_BASE       (0x22300000) /*!< CCMSRAM(32 KB) base address in the bit-band region */
#define PERIPH_BB_BASE        (0x42000000) /*!< Peripheral base address in the bit-band region */
/* Legacy defines */
#define SRAM_BASE             SRAM1_BASE
#define SRAM_BB_BASE          SRAM1_BB_BASE

#define SRAM1_SIZE_MAX        (0x00014000) /*!< maximum SRAM1 size (up to 80 KBytes) */
#define SRAM2_SIZE            (0x00004000) /*!< SRAM2 size (16 KBytes) */
#define CCMSRAM_SIZE          (0x00008000) /*!< CCMSRAM size (32 KBytes) */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE        PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x00010000)
#define AHB1PERIPH_BASE       (PERIPH_BASE + 0x00020000)
#define AHB2PERIPH_BASE       (PERIPH_BASE + 0x08000000)

#define FMC_BANK1             FMC_BASE
#define FMC_BANK1_1           FMC_BANK1
#define FMC_BANK1_2           (FMC_BANK1 + 0x04000000)
#define FMC_BANK1_3           (FMC_BANK1 + 0x08000000)
#define FMC_BANK1_4           (FMC_BANK1 + 0x0C000000)
#define FMC_BANK3             (FMC_BASE  + 0x20000000)

/*!< APB1 peripherals */
#define TIM2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TIM3_BASE             (APB1PERIPH_BASE + 0x0400)
#define TIM4_BASE             (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE             (APB1PERIPH_BASE + 0x0C00)
#define TIM6_BASE             (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE             (APB1PERIPH_BASE + 0x1400)
#define CRS_BASE              (APB1PERIPH_BASE + 0x2000)
#define TAMP_BASE             (APB1PERIPH_BASE + 0x2400)
#define RTC_BASE              (APB1PERIPH_BASE + 0x2800)
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)
#define SPI3_BASE             (APB1PERIPH_BASE + 0x3C00)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE            (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800)
#define USB_BASE              (APB1PERIPH_BASE + 0x5C00)  /*!< USB_IP Peripheral Registers base address */
#define USB_PMAADDR           (APB1PERIPH_BASE + 0x6000)  /*!< USB_IP Packet Memory Area base address */
#define FDCAN1_BASE           (APB1PERIPH_BASE + 0x6400)
#define FDCAN_CONFIG_BASE     (APB1PERIPH_BASE + 0x6500)  /*!< FDCAN configuration registers base address */
#define FDCAN2_BASE           (APB1PERIPH_BASE + 0x6800)
#define FDCAN3_BASE           (APB1PERIPH_BASE + 0x6C00)
#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)
#define I2C3_BASE             (APB1PERIPH_BASE + 0x7800)
#define LPTIM1_BASE           (APB1PERIPH_BASE + 0x7C00)
#define LPUART1_BASE          (APB1PERIPH_BASE + 0x8000)
#define I2C4_BASE             (APB1PERIPH_BASE + 0x8400)
#define UCPD1_BASE            (APB1PERIPH_BASE + 0xA000)
#define SRAMCAN_BASE          (APB1PERIPH_BASE + 0xA400)

/*!< APB2 peripherals */
#define SYSCFG_BASE           (APB2PERIPH_BASE + 0x0000)
#define VREFBUF_BASE          (APB2PERIPH_BASE + 0x0030)
#define COMP1_BASE            (APB2PERIPH_BASE + 0x0200)
#define COMP2_BASE            (APB2PERIPH_BASE + 0x0204)
#define COMP3_BASE            (APB2PERIPH_BASE + 0x0208)
#define COMP4_BASE            (APB2PERIPH_BASE + 0x020C)
#define COMP5_BASE            (APB2PERIPH_BASE + 0x0210)
#define COMP6_BASE            (APB2PERIPH_BASE + 0x0214)
#define COMP7_BASE            (APB2PERIPH_BASE + 0x0218)
#define OPAMP_BASE            (APB2PERIPH_BASE + 0x0300)
#define OPAMP1_BASE           (APB2PERIPH_BASE + 0x0300)
#define OPAMP2_BASE           (APB2PERIPH_BASE + 0x0304)
#define OPAMP3_BASE           (APB2PERIPH_BASE + 0x0308)
#define OPAMP4_BASE           (APB2PERIPH_BASE + 0x030C)
#define OPAMP5_BASE           (APB2PERIPH_BASE + 0x0310)
#define OPAMP6_BASE           (APB2PERIPH_BASE + 0x0314)

