pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define HRTIM_EEFR1_EE2LTCH_Pos       (6)
#define HRTIM_EEFR1_EE2LTCH_Msk       (0x1 << HRTIM_EEFR1_EE2LTCH_Pos)       /*!< 0x00000040 */
#define HRTIM_EEFR1_EE2LTCH           HRTIM_EEFR1_EE2LTCH_Msk                  /*!< External Event 2 latch */
#define HRTIM_EEFR1_EE2FLTR_Pos       (7)
#define HRTIM_EEFR1_EE2FLTR_Msk       (0xF << HRTIM_EEFR1_EE2FLTR_Pos)       /*!< 0x00000780 */
#define HRTIM_EEFR1_EE2FLTR           HRTIM_EEFR1_EE2FLTR_Msk                  /*!< External Event 2 filter mask */
#define HRTIM_EEFR1_EE2FLTR_0         (0x1 << HRTIM_EEFR1_EE2FLTR_Pos)       /*!< 0x00000080 */
#define HRTIM_EEFR1_EE2FLTR_1         (0x2 << HRTIM_EEFR1_EE2FLTR_Pos)       /*!< 0x00000100 */
#define HRTIM_EEFR1_EE2FLTR_2         (0x4 << HRTIM_EEFR1_EE2FLTR_Pos)       /*!< 0x00000200 */
#define HRTIM_EEFR1_EE2FLTR_3         (0x8 << HRTIM_EEFR1_EE2FLTR_Pos)       /*!< 0x00000400 */

#define HRTIM_EEFR1_EE3LTCH_Pos       (12)
#define HRTIM_EEFR1_EE3LTCH_Msk       (0x1 << HRTIM_EEFR1_EE3LTCH_Pos)       /*!< 0x00001000 */
#define HRTIM_EEFR1_EE3LTCH           HRTIM_EEFR1_EE3LTCH_Msk                  /*!< External Event 3 latch */
#define HRTIM_EEFR1_EE3FLTR_Pos       (13)
#define HRTIM_EEFR1_EE3FLTR_Msk       (0xF << HRTIM_EEFR1_EE3FLTR_Pos)       /*!< 0x0001E000 */
#define HRTIM_EEFR1_EE3FLTR           HRTIM_EEFR1_EE3FLTR_Msk                  /*!< External Event 3 filter mask */
#define HRTIM_EEFR1_EE3FLTR_0         (0x1 << HRTIM_EEFR1_EE3FLTR_Pos)       /*!< 0x00002000 */
#define HRTIM_EEFR1_EE3FLTR_1         (0x2 << HRTIM_EEFR1_EE3FLTR_Pos)       /*!< 0x00004000 */
#define HRTIM_EEFR1_EE3FLTR_2         (0x4 << HRTIM_EEFR1_EE3FLTR_Pos)       /*!< 0x00008000 */
#define HRTIM_EEFR1_EE3FLTR_3         (0x8 << HRTIM_EEFR1_EE3FLTR_Pos)       /*!< 0x00010000 */

#define HRTIM_EEFR1_EE4LTCH_Pos       (18)
#define HRTIM_EEFR1_EE4LTCH_Msk       (0x1 << HRTIM_EEFR1_EE4LTCH_Pos)       /*!< 0x00040000 */
#define HRTIM_EEFR1_EE4LTCH           HRTIM_EEFR1_EE4LTCH_Msk                  /*!< External Event 4 latch */
#define HRTIM_EEFR1_EE4FLTR_Pos       (19)
#define HRTIM_EEFR1_EE4FLTR_Msk       (0xF << HRTIM_EEFR1_EE4FLTR_Pos)       /*!< 0x00780000 */
#define HRTIM_EEFR1_EE4FLTR           HRTIM_EEFR1_EE4FLTR_Msk                  /*!< External Event 4 filter mask */
#define HRTIM_EEFR1_EE4FLTR_0         (0x1 << HRTIM_EEFR1_EE4FLTR_Pos)       /*!< 0x00080000 */
#define HRTIM_EEFR1_EE4FLTR_1         (0x2 << HRTIM_EEFR1_EE4FLTR_Pos)       /*!< 0x00100000 */
#define HRTIM_EEFR1_EE4FLTR_2         (0x4 << HRTIM_EEFR1_EE4FLTR_Pos)       /*!< 0x00200000 */
#define HRTIM_EEFR1_EE4FLTR_3         (0x8 << HRTIM_EEFR1_EE4FLTR_Pos)       /*!< 0x00400000 */

#define HRTIM_EEFR1_EE5LTCH_Pos       (24)
#define HRTIM_EEFR1_EE5LTCH_Msk       (0x1 << HRTIM_EEFR1_EE5LTCH_Pos)       /*!< 0x01000000 */
#define HRTIM_EEFR1_EE5LTCH           HRTIM_EEFR1_EE5LTCH_Msk                  /*!< External Event 5 latch */
#define HRTIM_EEFR1_EE5FLTR_Pos       (25)
#define HRTIM_EEFR1_EE5FLTR_Msk       (0xF << HRTIM_EEFR1_EE5FLTR_Pos)       /*!< 0x1E000000 */
#define HRTIM_EEFR1_EE5FLTR           HRTIM_EEFR1_EE5FLTR_Msk                  /*!< External Event 5 filter mask */
#define HRTIM_EEFR1_EE5FLTR_0         (0x1 << HRTIM_EEFR1_EE5FLTR_Pos)       /*!< 0x02000000 */
#define HRTIM_EEFR1_EE5FLTR_1         (0x2 << HRTIM_EEFR1_EE5FLTR_Pos)       /*!< 0x04000000 */
#define HRTIM_EEFR1_EE5FLTR_2         (0x4 << HRTIM_EEFR1_EE5FLTR_Pos)       /*!< 0x08000000 */
#define HRTIM_EEFR1_EE5FLTR_3         (0x8 << HRTIM_EEFR1_EE5FLTR_Pos)       /*!< 0x10000000 */

/**** Bit definition for Slave external event filtering  register 2 ***********/
#define HRTIM_EEFR2_EE6LTCH_Pos       (0)
#define HRTIM_EEFR2_EE6LTCH_Msk       (0x1 << HRTIM_EEFR2_EE6LTCH_Pos)       /*!< 0x00000001 */
#define HRTIM_EEFR2_EE6LTCH           HRTIM_EEFR2_EE6LTCH_Msk                  /*!< External Event 6 latch */
#define HRTIM_EEFR2_EE6FLTR_Pos       (1)
#define HRTIM_EEFR2_EE6FLTR_Msk       (0xF << HRTIM_EEFR2_EE6FLTR_Pos)       /*!< 0x0000001E */
#define HRTIM_EEFR2_EE6FLTR           HRTIM_EEFR2_EE6FLTR_Msk                  /*!< External Event 6 filter mask */
#define HRTIM_EEFR2_EE6FLTR_0         (0x1 << HRTIM_EEFR2_EE6FLTR_Pos)       /*!< 0x00000002 */
#define HRTIM_EEFR2_EE6FLTR_1         (0x2 << HRTIM_EEFR2_EE6FLTR_Pos)       /*!< 0x00000004 */
#define HRTIM_EEFR2_EE6FLTR_2         (0x4 << HRTIM_EEFR2_EE6FLTR_Pos)       /*!< 0x00000008 */
#define HRTIM_EEFR2_EE6FLTR_3         (0x8 << HRTIM_EEFR2_EE6FLTR_Pos)       /*!< 0x00000010 */

#define HRTIM_EEFR2_EE7LTCH_Pos       (6)
#define HRTIM_EEFR2_EE7LTCH_Msk       (0x1 << HRTIM_EEFR2_EE7LTCH_Pos)       /*!< 0x00000040 */
#define HRTIM_EEFR2_EE7LTCH           HRTIM_EEFR2_EE7LTCH_Msk                  /*!< External Event 7 latch */
#define HRTIM_EEFR2_EE7FLTR_Pos       (7)
#define HRTIM_EEFR2_EE7FLTR_Msk       (0xF << HRTIM_EEFR2_EE7FLTR_Pos)       /*!< 0x00000780 */
#define HRTIM_EEFR2_EE7FLTR           HRTIM_EEFR2_EE7FLTR_Msk                  /*!< External Event 7 filter mask */
#define HRTIM_EEFR2_EE7FLTR_0         (0x1 << HRTIM_EEFR2_EE7FLTR_Pos)       /*!< 0x00000080 */
#define HRTIM_EEFR2_EE7FLTR_1         (0x2 << HRTIM_EEFR2_EE7FLTR_Pos)       /*!< 0x00000100 */
#define HRTIM_EEFR2_EE7FLTR_2         (0x4 << HRTIM_EEFR2_EE7FLTR_Pos)       /*!< 0x00000200 */
#define HRTIM_EEFR2_EE7FLTR_3         (0x8 << HRTIM_EEFR2_EE7FLTR_Pos)       /*!< 0x00000400 */

#define HRTIM_EEFR2_EE8LTCH_Pos       (12)
#define HRTIM_EEFR2_EE8LTCH_Msk       (0x1 << HRTIM_EEFR2_EE8LTCH_Pos)       /*!< 0x00001000 */
#define HRTIM_EEFR2_EE8LTCH           HRTIM_EEFR2_EE8LTCH_Msk                  /*!< External Event 8 latch */
#define HRTIM_EEFR2_EE8FLTR_Pos       (13)
#define HRTIM_EEFR2_EE8FLTR_Msk       (0xF << HRTIM_EEFR2_EE8FLTR_Pos)       /*!< 0x0001E000 */
#define HRTIM_EEFR2_EE8FLTR           HRTIM_EEFR2_EE8FLTR_Msk                  /*!< External Event 8 filter mask */
#define HRTIM_EEFR2_EE8FLTR_0         (0x1 << HRTIM_EEFR2_EE8FLTR_Pos)       /*!< 0x00002000 */
#define HRTIM_EEFR2_EE8FLTR_1         (0x2 << HRTIM_EEFR2_EE8FLTR_Pos)       /*!< 0x00004000 */
#define HRTIM_EEFR2_EE8FLTR_2         (0x4 << HRTIM_EEFR2_EE8FLTR_Pos)       /*!< 0x00008000 */
#define HRTIM_EEFR2_EE8FLTR_3         (0x8 << HRTIM_EEFR2_EE8FLTR_Pos)       /*!< 0x00010000 */

#define HRTIM_EEFR2_EE9LTCH_Pos       (18)
#define HRTIM_EEFR2_EE9LTCH_Msk       (0x1 << HRTIM_EEFR2_EE9LTCH_Pos)       /*!< 0x00040000 */
#define HRTIM_EEFR2_EE9LTCH           HRTIM_EEFR2_EE9LTCH_Msk                  /*!< External Event 9 latch */
#define HRTIM_EEFR2_EE9FLTR_Pos       (19)
#define HRTIM_EEFR2_EE9FLTR_Msk       (0xF << HRTIM_EEFR2_EE9FLTR_Pos)       /*!< 0x00780000 */
#define HRTIM_EEFR2_EE9FLTR           HRTIM_EEFR2_EE9FLTR_Msk                  /*!< External Event 9 filter mask */
#define HRTIM_EEFR2_EE9FLTR_0         (0x1 << HRTIM_EEFR2_EE9FLTR_Pos)       /*!< 0x00080000 */
#define HRTIM_EEFR2_EE9FLTR_1         (0x2 << HRTIM_EEFR2_EE9FLTR_Pos)       /*!< 0x00100000 */
#define HRTIM_EEFR2_EE9FLTR_2         (0x4 << HRTIM_EEFR2_EE9FLTR_Pos)       /*!< 0x00200000 */
#define HRTIM_EEFR2_EE9FLTR_3         (0x8 << HRTIM_EEFR2_EE9FLTR_Pos)       /*!< 0x00400000 */

#define HRTIM_EEFR2_EE10LTCH_Pos      (24)
#define HRTIM_EEFR2_EE10LTCH_Msk      (0x1 << HRTIM_EEFR2_EE10LTCH_Pos)      /*!< 0x01000000 */
#define HRTIM_EEFR2_EE10LTCH          HRTIM_EEFR2_EE10LTCH_Msk                 /*!< External Event 10 latch */
#define HRTIM_EEFR2_EE10FLTR_Pos      (25)
#define HRTIM_EEFR2_EE10FLTR_Msk      (0xF << HRTIM_EEFR2_EE10FLTR_Pos)      /*!< 0x1E000000 */
#define HRTIM_EEFR2_EE10FLTR          HRTIM_EEFR2_EE10FLTR_Msk                 /*!< External Event 10 filter mask */
#define HRTIM_EEFR2_EE10FLTR_0        (0x1 << HRTIM_EEFR2_EE10FLTR_Pos)      /*!< 0x02000000 */
#define HRTIM_EEFR2_EE10FLTR_1        (0x2 << HRTIM_EEFR2_EE10FLTR_Pos)      /*!< 0x04000000 */
#define HRTIM_EEFR2_EE10FLTR_2        (0x4 << HRTIM_EEFR2_EE10FLTR_Pos)      /*!< 0x08000000 */
#define HRTIM_EEFR2_EE10FLTR_3        (0x8 << HRTIM_EEFR2_EE10FLTR_Pos)      /*!< 0x10000000 */

/**** Bit definition for Slave Timer reset register ***************************/

#define HRTIM_RSTR_TIMFCMP1_Pos       (0)
#define HRTIM_RSTR_TIMFCMP1_Msk       (0x1 << HRTIM_RSTR_TIMFCMP1_Pos)       /*!< 0x00000001 */
#define HRTIM_RSTR_TIMFCMP1           HRTIM_RSTR_TIMFCMP1_Msk                  /*!< Timer F compare 1 */
#define HRTIM_RSTR_UPDATE_Pos         (1)
#define HRTIM_RSTR_UPDATE_Msk         (0x1 << HRTIM_RSTR_UPDATE_Pos)         /*!< 0x00000002 */
#define HRTIM_RSTR_UPDATE             HRTIM_RSTR_UPDATE_Msk                    /*!< Timer update */
#define HRTIM_RSTR_CMP2_Pos           (2)
#define HRTIM_RSTR_CMP2_Msk           (0x1 << HRTIM_RSTR_CMP2_Pos)           /*!< 0x00000004 */
#define HRTIM_RSTR_CMP2               HRTIM_RSTR_CMP2_Msk                      /*!< Timer compare2 */
#define HRTIM_RSTR_CMP4_Pos           (3)
#define HRTIM_RSTR_CMP4_Msk           (0x1 << HRTIM_RSTR_CMP4_Pos)           /*!< 0x00000008 */
#define HRTIM_RSTR_CMP4               HRTIM_RSTR_CMP4_Msk                      /*!< Timer compare4 */
#define HRTIM_RSTR_MSTPER_Pos         (4)
#define HRTIM_RSTR_MSTPER_Msk         (0x1 << HRTIM_RSTR_MSTPER_Pos)         /*!< 0x00000010 */
#define HRTIM_RSTR_MSTPER             HRTIM_RSTR_MSTPER_Msk                    /*!< Master period */
#define HRTIM_RSTR_MSTCMP1_Pos        (5)
#define HRTIM_RSTR_MSTCMP1_Msk        (0x1 << HRTIM_RSTR_MSTCMP1_Pos)        /*!< 0x00000020 */
#define HRTIM_RSTR_MSTCMP1            HRTIM_RSTR_MSTCMP1_Msk                   /*!< Master compare1 */
#define HRTIM_RSTR_MSTCMP2_Pos        (6)
#define HRTIM_RSTR_MSTCMP2_Msk        (0x1 << HRTIM_RSTR_MSTCMP2_Pos)        /*!< 0x00000040 */
#define HRTIM_RSTR_MSTCMP2            HRTIM_RSTR_MSTCMP2_Msk                   /*!< Master compare2 */
#define HRTIM_RSTR_MSTCMP3_Pos        (7)
#define HRTIM_RSTR_MSTCMP3_Msk        (0x1 << HRTIM_RSTR_MSTCMP3_Pos)        /*!< 0x00000080 */
#define HRTIM_RSTR_MSTCMP3            HRTIM_RSTR_MSTCMP3_Msk                   /*!< Master compare3 */
#define HRTIM_RSTR_MSTCMP4_Pos        (8)
#define HRTIM_RSTR_MSTCMP4_Msk        (0x1 << HRTIM_RSTR_MSTCMP4_Pos)        /*!< 0x00000100 */
#define HRTIM_RSTR_MSTCMP4            HRTIM_RSTR_MSTCMP4_Msk                   /*!< Master compare4 */
#define HRTIM_RSTR_EXTEVNT1_Pos       (9)
#define HRTIM_RSTR_EXTEVNT1_Msk       (0x1 << HRTIM_RSTR_EXTEVNT1_Pos)       /*!< 0x00000200 */
#define HRTIM_RSTR_EXTEVNT1           HRTIM_RSTR_EXTEVNT1_Msk                  /*!< External event 1 */
#define HRTIM_RSTR_EXTEVNT2_Pos       (10)
#define HRTIM_RSTR_EXTEVNT2_Msk       (0x1 << HRTIM_RSTR_EXTEVNT2_Pos)       /*!< 0x00000400 */
#define HRTIM_RSTR_EXTEVNT2           HRTIM_RSTR_EXTEVNT2_Msk                  /*!< External event 2 */
#define HRTIM_RSTR_EXTEVNT3_Pos       (11)
#define HRTIM_RSTR_EXTEVNT3_Msk       (0x1 << HRTIM_RSTR_EXTEVNT3_Pos)       /*!< 0x00000800 */
#define HRTIM_RSTR_EXTEVNT3           HRTIM_RSTR_EXTEVNT3_Msk                  /*!< External event 3 */
#define HRTIM_RSTR_EXTEVNT4_Pos       (12)
#define HRTIM_RSTR_EXTEVNT4_Msk       (0x1 << HRTIM_RSTR_EXTEVNT4_Pos)       /*!< 0x00001000 */
#define HRTIM_RSTR_EXTEVNT4           HRTIM_RSTR_EXTEVNT4_Msk                  /*!< External event 4 */
#define HRTIM_RSTR_EXTEVNT5_Pos       (13)
#define HRTIM_RSTR_EXTEVNT5_Msk       (0x1 << HRTIM_RSTR_EXTEVNT5_Pos)       /*!< 0x00002000 */
#define HRTIM_RSTR_EXTEVNT5           HRTIM_RSTR_EXTEVNT5_Msk                  /*!< External event 5 */
#define HRTIM_RSTR_EXTEVNT6_Pos       (14)
#define HRTIM_RSTR_EXTEVNT6_Msk       (0x1 << HRTIM_RSTR_EXTEVNT6_Pos)       /*!< 0x00004000 */
#define HRTIM_RSTR_EXTEVNT6           HRTIM_RSTR_EXTEVNT6_Msk                  /*!< External event 6 */
#define HRTIM_RSTR_EXTEVNT7_Pos       (15)
#define HRTIM_RSTR_EXTEVNT7_Msk       (0x1 << HRTIM_RSTR_EXTEVNT7_Pos)       /*!< 0x00008000 */
#define HRTIM_RSTR_EXTEVNT7           HRTIM_RSTR_EXTEVNT7_Msk                  /*!< External event 7 */
#define HRTIM_RSTR_EXTEVNT8_Pos       (16)
#define HRTIM_RSTR_EXTEVNT8_Msk       (0x1 << HRTIM_RSTR_EXTEVNT8_Pos)       /*!< 0x00010000 */
#define HRTIM_RSTR_EXTEVNT8           HRTIM_RSTR_EXTEVNT8_Msk                  /*!< External event 8 */
#define HRTIM_RSTR_EXTEVNT9_Pos       (17)
#define HRTIM_RSTR_EXTEVNT9_Msk       (0x1 << HRTIM_RSTR_EXTEVNT9_Pos)       /*!< 0x00020000 */
#define HRTIM_RSTR_EXTEVNT9           HRTIM_RSTR_EXTEVNT9_Msk                  /*!< External event 9 */
#define HRTIM_RSTR_EXTEVNT10_Pos      (18)
#define HRTIM_RSTR_EXTEVNT10_Msk      (0x1 << HRTIM_RSTR_EXTEVNT10_Pos)      /*!< 0x00040000 */
#define HRTIM_RSTR_EXTEVNT10          HRTIM_RSTR_EXTEVNT10_Msk                 /*!< External event 10 */

/* Slave Timer A reset enable bits upon other slave timers events */
#define HRTIM_RSTR_TIMBCMP1_Pos       (19)
#define HRTIM_RSTR_TIMBCMP1_Msk       (0x1 << HRTIM_RSTR_TIMBCMP1_Pos)       /*!< 0x00080000 */
#define HRTIM_RSTR_TIMBCMP1           HRTIM_RSTR_TIMBCMP1_Msk                  /*!< Timer B compare 1 */
#define HRTIM_RSTR_TIMBCMP2_Pos       (20)
#define HRTIM_RSTR_TIMBCMP2_Msk       (0x1 << HRTIM_RSTR_TIMBCMP2_Pos)       /*!< 0x00100000 */
#define HRTIM_RSTR_TIMBCMP2           HRTIM_RSTR_TIMBCMP2_Msk                  /*!< Timer B compare 2 */
#define HRTIM_RSTR_TIMBCMP4_Pos       (21)
#define HRTIM_RSTR_TIMBCMP4_Msk       (0x1 << HRTIM_RSTR_TIMBCMP4_Pos)       /*!< 0x00200000 */
#define HRTIM_RSTR_TIMBCMP4           HRTIM_RSTR_TIMBCMP4_Msk                  /*!< Timer B compare 4 */

