pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define HRTIM_RSTCR_TIMECMP1_Pos       (28)
#define HRTIM_RSTCR_TIMECMP1_Msk       (0x1 << HRTIM_RSTCR_TIMECMP1_Pos)        /*!< 0x10000000 */
#define HRTIM_RSTCR_TIMECMP1           HRTIM_RSTCR_TIMECMP1_Msk                  /*!< Timer E compare 1 */
#define HRTIM_RSTCR_TIMECMP2_Pos       (29)
#define HRTIM_RSTCR_TIMECMP2_Msk       (0x1 << HRTIM_RSTCR_TIMECMP2_Pos)        /*!< 0x20000000 */
#define HRTIM_RSTCR_TIMECMP2           HRTIM_RSTCR_TIMECMP2_Msk                  /*!< Timer E compare 2 */
#define HRTIM_RSTCR_TIMECMP4_Pos       (30)
#define HRTIM_RSTCR_TIMECMP4_Msk       (0x1 << HRTIM_RSTCR_TIMECMP4_Pos)        /*!< 0x40000000 */
#define HRTIM_RSTCR_TIMECMP4           HRTIM_RSTCR_TIMECMP4_Msk                  /*!< Timer E compare 4 */

#define HRTIM_RSTCR_TIMFCMP2_Pos       (31)
#define HRTIM_RSTCR_TIMFCMP2_Msk       (0x1 << HRTIM_RSTCR_TIMFCMP2_Pos)       /*!< 0x80000000 */
#define HRTIM_RSTCR_TIMFCMP2           HRTIM_RSTCR_TIMFCMP2_Msk                  /*!< Timer F compare 2 */

/* Slave Timer D reset enable bits upon other slave timers events */
#define HRTIM_RSTDR_TIMACMP1_Pos       (19)
#define HRTIM_RSTDR_TIMACMP1_Msk       (0x1 << HRTIM_RSTDR_TIMACMP1_Pos)        /*!< 0x00080000 */
#define HRTIM_RSTDR_TIMACMP1           HRTIM_RSTDR_TIMACMP1_Msk                  /*!< Timer A compare 1 */
#define HRTIM_RSTDR_TIMACMP2_Pos       (20)
#define HRTIM_RSTDR_TIMACMP2_Msk       (0x1 << HRTIM_RSTDR_TIMACMP2_Pos)        /*!< 0x00100000 */
#define HRTIM_RSTDR_TIMACMP2           HRTIM_RSTDR_TIMACMP2_Msk                  /*!< Timer A compare 2 */
#define HRTIM_RSTDR_TIMACMP4_Pos       (21)
#define HRTIM_RSTDR_TIMACMP4_Msk       (0x1 << HRTIM_RSTDR_TIMACMP4_Pos)        /*!< 0x00200000 */
#define HRTIM_RSTDR_TIMACMP4           HRTIM_RSTDR_TIMACMP4_Msk                  /*!< Timer A compare 4 */

#define HRTIM_RSTDR_TIMBCMP1_Pos       (22)
#define HRTIM_RSTDR_TIMBCMP1_Msk       (0x1 << HRTIM_RSTDR_TIMBCMP1_Pos)        /*!< 0x00400000 */
#define HRTIM_RSTDR_TIMBCMP1           HRTIM_RSTDR_TIMBCMP1_Msk                  /*!< Timer B compare 1 */
#define HRTIM_RSTDR_TIMBCMP2_Pos       (23)
#define HRTIM_RSTDR_TIMBCMP2_Msk       (0x1 << HRTIM_RSTDR_TIMBCMP2_Pos)        /*!< 0x00800000 */
#define HRTIM_RSTDR_TIMBCMP2           HRTIM_RSTDR_TIMBCMP2_Msk                  /*!< Timer B compare 2 */
#define HRTIM_RSTDR_TIMBCMP4_Pos       (24)
#define HRTIM_RSTDR_TIMBCMP4_Msk       (0x1 << HRTIM_RSTDR_TIMBCMP4_Pos)        /*!< 0x01000000 */
#define HRTIM_RSTDR_TIMBCMP4           HRTIM_RSTDR_TIMBCMP4_Msk                  /*!< Timer B compare 4 */

#define HRTIM_RSTDR_TIMCCMP1_Pos       (25)
#define HRTIM_RSTDR_TIMCCMP1_Msk       (0x1 << HRTIM_RSTDR_TIMCCMP1_Pos)        /*!< 0x02000000 */
#define HRTIM_RSTDR_TIMCCMP1           HRTIM_RSTDR_TIMCCMP1_Msk                  /*!< Timer C compare 1 */
#define HRTIM_RSTDR_TIMCCMP2_Pos       (26)
#define HRTIM_RSTDR_TIMCCMP2_Msk       (0x1 << HRTIM_RSTDR_TIMCCMP2_Pos)        /*!< 0x04000000 */
#define HRTIM_RSTDR_TIMCCMP2           HRTIM_RSTDR_TIMCCMP2_Msk                  /*!< Timer C compare 2 */
#define HRTIM_RSTDR_TIMCCMP4_Pos       (27)
#define HRTIM_RSTDR_TIMCCMP4_Msk       (0x1 << HRTIM_RSTDR_TIMCCMP4_Pos)        /*!< 0x08000000 */
#define HRTIM_RSTDR_TIMCCMP4           HRTIM_RSTDR_TIMCCMP4_Msk                  /*!< Timer C compare 4 */

#define HRTIM_RSTDR_TIMECMP1_Pos       (28)
#define HRTIM_RSTDR_TIMECMP1_Msk       (0x1 << HRTIM_RSTDR_TIMECMP1_Pos)        /*!< 0x10000000 */
#define HRTIM_RSTDR_TIMECMP1           HRTIM_RSTDR_TIMECMP1_Msk                  /*!< Timer E compare 1 */
#define HRTIM_RSTDR_TIMECMP2_Pos       (29)
#define HRTIM_RSTDR_TIMECMP2_Msk       (0x1 << HRTIM_RSTDR_TIMECMP2_Pos)        /*!< 0x20000000 */
#define HRTIM_RSTDR_TIMECMP2           HRTIM_RSTDR_TIMECMP2_Msk                  /*!< Timer E compare 2 */
#define HRTIM_RSTDR_TIMECMP4_Pos       (30)
#define HRTIM_RSTDR_TIMECMP4_Msk       (0x1 << HRTIM_RSTDR_TIMECMP4_Pos)        /*!< 0x40000000 */
#define HRTIM_RSTDR_TIMECMP4           HRTIM_RSTDR_TIMECMP4_Msk                  /*!< Timer E compare 4 */

#define HRTIM_RSTDR_TIMFCMP2_Pos       (31)
#define HRTIM_RSTDR_TIMFCMP2_Msk       (0x1 << HRTIM_RSTDR_TIMFCMP2_Pos)       /*!< 0x80000000 */
#define HRTIM_RSTDR_TIMFCMP2           HRTIM_RSTDR_TIMFCMP2_Msk                  /*!< Timer F compare 2 */

/* Slave Timer E reset enable bits upon other slave timers events */
#define HRTIM_RSTER_TIMACMP1_Pos       (19)
#define HRTIM_RSTER_TIMACMP1_Msk       (0x1 << HRTIM_RSTER_TIMACMP1_Pos)        /*!< 0x00080000 */
#define HRTIM_RSTER_TIMACMP1           HRTIM_RSTER_TIMACMP1_Msk                  /*!< Timer A compare 1 */
#define HRTIM_RSTER_TIMACMP2_Pos       (20)
#define HRTIM_RSTER_TIMACMP2_Msk       (0x1 << HRTIM_RSTER_TIMACMP2_Pos)        /*!< 0x00100000 */
#define HRTIM_RSTER_TIMACMP2           HRTIM_RSTER_TIMACMP2_Msk                  /*!< Timer A compare 2 */
#define HRTIM_RSTER_TIMACMP4_Pos       (21)
#define HRTIM_RSTER_TIMACMP4_Msk       (0x1 << HRTIM_RSTER_TIMACMP4_Pos)        /*!< 0x00200000 */
#define HRTIM_RSTER_TIMACMP4           HRTIM_RSTER_TIMACMP4_Msk                  /*!< Timer A compare 4 */

#define HRTIM_RSTER_TIMBCMP1_Pos       (22)
#define HRTIM_RSTER_TIMBCMP1_Msk       (0x1 << HRTIM_RSTER_TIMBCMP1_Pos)        /*!< 0x00400000 */
#define HRTIM_RSTER_TIMBCMP1           HRTIM_RSTER_TIMBCMP1_Msk                  /*!< Timer B compare 1 */
#define HRTIM_RSTER_TIMBCMP2_Pos       (23)
#define HRTIM_RSTER_TIMBCMP2_Msk       (0x1 << HRTIM_RSTER_TIMBCMP2_Pos)        /*!< 0x00800000 */
#define HRTIM_RSTER_TIMBCMP2           HRTIM_RSTER_TIMBCMP2_Msk                  /*!< Timer B compare 2 */
#define HRTIM_RSTER_TIMBCMP4_Pos       (24)
#define HRTIM_RSTER_TIMBCMP4_Msk       (0x1 << HRTIM_RSTER_TIMBCMP4_Pos)        /*!< 0x01000000 */
#define HRTIM_RSTER_TIMBCMP4           HRTIM_RSTER_TIMBCMP4_Msk                  /*!< Timer B compare 4 */

#define HRTIM_RSTER_TIMCCMP1_Pos       (25)
#define HRTIM_RSTER_TIMCCMP1_Msk       (0x1 << HRTIM_RSTER_TIMCCMP1_Pos)        /*!< 0x02000000 */
#define HRTIM_RSTER_TIMCCMP1           HRTIM_RSTER_TIMCCMP1_Msk                  /*!< Timer C compare 1 */
#define HRTIM_RSTER_TIMCCMP2_Pos       (26)
#define HRTIM_RSTER_TIMCCMP2_Msk       (0x1 << HRTIM_RSTER_TIMCCMP2_Pos)        /*!< 0x04000000 */
#define HRTIM_RSTER_TIMCCMP2           HRTIM_RSTER_TIMCCMP2_Msk                  /*!< Timer C compare 2 */
#define HRTIM_RSTER_TIMCCMP4_Pos       (27)
#define HRTIM_RSTER_TIMCCMP4_Msk       (0x1 << HRTIM_RSTER_TIMCCMP4_Pos)        /*!< 0x08000000 */
#define HRTIM_RSTER_TIMCCMP4           HRTIM_RSTER_TIMCCMP4_Msk                  /*!< Timer C compare 4 */

#define HRTIM_RSTER_TIMDCMP1_Pos       (28)
#define HRTIM_RSTER_TIMDCMP1_Msk       (0x1 << HRTIM_RSTER_TIMDCMP1_Pos)        /*!< 0x10000000 */
#define HRTIM_RSTER_TIMDCMP1           HRTIM_RSTER_TIMDCMP1_Msk                  /*!< Timer D compare 1 */
#define HRTIM_RSTER_TIMDCMP2_Pos       (29)
#define HRTIM_RSTER_TIMDCMP2_Msk       (0x1 << HRTIM_RSTER_TIMDCMP2_Pos)        /*!< 0x20000000 */
#define HRTIM_RSTER_TIMDCMP2           HRTIM_RSTER_TIMDCMP2_Msk                  /*!< Timer D compare 2 */
#define HRTIM_RSTER_TIMDCMP4_Pos       (30)
#define HRTIM_RSTER_TIMDCMP4_Msk       (0x1 << HRTIM_RSTER_TIMDCMP4_Pos)        /*!< 0x40000000 */
#define HRTIM_RSTER_TIMDCMP4           HRTIM_RSTER_TIMDCMP4_Msk                  /*!< Timer D compare 4 */

#define HRTIM_RSTER_TIMFCMP2_Pos       (31)
#define HRTIM_RSTER_TIMFCMP2_Msk       (0x1 << HRTIM_RSTER_TIMFCMP2_Pos)       /*!< 0x80000000 */
#define HRTIM_RSTER_TIMFCMP2           HRTIM_RSTER_TIMFCMP2_Msk                  /*!< Timer F compare 2 */

