pdietl/arm_mcu/inc/stm32g474xx_asm.h
/* Slave Timer F reset enable bits upon other slave timers events */
#define HRTIM_RSTFR_TIMACMP1_Pos       (19)
#define HRTIM_RSTFR_TIMACMP1_Msk       (0x1 << HRTIM_RSTFR_TIMACMP1_Pos)        /*!< 0x00080000 */
#define HRTIM_RSTFR_TIMACMP1           HRTIM_RSTFR_TIMACMP1_Msk                  /*!< Timer A compare 1 */
#define HRTIM_RSTFR_TIMACMP2_Pos       (20)
#define HRTIM_RSTFR_TIMACMP2_Msk       (0x1 << HRTIM_RSTFR_TIMACMP2_Pos)        /*!< 0x00100000 */
#define HRTIM_RSTFR_TIMACMP2           HRTIM_RSTFR_TIMACMP2_Msk                  /*!< Timer A compare 2 */
#define HRTIM_RSTFR_TIMACMP4_Pos       (21)
#define HRTIM_RSTFR_TIMACMP4_Msk       (0x1 << HRTIM_RSTFR_TIMACMP4_Pos)        /*!< 0x00200000 */
#define HRTIM_RSTFR_TIMACMP4           HRTIM_RSTFR_TIMACMP4_Msk                  /*!< Timer A compare 4 */

#define HRTIM_RSTFR_TIMBCMP1_Pos       (22)
#define HRTIM_RSTFR_TIMBCMP1_Msk       (0x1 << HRTIM_RSTFR_TIMBCMP1_Pos)        /*!< 0x00400000 */
#define HRTIM_RSTFR_TIMBCMP1           HRTIM_RSTFR_TIMBCMP1_Msk                  /*!< Timer B compare 1 */
#define HRTIM_RSTFR_TIMBCMP2_Pos       (23)
#define HRTIM_RSTFR_TIMBCMP2_Msk       (0x1 << HRTIM_RSTFR_TIMBCMP2_Pos)        /*!< 0x00800000 */
#define HRTIM_RSTFR_TIMBCMP2           HRTIM_RSTFR_TIMBCMP2_Msk                  /*!< Timer B compare 2 */
#define HRTIM_RSTFR_TIMBCMP4_Pos       (24)
#define HRTIM_RSTFR_TIMBCMP4_Msk       (0x1 << HRTIM_RSTFR_TIMBCMP4_Pos)        /*!< 0x01000000 */
#define HRTIM_RSTFR_TIMBCMP4           HRTIM_RSTFR_TIMBCMP4_Msk                  /*!< Timer B compare 4 */

#define HRTIM_RSTFR_TIMCCMP1_Pos       (25)
#define HRTIM_RSTFR_TIMCCMP1_Msk       (0x1 << HRTIM_RSTFR_TIMCCMP1_Pos)        /*!< 0x02000000 */
#define HRTIM_RSTFR_TIMCCMP1           HRTIM_RSTFR_TIMCCMP1_Msk                  /*!< Timer C compare 1 */
#define HRTIM_RSTFR_TIMCCMP2_Pos       (26)
#define HRTIM_RSTFR_TIMCCMP2_Msk       (0x1 << HRTIM_RSTFR_TIMCCMP2_Pos)        /*!< 0x04000000 */
#define HRTIM_RSTFR_TIMCCMP2           HRTIM_RSTFR_TIMCCMP2_Msk                  /*!< Timer C compare 2 */
#define HRTIM_RSTFR_TIMCCMP4_Pos       (27)
#define HRTIM_RSTFR_TIMCCMP4_Msk       (0x1 << HRTIM_RSTFR_TIMCCMP4_Pos)        /*!< 0x08000000 */
#define HRTIM_RSTFR_TIMCCMP4           HRTIM_RSTFR_TIMCCMP4_Msk                  /*!< Timer C compare 4 */

#define HRTIM_RSTFR_TIMDCMP1_Pos       (28)
#define HRTIM_RSTFR_TIMDCMP1_Msk       (0x1 << HRTIM_RSTFR_TIMDCMP1_Pos)        /*!< 0x10000000 */
#define HRTIM_RSTFR_TIMDCMP1           HRTIM_RSTFR_TIMDCMP1_Msk                  /*!< Timer D compare 1 */
#define HRTIM_RSTFR_TIMDCMP2_Pos       (29)
#define HRTIM_RSTFR_TIMDCMP2_Msk       (0x1 << HRTIM_RSTFR_TIMDCMP2_Pos)        /*!< 0x20000000 */
#define HRTIM_RSTFR_TIMDCMP2           HRTIM_RSTFR_TIMDCMP2_Msk                  /*!< Timer D compare 2 */
#define HRTIM_RSTFR_TIMDCMP4_Pos       (30)
#define HRTIM_RSTFR_TIMDCMP4_Msk       (0x1 << HRTIM_RSTFR_TIMDCMP4_Pos)        /*!< 0x40000000 */
#define HRTIM_RSTFR_TIMDCMP4           HRTIM_RSTFR_TIMDCMP4_Msk                  /*!< Timer D compare 4 */

#define HRTIM_RSTFR_TIMECMP2_Pos       (31)
#define HRTIM_RSTFR_TIMECMP2_Msk       (0x1 << HRTIM_RSTFR_TIMECMP2_Pos)       /*!< 0x80000000 */
#define HRTIM_RSTFR_TIMECMP2           HRTIM_RSTFR_TIMECMP2_Msk                  /*!< Timer E compare 2 */

/**** Bit definition for Slave Timer Chopper register *************************/
#define HRTIM_CHPR_CARFRQ_Pos         (0)
#define HRTIM_CHPR_CARFRQ_Msk         (0xF << HRTIM_CHPR_CARFRQ_Pos)         /*!< 0x0000000F */
#define HRTIM_CHPR_CARFRQ             HRTIM_CHPR_CARFRQ_Msk                    /*!< Timer carrier frequency value */
#define HRTIM_CHPR_CARFRQ_0           (0x1 << HRTIM_CHPR_CARFRQ_Pos)         /*!< 0x00000001 */
#define HRTIM_CHPR_CARFRQ_1           (0x2 << HRTIM_CHPR_CARFRQ_Pos)         /*!< 0x00000002 */
#define HRTIM_CHPR_CARFRQ_2           (0x4 << HRTIM_CHPR_CARFRQ_Pos)         /*!< 0x00000004 */
#define HRTIM_CHPR_CARFRQ_3           (0x8 << HRTIM_CHPR_CARFRQ_Pos)         /*!< 0x00000008 */

#define HRTIM_CHPR_CARDTY_Pos         (4)
#define HRTIM_CHPR_CARDTY_Msk         (0x7 << HRTIM_CHPR_CARDTY_Pos)         /*!< 0x00000070 */
#define HRTIM_CHPR_CARDTY             HRTIM_CHPR_CARDTY_Msk                    /*!< Timer chopper duty cycle value */
#define HRTIM_CHPR_CARDTY_0           (0x1 << HRTIM_CHPR_CARDTY_Pos)         /*!< 0x00000010 */
#define HRTIM_CHPR_CARDTY_1           (0x2 << HRTIM_CHPR_CARDTY_Pos)         /*!< 0x00000020 */
#define HRTIM_CHPR_CARDTY_2           (0x4 << HRTIM_CHPR_CARDTY_Pos)         /*!< 0x00000040 */

#define HRTIM_CHPR_STRPW_Pos          (7)
#define HRTIM_CHPR_STRPW_Msk          (0xF << HRTIM_CHPR_STRPW_Pos)          /*!< 0x00000780 */
#define HRTIM_CHPR_STRPW              HRTIM_CHPR_STRPW_Msk                     /*!< Timer start pulse width value */
#define HRTIM_CHPR_STRPW_0            (0x1 << HRTIM_CHPR_STRPW_Pos)          /*!< 0x00000080 */
#define HRTIM_CHPR_STRPW_1            (0x2 << HRTIM_CHPR_STRPW_Pos)          /*!< 0x00000100 */
#define HRTIM_CHPR_STRPW_2            (0x4 << HRTIM_CHPR_STRPW_Pos)          /*!< 0x00000200 */
#define HRTIM_CHPR_STRPW_3            (0x8 << HRTIM_CHPR_STRPW_Pos)          /*!< 0x00000400 */

/**** Bit definition for Slave Timer Capture 1 control register ***************/
#define HRTIM_CPT1CR_SWCPT_Pos        (0)
#define HRTIM_CPT1CR_SWCPT_Msk        (0x1 << HRTIM_CPT1CR_SWCPT_Pos)        /*!< 0x00000001 */
#define HRTIM_CPT1CR_SWCPT            HRTIM_CPT1CR_SWCPT_Msk                   /*!< Software capture */
#define HRTIM_CPT1CR_UPDCPT_Pos       (1)
#define HRTIM_CPT1CR_UPDCPT_Msk       (0x1 << HRTIM_CPT1CR_UPDCPT_Pos)       /*!< 0x00000002 */
#define HRTIM_CPT1CR_UPDCPT           HRTIM_CPT1CR_UPDCPT_Msk                  /*!< Update capture */
#define HRTIM_CPT1CR_EXEV1CPT_Pos     (2)
#define HRTIM_CPT1CR_EXEV1CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV1CPT_Pos)     /*!< 0x00000004 */
#define HRTIM_CPT1CR_EXEV1CPT         HRTIM_CPT1CR_EXEV1CPT_Msk                /*!< External event 1 capture */
#define HRTIM_CPT1CR_EXEV2CPT_Pos     (3)
#define HRTIM_CPT1CR_EXEV2CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV2CPT_Pos)     /*!< 0x00000008 */
#define HRTIM_CPT1CR_EXEV2CPT         HRTIM_CPT1CR_EXEV2CPT_Msk                /*!< External event 2 capture */
#define HRTIM_CPT1CR_EXEV3CPT_Pos     (4)
#define HRTIM_CPT1CR_EXEV3CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV3CPT_Pos)     /*!< 0x00000010 */
#define HRTIM_CPT1CR_EXEV3CPT         HRTIM_CPT1CR_EXEV3CPT_Msk                /*!< External event 3 capture */
#define HRTIM_CPT1CR_EXEV4CPT_Pos     (5)
#define HRTIM_CPT1CR_EXEV4CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV4CPT_Pos)     /*!< 0x00000020 */
#define HRTIM_CPT1CR_EXEV4CPT         HRTIM_CPT1CR_EXEV4CPT_Msk                /*!< External event 4 capture */
#define HRTIM_CPT1CR_EXEV5CPT_Pos     (6)
#define HRTIM_CPT1CR_EXEV5CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV5CPT_Pos)     /*!< 0x00000040 */
#define HRTIM_CPT1CR_EXEV5CPT         HRTIM_CPT1CR_EXEV5CPT_Msk                /*!< External event 5 capture */
#define HRTIM_CPT1CR_EXEV6CPT_Pos     (7)
#define HRTIM_CPT1CR_EXEV6CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV6CPT_Pos)     /*!< 0x00000080 */
#define HRTIM_CPT1CR_EXEV6CPT         HRTIM_CPT1CR_EXEV6CPT_Msk                /*!< External event 6 capture */
#define HRTIM_CPT1CR_EXEV7CPT_Pos     (8)
#define HRTIM_CPT1CR_EXEV7CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV7CPT_Pos)     /*!< 0x00000100 */
#define HRTIM_CPT1CR_EXEV7CPT         HRTIM_CPT1CR_EXEV7CPT_Msk                /*!< External event 7 capture */
#define HRTIM_CPT1CR_EXEV8CPT_Pos     (9)
#define HRTIM_CPT1CR_EXEV8CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV8CPT_Pos)     /*!< 0x00000200 */
#define HRTIM_CPT1CR_EXEV8CPT         HRTIM_CPT1CR_EXEV8CPT_Msk                /*!< External event 8 capture */
#define HRTIM_CPT1CR_EXEV9CPT_Pos     (10)
#define HRTIM_CPT1CR_EXEV9CPT_Msk     (0x1 << HRTIM_CPT1CR_EXEV9CPT_Pos)     /*!< 0x00000400 */
#define HRTIM_CPT1CR_EXEV9CPT         HRTIM_CPT1CR_EXEV9CPT_Msk                /*!< External event 9 capture */
#define HRTIM_CPT1CR_EXEV10CPT_Pos    (11)
#define HRTIM_CPT1CR_EXEV10CPT_Msk    (0x1 << HRTIM_CPT1CR_EXEV10CPT_Pos)    /*!< 0x00000800 */
#define HRTIM_CPT1CR_EXEV10CPT        HRTIM_CPT1CR_EXEV10CPT_Msk               /*!< External event 10 capture */

#define HRTIM_CPT1CR_TF1SET_Pos       (0)
#define HRTIM_CPT1CR_TF1SET_Msk       (0x1 << HRTIM_CPT1CR_TF1SET_Pos)       /*!< 0x00000001 */
#define HRTIM_CPT1CR_TF1SET           HRTIM_CPT1CR_TF1SET_Msk                  /*!< Timer F output 1 set */
#define HRTIM_CPT1CR_TF1RST_Pos       (1)
#define HRTIM_CPT1CR_TF1RST_Msk       (0x1 << HRTIM_CPT1CR_TF1RST_Pos)       /*!< 0x00000002 */
#define HRTIM_CPT1CR_TF1RST           HRTIM_CPT1CR_TF1RST_Msk                  /*!< Timer F output 1 reset */
#define HRTIM_CPT1CR_TIMFCMP1_Pos     (2)
#define HRTIM_CPT1CR_TIMFCMP1_Msk     (0x1 << HRTIM_CPT1CR_TIMFCMP1_Pos)     /*!< 0x00000004 */
#define HRTIM_CPT1CR_TIMFCMP1         HRTIM_CPT1CR_TIMFCMP1_Msk                /*!< Timer F compare 1 */
#define HRTIM_CPT1CR_TIMFCMP2_Pos     (3)
#define HRTIM_CPT1CR_TIMFCMP2_Msk     (0x1 << HRTIM_CPT1CR_TIMFCMP2_Pos)     /*!< 0x00000008 */
#define HRTIM_CPT1CR_TIMFCMP2         HRTIM_CPT1CR_TIMFCMP2_Msk                /*!< Timer F compare 2 */

