pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define HRTIM_CPT2CR_TC1SET_Pos       (20)
#define HRTIM_CPT2CR_TC1SET_Msk       (0x1 << HRTIM_CPT2CR_TC1SET_Pos)       /*!< 0x00100000 */
#define HRTIM_CPT2CR_TC1SET           HRTIM_CPT2CR_TC1SET_Msk                  /*!< Timer C output 1 set */
#define HRTIM_CPT2CR_TC1RST_Pos       (21)
#define HRTIM_CPT2CR_TC1RST_Msk       (0x1 << HRTIM_CPT2CR_TC1RST_Pos)       /*!< 0x00200000 */
#define HRTIM_CPT2CR_TC1RST           HRTIM_CPT2CR_TC1RST_Msk                  /*!< Timer C output 1 reset */
#define HRTIM_CPT2CR_TIMCCMP1_Pos     (22)
#define HRTIM_CPT2CR_TIMCCMP1_Msk     (0x1 << HRTIM_CPT2CR_TIMCCMP1_Pos)     /*!< 0x00400000 */
#define HRTIM_CPT2CR_TIMCCMP1         HRTIM_CPT2CR_TIMCCMP1_Msk                /*!< Timer C compare 1 */
#define HRTIM_CPT2CR_TIMCCMP2_Pos     (23)
#define HRTIM_CPT2CR_TIMCCMP2_Msk     (0x1 << HRTIM_CPT2CR_TIMCCMP2_Pos)     /*!< 0x00800000 */
#define HRTIM_CPT2CR_TIMCCMP2         HRTIM_CPT2CR_TIMCCMP2_Msk                /*!< Timer C compare 2 */

#define HRTIM_CPT2CR_TD1SET_Pos       (24)
#define HRTIM_CPT2CR_TD1SET_Msk       (0x1 << HRTIM_CPT2CR_TD1SET_Pos)       /*!< 0x01000000 */
#define HRTIM_CPT2CR_TD1SET           HRTIM_CPT2CR_TD1SET_Msk                  /*!< Timer D output 1 set */
#define HRTIM_CPT2CR_TD1RST_Pos       (25)
#define HRTIM_CPT2CR_TD1RST_Msk       (0x1 << HRTIM_CPT2CR_TD1RST_Pos)       /*!< 0x02000000 */
#define HRTIM_CPT2CR_TD1RST           HRTIM_CPT2CR_TD1RST_Msk                  /*!< Timer D output 1 reset */
#define HRTIM_CPT2CR_TIMDCMP1_Pos     (26)
#define HRTIM_CPT2CR_TIMDCMP1_Msk     (0x1 << HRTIM_CPT2CR_TIMDCMP1_Pos)     /*!< 0x04000000 */
#define HRTIM_CPT2CR_TIMDCMP1         HRTIM_CPT2CR_TIMDCMP1_Msk                /*!< Timer D compare 1 */
#define HRTIM_CPT2CR_TIMDCMP2_Pos     (27)
#define HRTIM_CPT2CR_TIMDCMP2_Msk     (0x1 << HRTIM_CPT2CR_TIMDCMP2_Pos)     /*!< 0x08000000 */
#define HRTIM_CPT2CR_TIMDCMP2         HRTIM_CPT2CR_TIMDCMP2_Msk                /*!< Timer D compare 2 */

#define HRTIM_CPT2CR_TE1SET_Pos       (28)
#define HRTIM_CPT2CR_TE1SET_Msk       (0x1 << HRTIM_CPT2CR_TE1SET_Pos)       /*!< 0x10000000 */
#define HRTIM_CPT2CR_TE1SET           HRTIM_CPT2CR_TE1SET_Msk                  /*!< Timer E output 1 set */
#define HRTIM_CPT2CR_TE1RST_Pos       (29)
#define HRTIM_CPT2CR_TE1RST_Msk       (0x1 << HRTIM_CPT2CR_TE1RST_Pos)       /*!< 0x20000000 */
#define HRTIM_CPT2CR_TE1RST           HRTIM_CPT2CR_TE1RST_Msk                  /*!< Timer E output 1 reset */
#define HRTIM_CPT2CR_TIMECMP1_Pos     (30)
#define HRTIM_CPT2CR_TIMECMP1_Msk     (0x1 << HRTIM_CPT2CR_TIMECMP1_Pos)     /*!< 0x40000000 */
#define HRTIM_CPT2CR_TIMECMP1         HRTIM_CPT2CR_TIMECMP1_Msk                /*!< Timer E compare 1 */
#define HRTIM_CPT2CR_TIMECMP2_Pos     (31)
#define HRTIM_CPT2CR_TIMECMP2_Msk     (0x1 << HRTIM_CPT2CR_TIMECMP2_Pos)     /*!< 0x80000000 */
#define HRTIM_CPT2CR_TIMECMP2         HRTIM_CPT2CR_TIMECMP2_Msk                /*!< Timer E compare 2 */

/**** Bit definition for Slave Timer Output register **************************/
#define HRTIM_OUTR_POL1_Pos           (1)
#define HRTIM_OUTR_POL1_Msk           (0x1 << HRTIM_OUTR_POL1_Pos)           /*!< 0x00000002 */
#define HRTIM_OUTR_POL1               HRTIM_OUTR_POL1_Msk                      /*!< Slave output 1 polarity */
#define HRTIM_OUTR_IDLM1_Pos          (2)
#define HRTIM_OUTR_IDLM1_Msk          (0x1 << HRTIM_OUTR_IDLM1_Pos)          /*!< 0x00000004 */
#define HRTIM_OUTR_IDLM1              HRTIM_OUTR_IDLM1_Msk                     /*!< Slave output 1 idle mode */
#define HRTIM_OUTR_IDLES1_Pos         (3)
#define HRTIM_OUTR_IDLES1_Msk         (0x1 << HRTIM_OUTR_IDLES1_Pos)         /*!< 0x00000008 */
#define HRTIM_OUTR_IDLES1             HRTIM_OUTR_IDLES1_Msk                    /*!< Slave output 1 idle state */
#define HRTIM_OUTR_FAULT1_Pos         (4)
#define HRTIM_OUTR_FAULT1_Msk         (0x3 << HRTIM_OUTR_FAULT1_Pos)         /*!< 0x00000030 */
#define HRTIM_OUTR_FAULT1             HRTIM_OUTR_FAULT1_Msk                    /*!< Slave output 1 fault state */
#define HRTIM_OUTR_FAULT1_0           (0x1 << HRTIM_OUTR_FAULT1_Pos)         /*!< 0x00000010 */
#define HRTIM_OUTR_FAULT1_1           (0x2 << HRTIM_OUTR_FAULT1_Pos)         /*!< 0x00000020 */
#define HRTIM_OUTR_CHP1_Pos           (6)
#define HRTIM_OUTR_CHP1_Msk           (0x1 << HRTIM_OUTR_CHP1_Pos)           /*!< 0x00000040 */
#define HRTIM_OUTR_CHP1               HRTIM_OUTR_CHP1_Msk                      /*!< Slave output 1 chopper enable */
#define HRTIM_OUTR_DIDL1_Pos          (7)
#define HRTIM_OUTR_DIDL1_Msk          (0x1 << HRTIM_OUTR_DIDL1_Pos)          /*!< 0x00000080 */
#define HRTIM_OUTR_DIDL1              HRTIM_OUTR_DIDL1_Msk                     /*!< Slave output 1 dead time idle */

#define HRTIM_OUTR_DTEN_Pos           (8)
#define HRTIM_OUTR_DTEN_Msk           (0x1 << HRTIM_OUTR_DTEN_Pos)           /*!< 0x00000100 */
#define HRTIM_OUTR_DTEN               HRTIM_OUTR_DTEN_Msk                      /*!< Slave output deadtime enable */
#define HRTIM_OUTR_DLYPRTEN_Pos       (9)
#define HRTIM_OUTR_DLYPRTEN_Msk       (0x1 << HRTIM_OUTR_DLYPRTEN_Pos)       /*!< 0x00000200 */
#define HRTIM_OUTR_DLYPRTEN           HRTIM_OUTR_DLYPRTEN_Msk                  /*!< Slave output delay protection enable */
#define HRTIM_OUTR_DLYPRT_Pos         (10)
#define HRTIM_OUTR_DLYPRT_Msk         (0x7 << HRTIM_OUTR_DLYPRT_Pos)         /*!< 0x00001C00 */
#define HRTIM_OUTR_DLYPRT             HRTIM_OUTR_DLYPRT_Msk                    /*!< Slave output delay protection */
#define HRTIM_OUTR_DLYPRT_0           (0x1 << HRTIM_OUTR_DLYPRT_Pos)         /*!< 0x00000400 */
#define HRTIM_OUTR_DLYPRT_1           (0x2 << HRTIM_OUTR_DLYPRT_Pos)         /*!< 0x00000800 */
#define HRTIM_OUTR_DLYPRT_2           (0x4 << HRTIM_OUTR_DLYPRT_Pos)         /*!< 0x00001000 */
#define HRTIM_OUTR_BIAR_Pos           (14)
#define HRTIM_OUTR_BIAR_Msk           (0x1 << HRTIM_OUTR_BIAR_Pos)           /*!< 0x00004000 */
#define HRTIM_OUTR_BIAR               HRTIM_OUTR_BIAR_Msk                      /*!< Slave output Balanced Idle Automatic resume */
#define HRTIM_OUTR_POL2_Pos           (17)
#define HRTIM_OUTR_POL2_Msk           (0x1 << HRTIM_OUTR_POL2_Pos)           /*!< 0x00020000 */
#define HRTIM_OUTR_POL2               HRTIM_OUTR_POL2_Msk                      /*!< Slave output 2 polarity */
#define HRTIM_OUTR_IDLM2_Pos          (18)
#define HRTIM_OUTR_IDLM2_Msk          (0x1 << HRTIM_OUTR_IDLM2_Pos)          /*!< 0x00040000 */
#define HRTIM_OUTR_IDLM2              HRTIM_OUTR_IDLM2_Msk                     /*!< Slave output 2 idle mode */
#define HRTIM_OUTR_IDLES2_Pos         (19)
#define HRTIM_OUTR_IDLES2_Msk         (0x1 << HRTIM_OUTR_IDLES2_Pos)         /*!< 0x00080000 */
#define HRTIM_OUTR_IDLES2             HRTIM_OUTR_IDLES2_Msk                    /*!< Slave output 2 idle state */
#define HRTIM_OUTR_FAULT2_Pos         (20)
#define HRTIM_OUTR_FAULT2_Msk         (0x3 << HRTIM_OUTR_FAULT2_Pos)         /*!< 0x00300000 */
#define HRTIM_OUTR_FAULT2             HRTIM_OUTR_FAULT2_Msk                    /*!< Slave output 2 fault state */
#define HRTIM_OUTR_FAULT2_0           (0x1 << HRTIM_OUTR_FAULT2_Pos)         /*!< 0x00100000 */
#define HRTIM_OUTR_FAULT2_1           (0x2 << HRTIM_OUTR_FAULT2_Pos)         /*!< 0x00200000 */
#define HRTIM_OUTR_CHP2_Pos           (22)
#define HRTIM_OUTR_CHP2_Msk           (0x1 << HRTIM_OUTR_CHP2_Pos)           /*!< 0x00400000 */
#define HRTIM_OUTR_CHP2               HRTIM_OUTR_CHP2_Msk                      /*!< Slave output 2 chopper enable */
#define HRTIM_OUTR_DIDL2_Pos          (23)
#define HRTIM_OUTR_DIDL2_Msk          (0x1 << HRTIM_OUTR_DIDL2_Pos)          /*!< 0x00800000 */
#define HRTIM_OUTR_DIDL2              HRTIM_OUTR_DIDL2_Msk                     /*!< Slave output 2 dead time idle */

/**** Bit definition for Timerx Fault register ***************************/
#define HRTIM_FLTR_FLT1EN_Pos         (0)
#define HRTIM_FLTR_FLT1EN_Msk         (0x1 << HRTIM_FLTR_FLT1EN_Pos)         /*!< 0x00000001 */
#define HRTIM_FLTR_FLT1EN             HRTIM_FLTR_FLT1EN_Msk                    /*!< Fault 1 enable */
#define HRTIM_FLTR_FLT2EN_Pos         (1)
#define HRTIM_FLTR_FLT2EN_Msk         (0x1 << HRTIM_FLTR_FLT2EN_Pos)         /*!< 0x00000002 */
#define HRTIM_FLTR_FLT2EN             HRTIM_FLTR_FLT2EN_Msk                    /*!< Fault 2 enable */
#define HRTIM_FLTR_FLT3EN_Pos         (2)
#define HRTIM_FLTR_FLT3EN_Msk         (0x1 << HRTIM_FLTR_FLT3EN_Pos)         /*!< 0x00000004 */
#define HRTIM_FLTR_FLT3EN             HRTIM_FLTR_FLT3EN_Msk                    /*!< Fault 3 enable */
#define HRTIM_FLTR_FLT4EN_Pos         (3)
#define HRTIM_FLTR_FLT4EN_Msk         (0x1 << HRTIM_FLTR_FLT4EN_Pos)         /*!< 0x00000008 */
#define HRTIM_FLTR_FLT4EN             HRTIM_FLTR_FLT4EN_Msk                    /*!< Fault 4 enable */
#define HRTIM_FLTR_FLT5EN_Pos         (4)
#define HRTIM_FLTR_FLT5EN_Msk         (0x1 << HRTIM_FLTR_FLT5EN_Pos)         /*!< 0x00000010 */
#define HRTIM_FLTR_FLT5EN             HRTIM_FLTR_FLT5EN_Msk                    /*!< Fault 5 enable */
#define HRTIM_FLTR_FLT6EN_Pos         (5)
#define HRTIM_FLTR_FLT6EN_Msk         (0x1 << HRTIM_FLTR_FLT6EN_Pos)         /*!< 0x00000020 */
#define HRTIM_FLTR_FLT6EN             HRTIM_FLTR_FLT6EN_Msk                    /*!< Fault 6 enable */
#define HRTIM_FLTR_FLTLCK_Pos         (31)
#define HRTIM_FLTR_FLTLCK_Msk         (0x1 << HRTIM_FLTR_FLTLCK_Pos)         /*!< 0x80000000 */
#define HRTIM_FLTR_FLTLCK             HRTIM_FLTR_FLTLCK_Msk                    /*!< Fault sources lock */

/**** Bit definition for HRTIM Timerx control register 2 ****************/
#define HRTIM_TIMCR2_DCDE_Pos           (0)
#define HRTIM_TIMCR2_DCDE_Msk           (0x1 << HRTIM_TIMCR2_DCDE_Pos)           /*!< 0x00000001 */
#define HRTIM_TIMCR2_DCDE               HRTIM_TIMCR2_DCDE_Msk                      /*!< Dual Channel DAC trigger enable */
#define HRTIM_TIMCR2_DCDS_Pos           (1)
#define HRTIM_TIMCR2_DCDS_Msk           (0x1 << HRTIM_TIMCR2_DCDS_Pos)           /*!< 0x00000002 */
#define HRTIM_TIMCR2_DCDS               HRTIM_TIMCR2_DCDS_Msk                      /*!< Dual Channel DAC step trigger */
#define HRTIM_TIMCR2_DCDR_Pos           (2)
#define HRTIM_TIMCR2_DCDR_Msk           (0x1 << HRTIM_TIMCR2_DCDR_Pos)           /*!< 0x00000004 */
#define HRTIM_TIMCR2_DCDR               HRTIM_TIMCR2_DCDR_Msk                      /*!< Dual Channel DAC reset trigger */
#define HRTIM_TIMCR2_UDM_Pos           (4)
#define HRTIM_TIMCR2_UDM_Msk           (0x1 << HRTIM_TIMCR2_UDM_Pos)             /*!< 0x00000010 */
#define HRTIM_TIMCR2_UDM               HRTIM_TIMCR2_UDM_Msk                        /*!< Up-Down Mode*/
#define HRTIM_TIMCR2_ROM_Pos           (6)
#define HRTIM_TIMCR2_ROM_Msk           (0x3 << HRTIM_TIMCR2_ROM_Pos)             /*!< 0x000000C0 */
#define HRTIM_TIMCR2_ROM               HRTIM_TIMCR2_ROM_Msk                        /*!< Roll-over Mode */
#define HRTIM_TIMCR2_ROM_0             (0x1 << HRTIM_TIMCR2_ROM_Pos)             /*!< 0x00000040 */
#define HRTIM_TIMCR2_ROM_1             (0x2 << HRTIM_TIMCR2_ROM_Pos)             /*!< 0x00000080 */
#define HRTIM_TIMCR2_OUTROM_Pos        (8)
#define HRTIM_TIMCR2_OUTROM_Msk        (0x3 << HRTIM_TIMCR2_OUTROM_Pos)          /*!< 0x00000300 */
#define HRTIM_TIMCR2_OUTROM            HRTIM_TIMCR2_OUTROM_Msk                     /*!< Output Roll-Over Mode */
#define HRTIM_TIMCR2_OUTROM_0          (0x1 << HRTIM_TIMCR2_OUTROM_Pos)          /*!< 0x00000100 */
#define HRTIM_TIMCR2_OUTROM_1          (0x2 << HRTIM_TIMCR2_OUTROM_Pos)          /*!< 0x00000200 */
#define HRTIM_TIMCR2_ADROM_Pos         (10)
#define HRTIM_TIMCR2_ADROM_Msk         (0x3 << HRTIM_TIMCR2_ADROM_Pos)           /*!< 0x00000C00 */
#define HRTIM_TIMCR2_ADROM             HRTIM_TIMCR2_ADROM_Msk                      /*!< ADC Roll-Over Mode */
#define HRTIM_TIMCR2_ADROM_0           (0x1 << HRTIM_TIMCR2_ADROM_Pos)           /*!< 0x00000400 */
#define HRTIM_TIMCR2_ADROM_1           (0x2 << HRTIM_TIMCR2_ADROM_Pos)           /*!< 0x00000800 */
#define HRTIM_TIMCR2_BMROM_Pos         (12)
#define HRTIM_TIMCR2_BMROM_Msk         (0x3 << HRTIM_TIMCR2_BMROM_Pos)           /*!< 0x00003000 */
#define HRTIM_TIMCR2_BMROM             HRTIM_TIMCR2_BMROM_Msk                      /*!< Burst Mode Rollover Mode */
#define HRTIM_TIMCR2_BMROM_0           (0x1 << HRTIM_TIMCR2_BMROM_Pos)           /*!< 0x00001000 */
#define HRTIM_TIMCR2_BMROM_1           (0x2 << HRTIM_TIMCR2_BMROM_Pos)           /*!< 0x00002000 */
#define HRTIM_TIMCR2_FEROM_Pos         (14)
#define HRTIM_TIMCR2_FEROM_Msk         (0x3 << HRTIM_TIMCR2_FEROM_Pos)           /*!< 0x0000C000 */
#define HRTIM_TIMCR2_FEROM             HRTIM_TIMCR2_FEROM_Msk                      /*!< Fault and Event Rollover Mode */
#define HRTIM_TIMCR2_FEROM_0           (0x1 << HRTIM_TIMCR2_FEROM_Pos)           /*!< 0x00004000 */
#define HRTIM_TIMCR2_FEROM_1           (0x2 << HRTIM_TIMCR2_FEROM_Pos)           /*!< 0x00008000 */
#define HRTIM_TIMCR2_GTCMP1_Pos        (16)
#define HRTIM_TIMCR2_GTCMP1_Msk        (0x1 << HRTIM_TIMCR2_GTCMP1_Pos)          /*!< 0x00010000 */
#define HRTIM_TIMCR2_GTCMP1            HRTIM_TIMCR2_GTCMP1_Msk                     /*!< Greater than Compare 1 PWM mode */
#define HRTIM_TIMCR2_GTCMP3_Pos        (17)
#define HRTIM_TIMCR2_GTCMP3_Msk        (0x1 << HRTIM_TIMCR2_GTCMP3_Pos)          /*!< 0x00020000 */
#define HRTIM_TIMCR2_GTCMP3            HRTIM_TIMCR2_GTCMP3_Msk                     /*!< Greater than Compare 3 PWM mode */
#define HRTIM_TIMCR2_TRGHLF_Pos        (20)
#define HRTIM_TIMCR2_TRGHLF_Msk        (0x1 << HRTIM_TIMCR2_TRGHLF_Pos)          /*!< 0x00100000 */
#define HRTIM_TIMCR2_TRGHLF            HRTIM_TIMCR2_TRGHLF_Msk                     /*!< Triggered-Half mode */

/**** Bit definition for Slave external event filtering  register 3 ***********/
#define HRTIM_EEFR3_EEVACE_Pos        (0)
#define HRTIM_EEFR3_EEVACE_Msk        (0x1 << HRTIM_EEFR3_EEVACE_Pos)       /*!< 0x00000001 */
#define HRTIM_EEFR3_EEVACE            HRTIM_EEFR3_EEVACE_Msk                  /*!< External Event A Counter Enable */
#define HRTIM_EEFR3_EEVACRES_Pos      (1)
#define HRTIM_EEFR3_EEVACRES_Msk      (0x1 << HRTIM_EEFR3_EEVACRES_Pos)     /*!< 0x00000002 */
#define HRTIM_EEFR3_EEVACRES          HRTIM_EEFR3_EEVACRES_Msk                /*!< External Event A Counter Reset */
#define HRTIM_EEFR3_EEVARSTM_Pos      (2)
#define HRTIM_EEFR3_EEVARSTM_Msk      (0x1 << HRTIM_EEFR3_EEVARSTM_Pos)     /*!< 0x00000004 */
#define HRTIM_EEFR3_EEVARSTM          HRTIM_EEFR3_EEVARSTM_Msk                /*!< External Event A Counter Reset Mode */
#define HRTIM_EEFR3_EEVASEL_Pos       (4)
#define HRTIM_EEFR3_EEVASEL_Msk       (0xF << HRTIM_EEFR3_EEVASEL_Pos)      /*!< 0x000000F0 */
#define HRTIM_EEFR3_EEVASEL           HRTIM_EEFR3_EEVASEL_Msk                 /*!< External Event A Selection */
#define HRTIM_EEFR3_EEVASEL_0         (0x1 << HRTIM_EEFR3_EEVASEL_Pos)      /*!< 0x00000010 */
#define HRTIM_EEFR3_EEVASEL_1         (0x2 << HRTIM_EEFR3_EEVASEL_Pos)      /*!< 0x00000020 */
#define HRTIM_EEFR3_EEVASEL_2         (0x4 << HRTIM_EEFR3_EEVASEL_Pos)      /*!< 0x00000040 */
#define HRTIM_EEFR3_EEVASEL_3         (0x8 << HRTIM_EEFR3_EEVASEL_Pos)      /*!< 0x00000080 */
#define HRTIM_EEFR3_EEVACNT_Pos       (8)
#define HRTIM_EEFR3_EEVACNT_Msk       (0x3F << HRTIM_EEFR3_EEVACNT_Pos)     /*!< 0x00003F00 */
#define HRTIM_EEFR3_EEVACNT           HRTIM_EEFR3_EEVACNT_Msk                 /*!< External Event A Selection */
#define HRTIM_EEFR3_EEVACNT_0         (0x1 << HRTIM_EEFR3_EEVACNT_Pos)      /*!< 0x00000100 */
#define HRTIM_EEFR3_EEVACNT_1         (0x2 << HRTIM_EEFR3_EEVACNT_Pos)      /*!< 0x00000200 */
#define HRTIM_EEFR3_EEVACNT_2         (0x4 << HRTIM_EEFR3_EEVACNT_Pos)      /*!< 0x00000400 */
#define HRTIM_EEFR3_EEVACNT_3         (0x8 << HRTIM_EEFR3_EEVACNT_Pos)      /*!< 0x00000800 */
#define HRTIM_EEFR3_EEVACNT_4         (0x10 << HRTIM_EEFR3_EEVACNT_Pos)     /*!< 0x00001000 */
#define HRTIM_EEFR3_EEVACNT_5         (0x20 << HRTIM_EEFR3_EEVACNT_Pos)     /*!< 0x00002000 */
#define HRTIM_EEFR3_EEVBCE_Pos        (16)
#define HRTIM_EEFR3_EEVBCE_Msk        (0x1 << HRTIM_EEFR3_EEVBCE_Pos)       /*!< 0x00010000 */
#define HRTIM_EEFR3_EEVBCE            HRTIM_EEFR3_EEVBCE_Msk                  /*!< External Event B Counter Enable */
#define HRTIM_EEFR3_EEVBCRES_Pos      (17)
#define HRTIM_EEFR3_EEVBCRES_Msk      (0x1 << HRTIM_EEFR3_EEVBCRES_Pos)     /*!< 0x00020000 */
#define HRTIM_EEFR3_EEVBCRES          HRTIM_EEFR3_EEVBCRES_Msk                /*!< External Event B Counter Reset */
#define HRTIM_EEFR3_EEVBRSTM_Pos      (18)
#define HRTIM_EEFR3_EEVBRSTM_Msk      (0x1 << HRTIM_EEFR3_EEVBRSTM_Pos)     /*!< 0x00040000 */
#define HRTIM_EEFR3_EEVBRSTM          HRTIM_EEFR3_EEVBRSTM_Msk                /*!< External Event B Counter Reset Mode */
#define HRTIM_EEFR3_EEVBSEL_Pos       (20)
#define HRTIM_EEFR3_EEVBSEL_Msk       (0xF << HRTIM_EEFR3_EEVBSEL_Pos)      /*!< 0x00F00000 */
#define HRTIM_EEFR3_EEVBSEL           HRTIM_EEFR3_EEVBSEL_Msk                 /*!< External Event B Selection */
#define HRTIM_EEFR3_EEVBSEL_0         (0x1 << HRTIM_EEFR3_EEVBSEL_Pos)      /*!< 0x00100000 */
#define HRTIM_EEFR3_EEVBSEL_1         (0x2 << HRTIM_EEFR3_EEVBSEL_Pos)      /*!< 0x00200000 */
#define HRTIM_EEFR3_EEVBSEL_2         (0x4 << HRTIM_EEFR3_EEVBSEL_Pos)      /*!< 0x00400000 */
#define HRTIM_EEFR3_EEVBSEL_3         (0x8 << HRTIM_EEFR3_EEVBSEL_Pos)      /*!< 0x00800000 */
#define HRTIM_EEFR3_EEVBCNT_Pos       (24)
#define HRTIM_EEFR3_EEVBCNT_Msk       (0x3F << HRTIM_EEFR3_EEVBCNT_Pos)     /*!< 0x3F000000 */
#define HRTIM_EEFR3_EEVBCNT           HRTIM_EEFR3_EEVBCNT_Msk                 /*!< External Event B Counter */
#define HRTIM_EEFR3_EEVBCNT_0         (0x1 << HRTIM_EEFR3_EEVBCNT_Pos)      /*!< 0x01000000 */
#define HRTIM_EEFR3_EEVBCNT_1         (0x2 << HRTIM_EEFR3_EEVBCNT_Pos)      /*!< 0x02000000 */
#define HRTIM_EEFR3_EEVBCNT_2         (0x4 << HRTIM_EEFR3_EEVBCNT_Pos)      /*!< 0x04000000 */
#define HRTIM_EEFR3_EEVBCNT_3         (0x8 << HRTIM_EEFR3_EEVBCNT_Pos)      /*!< 0x08000000 */
#define HRTIM_EEFR3_EEVBCNT_4         (0x10 << HRTIM_EEFR3_EEVACNT_Pos)     /*!< 0x10000000 */
#define HRTIM_EEFR3_EEVBCNT_5         (0x20 << HRTIM_EEFR3_EEVACNT_Pos)     /*!< 0x20000000 */

/**** Bit definition for Common HRTIM Timer control register 1 ****************/
#define HRTIM_CR1_MUDIS_Pos           (0)
#define HRTIM_CR1_MUDIS_Msk           (0x1 << HRTIM_CR1_MUDIS_Pos)          /*!< 0x00000001 */
#define HRTIM_CR1_MUDIS               HRTIM_CR1_MUDIS_Msk                     /*!< Master update disable*/
#define HRTIM_CR1_TAUDIS_Pos          (1)
#define HRTIM_CR1_TAUDIS_Msk          (0x1 << HRTIM_CR1_TAUDIS_Pos)         /*!< 0x00000002 */
#define HRTIM_CR1_TAUDIS              HRTIM_CR1_TAUDIS_Msk                    /*!< Timer A update disable*/
#define HRTIM_CR1_TBUDIS_Pos          (2)
#define HRTIM_CR1_TBUDIS_Msk          (0x1 << HRTIM_CR1_TBUDIS_Pos)         /*!< 0x00000004 */
#define HRTIM_CR1_TBUDIS              HRTIM_CR1_TBUDIS_Msk                    /*!< Timer B update disable*/
#define HRTIM_CR1_TCUDIS_Pos          (3)
#define HRTIM_CR1_TCUDIS_Msk          (0x1 << HRTIM_CR1_TCUDIS_Pos)         /*!< 0x00000008 */
#define HRTIM_CR1_TCUDIS              HRTIM_CR1_TCUDIS_Msk                    /*!< Timer C update disable*/
#define HRTIM_CR1_TDUDIS_Pos          (4)
#define HRTIM_CR1_TDUDIS_Msk          (0x1 << HRTIM_CR1_TDUDIS_Pos)         /*!< 0x00000010 */
#define HRTIM_CR1_TDUDIS              HRTIM_CR1_TDUDIS_Msk                    /*!< Timer D update disable*/
#define HRTIM_CR1_TEUDIS_Pos          (5)
#define HRTIM_CR1_TEUDIS_Msk          (0x1 << HRTIM_CR1_TEUDIS_Pos)         /*!< 0x00000020 */
#define HRTIM_CR1_TEUDIS              HRTIM_CR1_TEUDIS_Msk                    /*!< Timer E update disable*/
#define HRTIM_CR1_TFUDIS_Pos          (6)
#define HRTIM_CR1_TFUDIS_Msk          (0x1 << HRTIM_CR1_TFUDIS_Pos)         /*!< 0x00000040 */
#define HRTIM_CR1_TFUDIS              HRTIM_CR1_TFUDIS_Msk                    /*!< Timer F update disable*/
#define HRTIM_CR1_ADC1USRC_Pos        (16)
#define HRTIM_CR1_ADC1USRC_Msk        (0x7 << HRTIM_CR1_ADC1USRC_Pos)       /*!< 0x00070000 */
#define HRTIM_CR1_ADC1USRC            HRTIM_CR1_ADC1USRC_Msk                  /*!< ADC Trigger 1 update source */
#define HRTIM_CR1_ADC1USRC_0          (0x1 << HRTIM_CR1_ADC1USRC_Pos)       /*!< 0x00010000 */
#define HRTIM_CR1_ADC1USRC_1          (0x2 << HRTIM_CR1_ADC1USRC_Pos)       /*!< 0x00020000 */
#define HRTIM_CR1_ADC1USRC_2          (0x4 << HRTIM_CR1_ADC1USRC_Pos)       /*!< 0x00040000 */
#define HRTIM_CR1_ADC2USRC_Pos        (19)
#define HRTIM_CR1_ADC2USRC_Msk        (0x7 << HRTIM_CR1_ADC2USRC_Pos)       /*!< 0x00380000 */
#define HRTIM_CR1_ADC2USRC            HRTIM_CR1_ADC2USRC_Msk                  /*!< ADC Trigger 2 update source */
#define HRTIM_CR1_ADC2USRC_0          (0x1 << HRTIM_CR1_ADC2USRC_Pos)       /*!< 0x00080000 */
#define HRTIM_CR1_ADC2USRC_1          (0x2 << HRTIM_CR1_ADC2USRC_Pos)       /*!< 0x00100000 */
#define HRTIM_CR1_ADC2USRC_2          (0x4 << HRTIM_CR1_ADC2USRC_Pos)       /*!< 0x00200000 */
#define HRTIM_CR1_ADC3USRC_Pos        (22)
#define HRTIM_CR1_ADC3USRC_Msk        (0x7 << HRTIM_CR1_ADC3USRC_Pos)       /*!< 0x01C00000 */
#define HRTIM_CR1_ADC3USRC            HRTIM_CR1_ADC3USRC_Msk                  /*!< ADC Trigger 3 update source */
#define HRTIM_CR1_ADC3USRC_0          (0x1 << HRTIM_CR1_ADC3USRC_Pos)       /*!< 0x00400000 */
#define HRTIM_CR1_ADC3USRC_1          (0x2 << HRTIM_CR1_ADC3USRC_Pos)       /*!< 0x00800000 */
#define HRTIM_CR1_ADC3USRC_2          (0x4 << HRTIM_CR1_ADC3USRC_Pos)       /*!< 0x01000000 */
#define HRTIM_CR1_ADC4USRC_Pos        (25)
#define HRTIM_CR1_ADC4USRC_Msk        (0x7 << HRTIM_CR1_ADC4USRC_Pos)       /*!< 0x0E000000 */
#define HRTIM_CR1_ADC4USRC            HRTIM_CR1_ADC4USRC_Msk                  /*!< ADC Trigger 4 update source */
#define HRTIM_CR1_ADC4USRC_0          (0x1 << HRTIM_CR1_ADC4USRC_Pos)       /*!< 0x02000000 */
#define HRTIM_CR1_ADC4USRC_1          (0x2 << HRTIM_CR1_ADC4USRC_Pos)       /*!< 0x04000000 */
#define HRTIM_CR1_ADC4USRC_2          (0x0 << HRTIM_CR1_ADC4USRC_Pos)       /*!< 0x0800000 */

