pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define HRTIM_EECR1_EE2SRC_Pos        (6)
#define HRTIM_EECR1_EE2SRC_Msk        (0x3 << HRTIM_EECR1_EE2SRC_Pos)        /*!< 0x000000C0 */
#define HRTIM_EECR1_EE2SRC            HRTIM_EECR1_EE2SRC_Msk                   /*!< External event 2 source */
#define HRTIM_EECR1_EE2SRC_0          (0x1 << HRTIM_EECR1_EE2SRC_Pos)        /*!< 0x00000040 */
#define HRTIM_EECR1_EE2SRC_1          (0x2 << HRTIM_EECR1_EE2SRC_Pos)        /*!< 0x00000080 */
#define HRTIM_EECR1_EE2POL_Pos        (8)
#define HRTIM_EECR1_EE2POL_Msk        (0x1 << HRTIM_EECR1_EE2POL_Pos)        /*!< 0x00000100 */
#define HRTIM_EECR1_EE2POL            HRTIM_EECR1_EE2POL_Msk                   /*!< External event 2 Polarity */
#define HRTIM_EECR1_EE2SNS_Pos        (9)
#define HRTIM_EECR1_EE2SNS_Msk        (0x3 << HRTIM_EECR1_EE2SNS_Pos)        /*!< 0x00000600 */
#define HRTIM_EECR1_EE2SNS            HRTIM_EECR1_EE2SNS_Msk                   /*!< External event 2 sensitivity */
#define HRTIM_EECR1_EE2SNS_0          (0x1 << HRTIM_EECR1_EE2SNS_Pos)        /*!< 0x00000200 */
#define HRTIM_EECR1_EE2SNS_1          (0x2 << HRTIM_EECR1_EE2SNS_Pos)        /*!< 0x00000400 */
#define HRTIM_EECR1_EE2FAST_Pos       (11)
#define HRTIM_EECR1_EE2FAST_Msk       (0x1 << HRTIM_EECR1_EE2FAST_Pos)       /*!< 0x00000800 */
#define HRTIM_EECR1_EE2FAST           HRTIM_EECR1_EE2FAST_Msk                  /*!< External event 2 Fast mode */

#define HRTIM_EECR1_EE3SRC_Pos        (12)
#define HRTIM_EECR1_EE3SRC_Msk        (0x3 << HRTIM_EECR1_EE3SRC_Pos)        /*!< 0x00003000 */
#define HRTIM_EECR1_EE3SRC            HRTIM_EECR1_EE3SRC_Msk                   /*!< External event 3 source */
#define HRTIM_EECR1_EE3SRC_0          (0x1 << HRTIM_EECR1_EE3SRC_Pos)        /*!< 0x00001000 */
#define HRTIM_EECR1_EE3SRC_1          (0x2 << HRTIM_EECR1_EE3SRC_Pos)        /*!< 0x00002000 */
#define HRTIM_EECR1_EE3POL_Pos        (14)
#define HRTIM_EECR1_EE3POL_Msk        (0x1 << HRTIM_EECR1_EE3POL_Pos)        /*!< 0x00004000 */
#define HRTIM_EECR1_EE3POL            HRTIM_EECR1_EE3POL_Msk                   /*!< External event 3 Polarity */
#define HRTIM_EECR1_EE3SNS_Pos        (15)
#define HRTIM_EECR1_EE3SNS_Msk        (0x3 << HRTIM_EECR1_EE3SNS_Pos)        /*!< 0x00018000 */
#define HRTIM_EECR1_EE3SNS            HRTIM_EECR1_EE3SNS_Msk                   /*!< External event 3 sensitivity */
#define HRTIM_EECR1_EE3SNS_0          (0x1 << HRTIM_EECR1_EE3SNS_Pos)        /*!< 0x00008000 */
#define HRTIM_EECR1_EE3SNS_1          (0x2 << HRTIM_EECR1_EE3SNS_Pos)        /*!< 0x00010000 */
#define HRTIM_EECR1_EE3FAST_Pos       (17)
#define HRTIM_EECR1_EE3FAST_Msk       (0x1 << HRTIM_EECR1_EE3FAST_Pos)       /*!< 0x00020000 */
#define HRTIM_EECR1_EE3FAST           HRTIM_EECR1_EE3FAST_Msk                  /*!< External event 3 Fast mode */

#define HRTIM_EECR1_EE4SRC_Pos        (18)
#define HRTIM_EECR1_EE4SRC_Msk        (0x3 << HRTIM_EECR1_EE4SRC_Pos)        /*!< 0x000C0000 */
#define HRTIM_EECR1_EE4SRC            HRTIM_EECR1_EE4SRC_Msk                   /*!< External event 4 source */
#define HRTIM_EECR1_EE4SRC_0          (0x1 << HRTIM_EECR1_EE4SRC_Pos)        /*!< 0x00040000 */
#define HRTIM_EECR1_EE4SRC_1          (0x2 << HRTIM_EECR1_EE4SRC_Pos)        /*!< 0x00080000 */
#define HRTIM_EECR1_EE4POL_Pos        (20)
#define HRTIM_EECR1_EE4POL_Msk        (0x1 << HRTIM_EECR1_EE4POL_Pos)        /*!< 0x00100000 */
#define HRTIM_EECR1_EE4POL            HRTIM_EECR1_EE4POL_Msk                   /*!< External event 4 Polarity */
#define HRTIM_EECR1_EE4SNS_Pos        (21)
#define HRTIM_EECR1_EE4SNS_Msk        (0x3 << HRTIM_EECR1_EE4SNS_Pos)        /*!< 0x00600000 */
#define HRTIM_EECR1_EE4SNS            HRTIM_EECR1_EE4SNS_Msk                   /*!< External event 4 sensitivity */
#define HRTIM_EECR1_EE4SNS_0          (0x1 << HRTIM_EECR1_EE4SNS_Pos)        /*!< 0x00200000 */
#define HRTIM_EECR1_EE4SNS_1          (0x2 << HRTIM_EECR1_EE4SNS_Pos)        /*!< 0x00400000 */
#define HRTIM_EECR1_EE4FAST_Pos       (23)
#define HRTIM_EECR1_EE4FAST_Msk       (0x1 << HRTIM_EECR1_EE4FAST_Pos)       /*!< 0x00800000 */
#define HRTIM_EECR1_EE4FAST           HRTIM_EECR1_EE4FAST_Msk                  /*!< External event 4 Fast mode */

#define HRTIM_EECR1_EE5SRC_Pos        (24)
#define HRTIM_EECR1_EE5SRC_Msk        (0x3 << HRTIM_EECR1_EE5SRC_Pos)        /*!< 0x03000000 */
#define HRTIM_EECR1_EE5SRC            HRTIM_EECR1_EE5SRC_Msk                   /*!< External event 5 source */
#define HRTIM_EECR1_EE5SRC_0          (0x1 << HRTIM_EECR1_EE5SRC_Pos)        /*!< 0x01000000 */
#define HRTIM_EECR1_EE5SRC_1          (0x2 << HRTIM_EECR1_EE5SRC_Pos)        /*!< 0x02000000 */
#define HRTIM_EECR1_EE5POL_Pos        (26)
#define HRTIM_EECR1_EE5POL_Msk        (0x1 << HRTIM_EECR1_EE5POL_Pos)        /*!< 0x04000000 */
#define HRTIM_EECR1_EE5POL            HRTIM_EECR1_EE5POL_Msk                   /*!< External event 5 Polarity */
#define HRTIM_EECR1_EE5SNS_Pos        (27)
#define HRTIM_EECR1_EE5SNS_Msk        (0x3 << HRTIM_EECR1_EE5SNS_Pos)        /*!< 0x18000000 */
#define HRTIM_EECR1_EE5SNS            HRTIM_EECR1_EE5SNS_Msk                   /*!< External event 5 sensitivity */
#define HRTIM_EECR1_EE5SNS_0          (0x1 << HRTIM_EECR1_EE5SNS_Pos)        /*!< 0x08000000 */
#define HRTIM_EECR1_EE5SNS_1          (0x2 << HRTIM_EECR1_EE5SNS_Pos)        /*!< 0x10000000 */
#define HRTIM_EECR1_EE5FAST_Pos       (29)
#define HRTIM_EECR1_EE5FAST_Msk       (0x1 << HRTIM_EECR1_EE5FAST_Pos)       /*!< 0x20000000 */
#define HRTIM_EECR1_EE5FAST           HRTIM_EECR1_EE5FAST_Msk                  /*!< External event 5 Fast mode */

/*******************  Bit definition for HRTIM_EECR2 register  ****************/
#define HRTIM_EECR2_EE6SRC_Pos        (0)
#define HRTIM_EECR2_EE6SRC_Msk        (0x3 << HRTIM_EECR2_EE6SRC_Pos)        /*!< 0x00000003 */
#define HRTIM_EECR2_EE6SRC            HRTIM_EECR2_EE6SRC_Msk                   /*!< External event 6 source */
#define HRTIM_EECR2_EE6SRC_0          (0x1 << HRTIM_EECR2_EE6SRC_Pos)        /*!< 0x00000001 */
#define HRTIM_EECR2_EE6SRC_1          (0x2 << HRTIM_EECR2_EE6SRC_Pos)        /*!< 0x00000002 */
#define HRTIM_EECR2_EE6POL_Pos        (2)
#define HRTIM_EECR2_EE6POL_Msk        (0x1 << HRTIM_EECR2_EE6POL_Pos)        /*!< 0x00000004 */
#define HRTIM_EECR2_EE6POL            HRTIM_EECR2_EE6POL_Msk                   /*!< External event 6 Polarity */
#define HRTIM_EECR2_EE6SNS_Pos        (3)
#define HRTIM_EECR2_EE6SNS_Msk        (0x3 << HRTIM_EECR2_EE6SNS_Pos)        /*!< 0x00000018 */
#define HRTIM_EECR2_EE6SNS            HRTIM_EECR2_EE6SNS_Msk                   /*!< External event 6 sensitivity */
#define HRTIM_EECR2_EE6SNS_0          (0x1 << HRTIM_EECR2_EE6SNS_Pos)        /*!< 0x00000008 */
#define HRTIM_EECR2_EE6SNS_1          (0x2 << HRTIM_EECR2_EE6SNS_Pos)        /*!< 0x00000010 */

#define HRTIM_EECR2_EE7SRC_Pos        (6)
#define HRTIM_EECR2_EE7SRC_Msk        (0x3 << HRTIM_EECR2_EE7SRC_Pos)        /*!< 0x000000C0 */
#define HRTIM_EECR2_EE7SRC            HRTIM_EECR2_EE7SRC_Msk                   /*!< External event 7 source */
#define HRTIM_EECR2_EE7SRC_0          (0x1 << HRTIM_EECR2_EE7SRC_Pos)        /*!< 0x00000040 */
#define HRTIM_EECR2_EE7SRC_1          (0x2 << HRTIM_EECR2_EE7SRC_Pos)        /*!< 0x00000080 */
#define HRTIM_EECR2_EE7POL_Pos        (8)
#define HRTIM_EECR2_EE7POL_Msk        (0x1 << HRTIM_EECR2_EE7POL_Pos)        /*!< 0x00000100 */
#define HRTIM_EECR2_EE7POL            HRTIM_EECR2_EE7POL_Msk                   /*!< External event 7 Polarity */
#define HRTIM_EECR2_EE7SNS_Pos        (9)
#define HRTIM_EECR2_EE7SNS_Msk        (0x3 << HRTIM_EECR2_EE7SNS_Pos)        /*!< 0x00000600 */
#define HRTIM_EECR2_EE7SNS            HRTIM_EECR2_EE7SNS_Msk                   /*!< External event 7 sensitivity */
#define HRTIM_EECR2_EE7SNS_0          (0x1 << HRTIM_EECR2_EE7SNS_Pos)        /*!< 0x00000200 */
#define HRTIM_EECR2_EE7SNS_1          (0x2 << HRTIM_EECR2_EE7SNS_Pos)        /*!< 0x00000400 */

#define HRTIM_EECR2_EE8SRC_Pos        (12)
#define HRTIM_EECR2_EE8SRC_Msk        (0x3 << HRTIM_EECR2_EE8SRC_Pos)        /*!< 0x00003000 */
#define HRTIM_EECR2_EE8SRC            HRTIM_EECR2_EE8SRC_Msk                   /*!< External event 8 source */
#define HRTIM_EECR2_EE8SRC_0          (0x1 << HRTIM_EECR2_EE8SRC_Pos)        /*!< 0x00001000 */
#define HRTIM_EECR2_EE8SRC_1          (0x2 << HRTIM_EECR2_EE8SRC_Pos)        /*!< 0x00002000 */
#define HRTIM_EECR2_EE8POL_Pos        (14)
#define HRTIM_EECR2_EE8POL_Msk        (0x1 << HRTIM_EECR2_EE8POL_Pos)        /*!< 0x00004000 */
#define HRTIM_EECR2_EE8POL            HRTIM_EECR2_EE8POL_Msk                   /*!< External event 8 Polarity */
#define HRTIM_EECR2_EE8SNS_Pos        (15)
#define HRTIM_EECR2_EE8SNS_Msk        (0x3 << HRTIM_EECR2_EE8SNS_Pos)        /*!< 0x00018000 */
#define HRTIM_EECR2_EE8SNS            HRTIM_EECR2_EE8SNS_Msk                   /*!< External event 8 sensitivity */
#define HRTIM_EECR2_EE8SNS_0          (0x1 << HRTIM_EECR2_EE8SNS_Pos)        /*!< 0x00008000 */
#define HRTIM_EECR2_EE8SNS_1          (0x2 << HRTIM_EECR2_EE8SNS_Pos)        /*!< 0x00010000 */

#define HRTIM_EECR2_EE9SRC_Pos        (18)
#define HRTIM_EECR2_EE9SRC_Msk        (0x3 << HRTIM_EECR2_EE9SRC_Pos)        /*!< 0x000C0000 */
#define HRTIM_EECR2_EE9SRC            HRTIM_EECR2_EE9SRC_Msk                   /*!< External event 9 source */
#define HRTIM_EECR2_EE9SRC_0          (0x1 << HRTIM_EECR2_EE9SRC_Pos)        /*!< 0x00040000 */
#define HRTIM_EECR2_EE9SRC_1          (0x2 << HRTIM_EECR2_EE9SRC_Pos)        /*!< 0x00080000 */
#define HRTIM_EECR2_EE9POL_Pos        (20)
#define HRTIM_EECR2_EE9POL_Msk        (0x1 << HRTIM_EECR2_EE9POL_Pos)        /*!< 0x00100000 */
#define HRTIM_EECR2_EE9POL            HRTIM_EECR2_EE9POL_Msk                   /*!< External event 9 Polarity */
#define HRTIM_EECR2_EE9SNS_Pos        (21)
#define HRTIM_EECR2_EE9SNS_Msk        (0x3 << HRTIM_EECR2_EE9SNS_Pos)        /*!< 0x00600000 */
#define HRTIM_EECR2_EE9SNS            HRTIM_EECR2_EE9SNS_Msk                   /*!< External event 9 sensitivity */
#define HRTIM_EECR2_EE9SNS_0          (0x1 << HRTIM_EECR2_EE9SNS_Pos)        /*!< 0x00200000 */
#define HRTIM_EECR2_EE9SNS_1          (0x2 << HRTIM_EECR2_EE9SNS_Pos)        /*!< 0x00400000 */

#define HRTIM_EECR2_EE10SRC_Pos       (24)
#define HRTIM_EECR2_EE10SRC_Msk       (0x3 << HRTIM_EECR2_EE10SRC_Pos)       /*!< 0x03000000 */
#define HRTIM_EECR2_EE10SRC           HRTIM_EECR2_EE10SRC_Msk                  /*!< External event 10 source */
#define HRTIM_EECR2_EE10SRC_0         (0x1 << HRTIM_EECR2_EE10SRC_Pos)       /*!< 0x01000000 */
#define HRTIM_EECR2_EE10SRC_1         (0x2 << HRTIM_EECR2_EE10SRC_Pos)       /*!< 0x02000000 */
#define HRTIM_EECR2_EE10POL_Pos       (26)
#define HRTIM_EECR2_EE10POL_Msk       (0x1 << HRTIM_EECR2_EE10POL_Pos)       /*!< 0x04000000 */
#define HRTIM_EECR2_EE10POL           HRTIM_EECR2_EE10POL_Msk                  /*!< External event 10 Polarity */
#define HRTIM_EECR2_EE10SNS_Pos       (27)
#define HRTIM_EECR2_EE10SNS_Msk       (0x3 << HRTIM_EECR2_EE10SNS_Pos)       /*!< 0x18000000 */
#define HRTIM_EECR2_EE10SNS           HRTIM_EECR2_EE10SNS_Msk                  /*!< External event 10 sensitivity */
#define HRTIM_EECR2_EE10SNS_0         (0x1 << HRTIM_EECR2_EE10SNS_Pos)       /*!< 0x08000000 */
#define HRTIM_EECR2_EE10SNS_1         (0x2 << HRTIM_EECR2_EE10SNS_Pos)       /*!< 0x10000000 */

/*******************  Bit definition for HRTIM_EECR3 register  ****************/
#define HRTIM_EECR3_EE6F_Pos          (0)
#define HRTIM_EECR3_EE6F_Msk          (0xF << HRTIM_EECR3_EE6F_Pos)          /*!< 0x0000000F */
#define HRTIM_EECR3_EE6F              HRTIM_EECR3_EE6F_Msk                     /*!< External event 6 filter */
#define HRTIM_EECR3_EE6F_0            (0x1 << HRTIM_EECR3_EE6F_Pos)          /*!< 0x00000001 */
#define HRTIM_EECR3_EE6F_1            (0x2 << HRTIM_EECR3_EE6F_Pos)          /*!< 0x00000002 */
#define HRTIM_EECR3_EE6F_2            (0x4 << HRTIM_EECR3_EE6F_Pos)          /*!< 0x00000004 */
#define HRTIM_EECR3_EE6F_3            (0x8 << HRTIM_EECR3_EE6F_Pos)          /*!< 0x00000008 */
#define HRTIM_EECR3_EE7F_Pos          (6)
#define HRTIM_EECR3_EE7F_Msk          (0xF << HRTIM_EECR3_EE7F_Pos)          /*!< 0x000003C0 */
#define HRTIM_EECR3_EE7F              HRTIM_EECR3_EE7F_Msk                     /*!< External event 7 filter */
#define HRTIM_EECR3_EE7F_0            (0x1 << HRTIM_EECR3_EE7F_Pos)          /*!< 0x00000040 */
#define HRTIM_EECR3_EE7F_1            (0x2 << HRTIM_EECR3_EE7F_Pos)          /*!< 0x00000080 */
#define HRTIM_EECR3_EE7F_2            (0x4 << HRTIM_EECR3_EE7F_Pos)          /*!< 0x00000100 */
#define HRTIM_EECR3_EE7F_3            (0x8 << HRTIM_EECR3_EE7F_Pos)          /*!< 0x00000200 */
#define HRTIM_EECR3_EE8F_Pos          (12)
#define HRTIM_EECR3_EE8F_Msk          (0xF << HRTIM_EECR3_EE8F_Pos)          /*!< 0x0000F000 */
#define HRTIM_EECR3_EE8F              HRTIM_EECR3_EE8F_Msk                     /*!< External event 8 filter */
#define HRTIM_EECR3_EE8F_0            (0x1 << HRTIM_EECR3_EE8F_Pos)          /*!< 0x00001000 */
#define HRTIM_EECR3_EE8F_1            (0x2 << HRTIM_EECR3_EE8F_Pos)          /*!< 0x00002000 */
#define HRTIM_EECR3_EE8F_2            (0x4 << HRTIM_EECR3_EE8F_Pos)          /*!< 0x00004000 */
#define HRTIM_EECR3_EE8F_3            (0x8 << HRTIM_EECR3_EE8F_Pos)          /*!< 0x00008000 */
#define HRTIM_EECR3_EE9F_Pos          (18)
#define HRTIM_EECR3_EE9F_Msk          (0xF << HRTIM_EECR3_EE9F_Pos)          /*!< 0x003C0000 */
#define HRTIM_EECR3_EE9F              HRTIM_EECR3_EE9F_Msk                     /*!< External event 9 filter */
#define HRTIM_EECR3_EE9F_0            (0x1 << HRTIM_EECR3_EE9F_Pos)          /*!< 0x00040000 */
#define HRTIM_EECR3_EE9F_1            (0x2 << HRTIM_EECR3_EE9F_Pos)          /*!< 0x00080000 */
#define HRTIM_EECR3_EE9F_2            (0x4 << HRTIM_EECR3_EE9F_Pos)          /*!< 0x00100000 */
#define HRTIM_EECR3_EE9F_3            (0x8 << HRTIM_EECR3_EE9F_Pos)          /*!< 0x00200000 */
#define HRTIM_EECR3_EE10F_Pos         (24)
#define HRTIM_EECR3_EE10F_Msk         (0xF << HRTIM_EECR3_EE10F_Pos)         /*!< 0x0F000000 */
#define HRTIM_EECR3_EE10F             HRTIM_EECR3_EE10F_Msk                    /*!< External event 10 filter */
#define HRTIM_EECR3_EE10F_0           (0x1 << HRTIM_EECR3_EE10F_Pos)         /*!< 0x01000000 */
#define HRTIM_EECR3_EE10F_1           (0x2 << HRTIM_EECR3_EE10F_Pos)         /*!< 0x02000000 */
#define HRTIM_EECR3_EE10F_2           (0x4 << HRTIM_EECR3_EE10F_Pos)         /*!< 0x04000000 */
#define HRTIM_EECR3_EE10F_3           (0x8 << HRTIM_EECR3_EE10F_Pos)         /*!< 0x08000000 */
#define HRTIM_EECR3_EEVSD_Pos         (30)
#define HRTIM_EECR3_EEVSD_Msk         (0x3 << HRTIM_EECR3_EEVSD_Pos)         /*!< 0xC0000000 */
#define HRTIM_EECR3_EEVSD             HRTIM_EECR3_EEVSD_Msk                    /*!< External event sampling clock division */
#define HRTIM_EECR3_EEVSD_0           (0x1 << HRTIM_EECR3_EEVSD_Pos)         /*!< 0x40000000 */
#define HRTIM_EECR3_EEVSD_1           (0x2 << HRTIM_EECR3_EEVSD_Pos)         /*!< 0x80000000 */

/*******************  Bit definition for HRTIM_ADC1R register  ****************/
#define HRTIM_ADC1R_AD1MC1_Pos        (0)
#define HRTIM_ADC1R_AD1MC1_Msk        (0x1 << HRTIM_ADC1R_AD1MC1_Pos)        /*!< 0x00000001 */
#define HRTIM_ADC1R_AD1MC1            HRTIM_ADC1R_AD1MC1_Msk                   /*!< ADC Trigger 1 on master compare 1 */
#define HRTIM_ADC1R_AD1MC2_Pos        (1)
#define HRTIM_ADC1R_AD1MC2_Msk        (0x1 << HRTIM_ADC1R_AD1MC2_Pos)        /*!< 0x00000002 */
#define HRTIM_ADC1R_AD1MC2            HRTIM_ADC1R_AD1MC2_Msk                   /*!< ADC Trigger 1 on master compare 2 */
#define HRTIM_ADC1R_AD1MC3_Pos        (2)
#define HRTIM_ADC1R_AD1MC3_Msk        (0x1 << HRTIM_ADC1R_AD1MC3_Pos)        /*!< 0x00000004 */
#define HRTIM_ADC1R_AD1MC3            HRTIM_ADC1R_AD1MC3_Msk                   /*!< ADC Trigger 1 on master compare 3 */
#define HRTIM_ADC1R_AD1MC4_Pos        (3)
#define HRTIM_ADC1R_AD1MC4_Msk        (0x1 << HRTIM_ADC1R_AD1MC4_Pos)        /*!< 0x00000008 */
#define HRTIM_ADC1R_AD1MC4            HRTIM_ADC1R_AD1MC4_Msk                   /*!< ADC Trigger 1 on master compare 4 */
#define HRTIM_ADC1R_AD1MPER_Pos       (4)
#define HRTIM_ADC1R_AD1MPER_Msk       (0x1 << HRTIM_ADC1R_AD1MPER_Pos)       /*!< 0x00000010 */
#define HRTIM_ADC1R_AD1MPER           HRTIM_ADC1R_AD1MPER_Msk                  /*!< ADC Trigger 1 on master period */
#define HRTIM_ADC1R_AD1EEV1_Pos       (5)
#define HRTIM_ADC1R_AD1EEV1_Msk       (0x1 << HRTIM_ADC1R_AD1EEV1_Pos)       /*!< 0x00000020 */
#define HRTIM_ADC1R_AD1EEV1           HRTIM_ADC1R_AD1EEV1_Msk                  /*!< ADC Trigger 1 on external event 1 */
#define HRTIM_ADC1R_AD1EEV2_Pos       (6)
#define HRTIM_ADC1R_AD1EEV2_Msk       (0x1 << HRTIM_ADC1R_AD1EEV2_Pos)       /*!< 0x00000040 */
#define HRTIM_ADC1R_AD1EEV2           HRTIM_ADC1R_AD1EEV2_Msk                  /*!< ADC Trigger 1 on external event 2 */
#define HRTIM_ADC1R_AD1EEV3_Pos       (7)
#define HRTIM_ADC1R_AD1EEV3_Msk       (0x1 << HRTIM_ADC1R_AD1EEV3_Pos)       /*!< 0x00000080 */
#define HRTIM_ADC1R_AD1EEV3           HRTIM_ADC1R_AD1EEV3_Msk                  /*!< ADC Trigger 1 on external event 3 */
#define HRTIM_ADC1R_AD1EEV4_Pos       (8)
#define HRTIM_ADC1R_AD1EEV4_Msk       (0x1 << HRTIM_ADC1R_AD1EEV4_Pos)       /*!< 0x00000100 */
#define HRTIM_ADC1R_AD1EEV4           HRTIM_ADC1R_AD1EEV4_Msk                  /*!< ADC Trigger 1 on external event 4 */
#define HRTIM_ADC1R_AD1EEV5_Pos       (9)
#define HRTIM_ADC1R_AD1EEV5_Msk       (0x1 << HRTIM_ADC1R_AD1EEV5_Pos)       /*!< 0x00000200 */
#define HRTIM_ADC1R_AD1EEV5           HRTIM_ADC1R_AD1EEV5_Msk                  /*!< ADC Trigger 1 on external event 5 */

#define HRTIM_ADC1R_AD1TFC2_Pos       (10)
#define HRTIM_ADC1R_AD1TFC2_Msk       (0x1 << HRTIM_ADC1R_AD1TFC2_Pos)       /*!< 0x00000400 */
#define HRTIM_ADC1R_AD1TFC2           HRTIM_ADC1R_AD1TFC2_Msk                  /*!< ADC Trigger 1 on Timer F compare 2 */

#define HRTIM_ADC1R_AD1TAC3_Pos       (11)
#define HRTIM_ADC1R_AD1TAC3_Msk       (0x1 << HRTIM_ADC1R_AD1TAC3_Pos)       /*!< 0x00000800 */
#define HRTIM_ADC1R_AD1TAC3           HRTIM_ADC1R_AD1TAC3_Msk                  /*!< ADC Trigger 1 on Timer A compare 3 */
#define HRTIM_ADC1R_AD1TAC4_Pos       (12)
#define HRTIM_ADC1R_AD1TAC4_Msk       (0x1 << HRTIM_ADC1R_AD1TAC4_Pos)       /*!< 0x00001000 */
#define HRTIM_ADC1R_AD1TAC4           HRTIM_ADC1R_AD1TAC4_Msk                  /*!< ADC Trigger 1 on Timer A compare 4 */
#define HRTIM_ADC1R_AD1TAPER_Pos      (13)
#define HRTIM_ADC1R_AD1TAPER_Msk      (0x1 << HRTIM_ADC1R_AD1TAPER_Pos)      /*!< 0x00002000 */
#define HRTIM_ADC1R_AD1TAPER          HRTIM_ADC1R_AD1TAPER_Msk                 /*!< ADC Trigger 1 on Timer A period */
#define HRTIM_ADC1R_AD1TARST_Pos      (14)
#define HRTIM_ADC1R_AD1TARST_Msk      (0x1 << HRTIM_ADC1R_AD1TARST_Pos)      /*!< 0x00004000 */
#define HRTIM_ADC1R_AD1TARST          HRTIM_ADC1R_AD1TARST_Msk                 /*!< ADC Trigger 1 on Timer A reset */

#define HRTIM_ADC1R_AD1TFC3_Pos       (15)
#define HRTIM_ADC1R_AD1TFC3_Msk       (0x1 << HRTIM_ADC1R_AD1TFC3_Pos)       /*!< 0x00008000 */
#define HRTIM_ADC1R_AD1TFC3           HRTIM_ADC1R_AD1TFC3_Msk                  /*!< ADC Trigger 1 on Timer F compare 3 */

#define HRTIM_ADC1R_AD1TBC3_Pos       (16)
#define HRTIM_ADC1R_AD1TBC3_Msk       (0x1 << HRTIM_ADC1R_AD1TBC3_Pos)       /*!< 0x00010000 */
#define HRTIM_ADC1R_AD1TBC3           HRTIM_ADC1R_AD1TBC3_Msk                  /*!< ADC Trigger 1 on Timer B compare 3 */
#define HRTIM_ADC1R_AD1TBC4_Pos       (17)
#define HRTIM_ADC1R_AD1TBC4_Msk       (0x1 << HRTIM_ADC1R_AD1TBC4_Pos)       /*!< 0x00020000 */
#define HRTIM_ADC1R_AD1TBC4           HRTIM_ADC1R_AD1TBC4_Msk                  /*!< ADC Trigger 1 on Timer B compare 4 */
#define HRTIM_ADC1R_AD1TBPER_Pos      (18)
#define HRTIM_ADC1R_AD1TBPER_Msk      (0x1 << HRTIM_ADC1R_AD1TBPER_Pos)      /*!< 0x00040000 */
#define HRTIM_ADC1R_AD1TBPER          HRTIM_ADC1R_AD1TBPER_Msk                 /*!< ADC Trigger 1 on Timer B period */
#define HRTIM_ADC1R_AD1TBRST_Pos      (19)
#define HRTIM_ADC1R_AD1TBRST_Msk      (0x1 << HRTIM_ADC1R_AD1TBRST_Pos)      /*!< 0x00080000 */
#define HRTIM_ADC1R_AD1TBRST          HRTIM_ADC1R_AD1TBRST_Msk                 /*!< ADC Trigger 1 on Timer B reset */

#define HRTIM_ADC1R_AD1TFC4_Pos       (20)
#define HRTIM_ADC1R_AD1TFC4_Msk       (0x1 << HRTIM_ADC1R_AD1TFC4_Pos)       /*!< 0x00100000 */
#define HRTIM_ADC1R_AD1TFC4           HRTIM_ADC1R_AD1TFC4_Msk                  /*!< ADC Trigger 1 on Timer F compare 4 */

