pdietl/arm_mcu/inc/stm32g474xx_asm.h
#define HRTIM_ADC4R_AD4TFPER_Pos      (24)
#define HRTIM_ADC4R_AD4TFPER_Msk      (0x1 << HRTIM_ADC4R_AD4TFPER_Pos)      /*!< 0x01000000 */
#define HRTIM_ADC4R_AD4TFPER          HRTIM_ADC4R_AD4TFPER_Msk                 /*!< ADC Trigger 4 on Timer F period */

#define HRTIM_ADC4R_AD4TDC4_Pos       (25)
#define HRTIM_ADC4R_AD4TDC4_Msk       (0x1 << HRTIM_ADC4R_AD4TDC4_Pos)       /*!< 0x02000000 */
#define HRTIM_ADC4R_AD4TDC4           HRTIM_ADC4R_AD4TDC4_Msk                  /*!< ADC Trigger 4 on Timer D compare 4*/
#define HRTIM_ADC4R_AD4TDPER_Pos      (26)
#define HRTIM_ADC4R_AD4TDPER_Msk      (0x1 << HRTIM_ADC4R_AD4TDPER_Pos)      /*!< 0x04000000 */
#define HRTIM_ADC4R_AD4TDPER          HRTIM_ADC4R_AD4TDPER_Msk                 /*!< ADC Trigger 4 on Timer D period */
#define HRTIM_ADC4R_AD4TDRST_Pos      (27)
#define HRTIM_ADC4R_AD4TDRST_Msk      (0x1 << HRTIM_ADC4R_AD4TDRST_Pos)      /*!< 0x08000000 */
#define HRTIM_ADC4R_AD4TDRST          HRTIM_ADC4R_AD4TDRST_Msk                 /*!< ADC Trigger 4 on Timer D reset */
#define HRTIM_ADC4R_AD4TEC2_Pos       (28)
#define HRTIM_ADC4R_AD4TEC2_Msk       (0x1 << HRTIM_ADC4R_AD4TEC2_Pos)       /*!< 0x10000000 */
#define HRTIM_ADC4R_AD4TEC2           HRTIM_ADC4R_AD4TEC2_Msk                  /*!< ADC Trigger 4 on Timer E compare 2 */
#define HRTIM_ADC4R_AD4TEC3_Pos       (29)
#define HRTIM_ADC4R_AD4TEC3_Msk       (0x1 << HRTIM_ADC4R_AD4TEC3_Pos)       /*!< 0x20000000 */
#define HRTIM_ADC4R_AD4TEC3           HRTIM_ADC4R_AD4TEC3_Msk                  /*!< ADC Trigger 4 on Timer E compare 3 */
#define HRTIM_ADC4R_AD4TEC4_Pos       (30)
#define HRTIM_ADC4R_AD4TEC4_Msk       (0x1 << HRTIM_ADC4R_AD4TEC4_Pos)       /*!< 0x40000000 */
#define HRTIM_ADC4R_AD4TEC4           HRTIM_ADC4R_AD4TEC4_Msk                  /*!< ADC Trigger 4 on Timer E compare 4 */
#define HRTIM_ADC4R_AD4TERST_Pos      (31)
#define HRTIM_ADC4R_AD4TERST_Msk      (0x1 << HRTIM_ADC4R_AD4TERST_Pos)      /*!< 0x80000000 */
#define HRTIM_ADC4R_AD4TERST          HRTIM_ADC4R_AD4TERST_Msk                 /*!< ADC Trigger 4 on Timer E reset */

/*******************  Bit definition for HRTIM_DLLCR register  ****************/
#define HRTIM_DLLCR_CAL_Pos           (0)
#define HRTIM_DLLCR_CAL_Msk           (0x1 << HRTIM_DLLCR_CAL_Pos)           /*!< 0x00000001 */
#define HRTIM_DLLCR_CAL               HRTIM_DLLCR_CAL_Msk                      /*!< DLL calibration start */
#define HRTIM_DLLCR_CALEN_Pos         (1)
#define HRTIM_DLLCR_CALEN_Msk         (0x1 << HRTIM_DLLCR_CALEN_Pos)         /*!< 0x00000002 */
#define HRTIM_DLLCR_CALEN             HRTIM_DLLCR_CALEN_Msk                    /*!< DLL calibration enable */
#define HRTIM_DLLCR_CALRTE_Pos        (2)
#define HRTIM_DLLCR_CALRTE_Msk        (0x3 << HRTIM_DLLCR_CALRTE_Pos)        /*!< 0x0000000C */
#define HRTIM_DLLCR_CALRTE            HRTIM_DLLCR_CALRTE_Msk                   /*!< DLL calibration rate */
#define HRTIM_DLLCR_CALRTE_0          (0x1 << HRTIM_DLLCR_CALRTE_Pos)        /*!< 0x00000004 */
#define HRTIM_DLLCR_CALRTE_1          (0x2 << HRTIM_DLLCR_CALRTE_Pos)        /*!< 0x00000008 */

/*******************  Bit definition for HRTIM_FLTINR1 register  ***************/
#define HRTIM_FLTINR1_FLT1E_Pos       (0)
#define HRTIM_FLTINR1_FLT1E_Msk       (0x1 << HRTIM_FLTINR1_FLT1E_Pos)       /*!< 0x00000001 */
#define HRTIM_FLTINR1_FLT1E           HRTIM_FLTINR1_FLT1E_Msk                  /*!< Fault 1 enable */
#define HRTIM_FLTINR1_FLT1P_Pos       (1)
#define HRTIM_FLTINR1_FLT1P_Msk       (0x1 << HRTIM_FLTINR1_FLT1P_Pos)       /*!< 0x00000002 */
#define HRTIM_FLTINR1_FLT1P           HRTIM_FLTINR1_FLT1P_Msk                  /*!< Fault 1 polarity */
#define HRTIM_FLTINR1_FLT1SRC_0_Pos   (2)
#define HRTIM_FLTINR1_FLT1SRC_0_Msk   (0x1 << HRTIM_FLTINR1_FLT1SRC_0_Pos)   /*!< 0x00000004 */
#define HRTIM_FLTINR1_FLT1SRC_0       HRTIM_FLTINR1_FLT1SRC_0_Msk              /*!< Fault 1 source bit 0 */
#define HRTIM_FLTINR1_FLT1F_Pos       (3)
#define HRTIM_FLTINR1_FLT1F_Msk       (0xF << HRTIM_FLTINR1_FLT1F_Pos)       /*!< 0x00000078 */
#define HRTIM_FLTINR1_FLT1F           HRTIM_FLTINR1_FLT1F_Msk                  /*!< Fault 1 filter */
#define HRTIM_FLTINR1_FLT1F_0         (0x1 << HRTIM_FLTINR1_FLT1F_Pos)       /*!< 0x00000008 */
#define HRTIM_FLTINR1_FLT1F_1         (0x2 << HRTIM_FLTINR1_FLT1F_Pos)       /*!< 0x00000010 */
#define HRTIM_FLTINR1_FLT1F_2         (0x4 << HRTIM_FLTINR1_FLT1F_Pos)       /*!< 0x00000020 */
#define HRTIM_FLTINR1_FLT1F_3         (0x8 << HRTIM_FLTINR1_FLT1F_Pos)       /*!< 0x00000040 */
#define HRTIM_FLTINR1_FLT1LCK_Pos     (7)
#define HRTIM_FLTINR1_FLT1LCK_Msk     (0x1 << HRTIM_FLTINR1_FLT1LCK_Pos)     /*!< 0x00000080 */
#define HRTIM_FLTINR1_FLT1LCK         HRTIM_FLTINR1_FLT1LCK_Msk                /*!< Fault 1 lock */
#define HRTIM_FLTINR1_FLT2E_Pos       (8)
#define HRTIM_FLTINR1_FLT2E_Msk       (0x1 << HRTIM_FLTINR1_FLT2E_Pos)       /*!< 0x00000100 */
#define HRTIM_FLTINR1_FLT2E           HRTIM_FLTINR1_FLT2E_Msk                  /*!< Fault 2 enable */
#define HRTIM_FLTINR1_FLT2P_Pos       (9)
#define HRTIM_FLTINR1_FLT2P_Msk       (0x1 << HRTIM_FLTINR1_FLT2P_Pos)       /*!< 0x00000200 */
#define HRTIM_FLTINR1_FLT2P           HRTIM_FLTINR1_FLT2P_Msk                  /*!< Fault 2 polarity */
#define HRTIM_FLTINR1_FLT2SRC_0_Pos   (10)
#define HRTIM_FLTINR1_FLT2SRC_0_Msk   (0x1 << HRTIM_FLTINR1_FLT2SRC_0_Pos)    /*!< 0x00000400 */
#define HRTIM_FLTINR1_FLT2SRC_0       HRTIM_FLTINR1_FLT2SRC_0_Msk               /*!< Fault 2 source bit 0 */
#define HRTIM_FLTINR1_FLT2F_Pos       (11)
#define HRTIM_FLTINR1_FLT2F_Msk       (0xF << HRTIM_FLTINR1_FLT2F_Pos)       /*!< 0x00007800 */
#define HRTIM_FLTINR1_FLT2F           HRTIM_FLTINR1_FLT2F_Msk                  /*!< Fault 2 filter */
#define HRTIM_FLTINR1_FLT2F_0         (0x1 << HRTIM_FLTINR1_FLT2F_Pos)       /*!< 0x00000800 */
#define HRTIM_FLTINR1_FLT2F_1         (0x2 << HRTIM_FLTINR1_FLT2F_Pos)       /*!< 0x00001000 */
#define HRTIM_FLTINR1_FLT2F_2         (0x4 << HRTIM_FLTINR1_FLT2F_Pos)       /*!< 0x00002000 */
#define HRTIM_FLTINR1_FLT2F_3         (0x8 << HRTIM_FLTINR1_FLT2F_Pos)       /*!< 0x00004000 */
#define HRTIM_FLTINR1_FLT2LCK_Pos     (15)
#define HRTIM_FLTINR1_FLT2LCK_Msk     (0x1 << HRTIM_FLTINR1_FLT2LCK_Pos)     /*!< 0x00008000 */
#define HRTIM_FLTINR1_FLT2LCK         HRTIM_FLTINR1_FLT2LCK_Msk                /*!< Fault 2 lock */
#define HRTIM_FLTINR1_FLT3E_Pos       (16)
#define HRTIM_FLTINR1_FLT3E_Msk       (0x1 << HRTIM_FLTINR1_FLT3E_Pos)       /*!< 0x00010000 */
#define HRTIM_FLTINR1_FLT3E           HRTIM_FLTINR1_FLT3E_Msk                  /*!< Fault 3 enable */
#define HRTIM_FLTINR1_FLT3P_Pos       (17)
#define HRTIM_FLTINR1_FLT3P_Msk       (0x1 << HRTIM_FLTINR1_FLT3P_Pos)       /*!< 0x00020000 */
#define HRTIM_FLTINR1_FLT3P           HRTIM_FLTINR1_FLT3P_Msk                  /*!< Fault 3 polarity */
#define HRTIM_FLTINR1_FLT3SRC_0_Pos   (18)
#define HRTIM_FLTINR1_FLT3SRC_0_Msk   (0x1 << HRTIM_FLTINR1_FLT3SRC_0_Pos)   /*!< 0x00040000 */
#define HRTIM_FLTINR1_FLT3SRC_0       HRTIM_FLTINR1_FLT3SRC_0_Msk              /*!< Fault 3 source bit 0 */
#define HRTIM_FLTINR1_FLT3F_Pos       (19)
#define HRTIM_FLTINR1_FLT3F_Msk       (0xF << HRTIM_FLTINR1_FLT3F_Pos)       /*!< 0x00780000 */
#define HRTIM_FLTINR1_FLT3F           HRTIM_FLTINR1_FLT3F_Msk                  /*!< Fault 3 filter */
#define HRTIM_FLTINR1_FLT3F_0         (0x1 << HRTIM_FLTINR1_FLT3F_Pos)       /*!< 0x00080000 */
#define HRTIM_FLTINR1_FLT3F_1         (0x2 << HRTIM_FLTINR1_FLT3F_Pos)       /*!< 0x00100000 */
#define HRTIM_FLTINR1_FLT3F_2         (0x4 << HRTIM_FLTINR1_FLT3F_Pos)       /*!< 0x00200000 */
#define HRTIM_FLTINR1_FLT3F_3         (0x8 << HRTIM_FLTINR1_FLT3F_Pos)       /*!< 0x00400000 */
#define HRTIM_FLTINR1_FLT3LCK_Pos     (23)
#define HRTIM_FLTINR1_FLT3LCK_Msk     (0x1 << HRTIM_FLTINR1_FLT3LCK_Pos)     /*!< 0x00800000 */
#define HRTIM_FLTINR1_FLT3LCK         HRTIM_FLTINR1_FLT3LCK_Msk                /*!< Fault 3 lock */
#define HRTIM_FLTINR1_FLT4E_Pos       (24)
#define HRTIM_FLTINR1_FLT4E_Msk       (0x1 << HRTIM_FLTINR1_FLT4E_Pos)       /*!< 0x01000000 */
#define HRTIM_FLTINR1_FLT4E           HRTIM_FLTINR1_FLT4E_Msk                  /*!< Fault 4 enable */
#define HRTIM_FLTINR1_FLT4P_Pos       (25)
#define HRTIM_FLTINR1_FLT4P_Msk       (0x1 << HRTIM_FLTINR1_FLT4P_Pos)       /*!< 0x02000000 */
#define HRTIM_FLTINR1_FLT4P           HRTIM_FLTINR1_FLT4P_Msk                  /*!< Fault 4 polarity */
#define HRTIM_FLTINR1_FLT4SRC_0_Pos   (26)
#define HRTIM_FLTINR1_FLT4SRC_0_Msk   (0x1 << HRTIM_FLTINR1_FLT4SRC_0_Pos)    /*!< 0x04000000 */
#define HRTIM_FLTINR1_FLT4SRC_0       HRTIM_FLTINR1_FLT4SRC_0_Msk               /*!< Fault 4 source bit 0 */
#define HRTIM_FLTINR1_FLT4F_Pos       (27)
#define HRTIM_FLTINR1_FLT4F_Msk       (0xF << HRTIM_FLTINR1_FLT4F_Pos)       /*!< 0x78000000 */
#define HRTIM_FLTINR1_FLT4F           HRTIM_FLTINR1_FLT4F_Msk                  /*!< Fault 4 filter */
#define HRTIM_FLTINR1_FLT4F_0         (0x1 << HRTIM_FLTINR1_FLT4F_Pos)       /*!< 0x08000000 */
#define HRTIM_FLTINR1_FLT4F_1         (0x2 << HRTIM_FLTINR1_FLT4F_Pos)       /*!< 0x10000000 */
#define HRTIM_FLTINR1_FLT4F_2         (0x4 << HRTIM_FLTINR1_FLT4F_Pos)       /*!< 0x20000000 */
#define HRTIM_FLTINR1_FLT4F_3         (0x8 << HRTIM_FLTINR1_FLT4F_Pos)       /*!< 0x40000000 */
#define HRTIM_FLTINR1_FLT4LCK_Pos     (31)
#define HRTIM_FLTINR1_FLT4LCK_Msk     (0x1 << HRTIM_FLTINR1_FLT4LCK_Pos)     /*!< 0x80000000 */
#define HRTIM_FLTINR1_FLT4LCK         HRTIM_FLTINR1_FLT4LCK_Msk                /*!< Fault 4 lock */

/*******************  Bit definition for HRTIM_FLTINR2 register  ***************/
#define HRTIM_FLTINR2_FLT5E_Pos       (0)
#define HRTIM_FLTINR2_FLT5E_Msk       (0x1 << HRTIM_FLTINR2_FLT5E_Pos)       /*!< 0x00000001 */
#define HRTIM_FLTINR2_FLT5E           HRTIM_FLTINR2_FLT5E_Msk                  /*!< Fault 5 enable */
#define HRTIM_FLTINR2_FLT5P_Pos       (1)
#define HRTIM_FLTINR2_FLT5P_Msk       (0x1 << HRTIM_FLTINR2_FLT5P_Pos)       /*!< 0x00000002 */
#define HRTIM_FLTINR2_FLT5P           HRTIM_FLTINR2_FLT5P_Msk                  /*!< Fault 5 polarity */
#define HRTIM_FLTINR2_FLT5SRC_0_Pos   (2)
#define HRTIM_FLTINR2_FLT5SRC_0_Msk   (0x1 << HRTIM_FLTINR2_FLT5SRC_0_Pos)   /*!< 0x00000004 */
#define HRTIM_FLTINR2_FLT5SRC_0       HRTIM_FLTINR2_FLT5SRC_0_Msk              /*!< Fault 5 source bit 0 */
#define HRTIM_FLTINR2_FLT5F_Pos       (3)
#define HRTIM_FLTINR2_FLT5F_Msk       (0xF << HRTIM_FLTINR2_FLT5F_Pos)       /*!< 0x00000078 */
#define HRTIM_FLTINR2_FLT5F           HRTIM_FLTINR2_FLT5F_Msk                  /*!< Fault 5 filter */
#define HRTIM_FLTINR2_FLT5F_0         (0x1 << HRTIM_FLTINR2_FLT5F_Pos)       /*!< 0x00000008 */
#define HRTIM_FLTINR2_FLT5F_1         (0x2 << HRTIM_FLTINR2_FLT5F_Pos)       /*!< 0x00000010 */
#define HRTIM_FLTINR2_FLT5F_2         (0x4 << HRTIM_FLTINR2_FLT5F_Pos)       /*!< 0x00000020 */
#define HRTIM_FLTINR2_FLT5F_3         (0x8 << HRTIM_FLTINR2_FLT5F_Pos)       /*!< 0x00000040 */
#define HRTIM_FLTINR2_FLT5LCK_Pos     (7)
#define HRTIM_FLTINR2_FLT5LCK_Msk     (0x1 << HRTIM_FLTINR2_FLT5LCK_Pos)     /*!< 0x00000080 */
#define HRTIM_FLTINR2_FLT5LCK         HRTIM_FLTINR2_FLT5LCK_Msk                /*!< Fault 5 lock */
#define HRTIM_FLTINR2_FLT6E_Pos       (8)
#define HRTIM_FLTINR2_FLT6E_Msk       (0x1 << HRTIM_FLTINR2_FLT6E_Pos)       /*!< 0x00000100 */
#define HRTIM_FLTINR2_FLT6E           HRTIM_FLTINR2_FLT6E_Msk                  /*!< Fault 6 enable */
#define HRTIM_FLTINR2_FLT6P_Pos       (9)
#define HRTIM_FLTINR2_FLT6P_Msk       (0x1 << HRTIM_FLTINR2_FLT6P_Pos)       /*!< 0x00000200 */
#define HRTIM_FLTINR2_FLT6P           HRTIM_FLTINR2_FLT6P_Msk                  /*!< Fault 6 polarity */
#define HRTIM_FLTINR2_FLT6SRC_0_Pos   (10)
#define HRTIM_FLTINR2_FLT6SRC_0_Msk   (0x1 << HRTIM_FLTINR2_FLT6SRC_0_Pos)   /*!< 0x00000400 */
#define HRTIM_FLTINR2_FLT6SRC_0       HRTIM_FLTINR2_FLT6SRC_0_Msk              /*!< Fault 6 source bit 0 */
#define HRTIM_FLTINR2_FLT6F_Pos       (11)
#define HRTIM_FLTINR2_FLT6F_Msk       (0xF << HRTIM_FLTINR2_FLT6F_Pos)       /*!< 0x00007800 */
#define HRTIM_FLTINR2_FLT6F           HRTIM_FLTINR2_FLT6F_Msk                  /*!< Fault 6 filter */
#define HRTIM_FLTINR2_FLT6F_0         (0x1 << HRTIM_FLTINR2_FLT6F_Pos)       /*!< 0x00000008 */
#define HRTIM_FLTINR2_FLT6F_1         (0x2 << HRTIM_FLTINR2_FLT6F_Pos)       /*!< 0x00000010 */
#define HRTIM_FLTINR2_FLT6F_2         (0x4 << HRTIM_FLTINR2_FLT6F_Pos)       /*!< 0x00000020 */
#define HRTIM_FLTINR2_FLT6F_3         (0x8 << HRTIM_FLTINR2_FLT6F_Pos)       /*!< 0x00000040 */
#define HRTIM_FLTINR2_FLT6LCK_Pos     (15)
#define HRTIM_FLTINR2_FLT6LCK_Msk     (0x1 << HRTIM_FLTINR2_FLT6LCK_Pos)     /*!< 0x00008000 */
#define HRTIM_FLTINR2_FLT6LCK         HRTIM_FLTINR2_FLT6LCK_Msk                /*!< Fault 6 lock */
#define HRTIM_FLTINR2_FLT1SRC_1_Pos   (16)
#define HRTIM_FLTINR2_FLT1SRC_1_Msk   (0x1 << HRTIM_FLTINR2_FLT1SRC_1_Pos)   /*!< 0x00010000 */
#define HRTIM_FLTINR2_FLT1SRC_1       HRTIM_FLTINR2_FLT1SRC_1_Msk              /*!< Fault 1 source bit 1 */
#define HRTIM_FLTINR2_FLT2SRC_1_Pos   (17)
#define HRTIM_FLTINR2_FLT2SRC_1_Msk   (0x1 << HRTIM_FLTINR2_FLT2SRC_1_Pos)   /*!< 0x00020000 */
#define HRTIM_FLTINR2_FLT2SRC_1       HRTIM_FLTINR2_FLT2SRC_1_Msk              /*!< Fault 2 source bit1 */
#define HRTIM_FLTINR2_FLT3SRC_1_Pos   (18)
#define HRTIM_FLTINR2_FLT3SRC_1_Msk   (0x1 << HRTIM_FLTINR2_FLT3SRC_1_Pos)   /*!< 0x00040000 */
#define HRTIM_FLTINR2_FLT3SRC_1       HRTIM_FLTINR2_FLT3SRC_1_Msk              /*!< Fault 3 source bit 1 */
#define HRTIM_FLTINR2_FLT4SRC_1_Pos   (19)
#define HRTIM_FLTINR2_FLT4SRC_1_Msk   (0x1 << HRTIM_FLTINR2_FLT4SRC_1_Pos)   /*!< 0x00080000 */
#define HRTIM_FLTINR2_FLT4SRC_1       HRTIM_FLTINR2_FLT4SRC_1_Msk              /*!< Fault 4 source bit 1 */
#define HRTIM_FLTINR2_FLT5SRC_1_Pos   (20)
#define HRTIM_FLTINR2_FLT5SRC_1_Msk   (0x1 << HRTIM_FLTINR2_FLT5SRC_1_Pos)   /*!< 0x00100000 */
#define HRTIM_FLTINR2_FLT5SRC_1       HRTIM_FLTINR2_FLT5SRC_1_Msk              /*!< Fault 5 source bit 1 */
#define HRTIM_FLTINR2_FLT6SRC_1_Pos   (21)
#define HRTIM_FLTINR2_FLT6SRC_1_Msk   (0x1 << HRTIM_FLTINR2_FLT6SRC_1_Pos)   /*!< 0x00200000 */
#define HRTIM_FLTINR2_FLT6SRC_1       HRTIM_FLTINR2_FLT6SRC_1_Msk              /*!< Fault 6 source bit 1 */
#define HRTIM_FLTINR2_FLTSD_Pos       (24)
#define HRTIM_FLTINR2_FLTSD_Msk       (0x3 << HRTIM_FLTINR2_FLTSD_Pos)       /*!< 0x03000000 */
#define HRTIM_FLTINR2_FLTSD           HRTIM_FLTINR2_FLTSD_Msk                  /*!< Fault sampling clock division */
#define HRTIM_FLTINR2_FLTSD_0         (0x1 << HRTIM_FLTINR2_FLTSD_Pos)       /*!< 0x01000000 */
#define HRTIM_FLTINR2_FLTSD_1         (0x2 << HRTIM_FLTINR2_FLTSD_Pos)       /*!< 0x02000000 */

