pdietl/arm_mcu/inc/stm32g474xx_asm.h
/*******************  Bit definition for HRTIM_FLTINR3 register  ***************/
#define HRTIM_FLTINR3_FLT1BLKE_Pos     (0)
#define HRTIM_FLTINR3_FLT1BLKE_Msk     (0x1 << HRTIM_FLTINR3_FLT1BLKE_Pos)   /*!< 0x00000001 */
#define HRTIM_FLTINR3_FLT1BLKE         HRTIM_FLTINR3_FLT1BLKE_Msk              /*!< Fault 1 Blanking Enable */
#define HRTIM_FLTINR3_FLT1BLKS_Pos     (1)
#define HRTIM_FLTINR3_FLT1BLKS_Msk     (0x1 << HRTIM_FLTINR3_FLT1BLKS_Pos)   /*!< 0x00000002 */
#define HRTIM_FLTINR3_FLT1BLKS         HRTIM_FLTINR3_FLT1BLKS_Msk              /*!< Fault 1 Blanking Source */
#define HRTIM_FLTINR3_FLT1CNT_Pos      (2)
#define HRTIM_FLTINR3_FLT1CNT_Msk      (0xF << HRTIM_FLTINR3_FLT1CNT_Pos)    /*!< 0x0000003C */
#define HRTIM_FLTINR3_FLT1CNT          HRTIM_FLTINR3_FLT1CNT_Msk               /*!< Fault 1 Counter */
#define HRTIM_FLTINR3_FLT1CNT_0        (0x1 << HRTIM_FLTINR3_FLT1CNT_Pos)    /*!< 0x00000004 */
#define HRTIM_FLTINR3_FLT1CNT_1        (0x2 << HRTIM_FLTINR3_FLT1CNT_Pos)    /*!< 0x00000008 */
#define HRTIM_FLTINR3_FLT1CNT_2        (0x4 << HRTIM_FLTINR3_FLT1CNT_Pos)    /*!< 0x00000010 */
#define HRTIM_FLTINR3_FLT1CNT_3        (0x8 << HRTIM_FLTINR3_FLT1CNT_Pos)    /*!< 0x00000020 */
#define HRTIM_FLTINR3_FLT1CRES_Pos     (6)
#define HRTIM_FLTINR3_FLT1CRES_Msk     (0x1 << HRTIM_FLTINR3_FLT1CRES_Pos)   /*!< 0x00000040 */
#define HRTIM_FLTINR3_FLT1CRES         HRTIM_FLTINR3_FLT1CRES_Msk              /*!< Fault 1 Counter Reset  */
#define HRTIM_FLTINR3_FLT1RSTM_Pos     (7)
#define HRTIM_FLTINR3_FLT1RSTM_Msk     (0x1 << HRTIM_FLTINR3_FLT1RSTM_Pos)   /*!< 0x00000080 */
#define HRTIM_FLTINR3_FLT1RSTM         HRTIM_FLTINR3_FLT1RSTM_Msk              /*!< Fault 1 Counter Reset Mode */
#define HRTIM_FLTINR3_FLT2BLKE_Pos     (8)
#define HRTIM_FLTINR3_FLT2BLKE_Msk     (0x1 << HRTIM_FLTINR3_FLT2BLKE_Pos)   /*!< 0x00000100 */
#define HRTIM_FLTINR3_FLT2BLKE         HRTIM_FLTINR3_FLT2BLKE_Msk              /*!< Fault 2 Blanking Enable */
#define HRTIM_FLTINR3_FLT2BLKS_Pos     (9)
#define HRTIM_FLTINR3_FLT2BLKS_Msk     (0x1 << HRTIM_FLTINR3_FLT2BLKS_Pos)   /*!< 0x00000200 */
#define HRTIM_FLTINR3_FLT2BLKS         HRTIM_FLTINR3_FLT2BLKS_Msk              /*!< Fault 2 Blanking Source */
#define HRTIM_FLTINR3_FLT2CNT_Pos      (10)
#define HRTIM_FLTINR3_FLT2CNT_Msk      (0xF << HRTIM_FLTINR3_FLT2CNT_Pos)    /*!< 0x00003C00 */
#define HRTIM_FLTINR3_FLT2CNT          HRTIM_FLTINR3_FLT2CNT_Msk               /*!< Fault 2 Counter */
#define HRTIM_FLTINR3_FLT2CNT_0        (0x1 << HRTIM_FLTINR3_FLT2CNT_Pos)    /*!< 0x00000400 */
#define HRTIM_FLTINR3_FLT2CNT_1        (0x2 << HRTIM_FLTINR3_FLT2CNT_Pos)    /*!< 0x00000800 */
#define HRTIM_FLTINR3_FLT2CNT_2        (0x4 << HRTIM_FLTINR3_FLT2CNT_Pos)    /*!< 0x00001000 */
#define HRTIM_FLTINR3_FLT2CNT_3        (0x8 << HRTIM_FLTINR3_FLT2CNT_Pos)    /*!< 0x00002000 */
#define HRTIM_FLTINR3_FLT2CRES_Pos     (14)
#define HRTIM_FLTINR3_FLT2CRES_Msk     (0x1 << HRTIM_FLTINR3_FLT2CRES_Pos)   /*!< 0x00004000 */
#define HRTIM_FLTINR3_FLT2CRES         HRTIM_FLTINR3_FLT2CRES_Msk              /*!< Fault 2 Counter Reset  */
#define HRTIM_FLTINR3_FLT2RSTM_Pos     (15)
#define HRTIM_FLTINR3_FLT2RSTM_Msk     (0x1 << HRTIM_FLTINR3_FLT2RSTM_Pos)   /*!< 0x00008000 */
#define HRTIM_FLTINR3_FLT2RSTM         HRTIM_FLTINR3_FLT2RSTM_Msk              /*!< Fault 2 Counter Reset Mode */
#define HRTIM_FLTINR3_FLT3BLKE_Pos     (16)
#define HRTIM_FLTINR3_FLT3BLKE_Msk     (0x1 << HRTIM_FLTINR3_FLT3BLKE_Pos)   /*!< 0x00010000 */
#define HRTIM_FLTINR3_FLT3BLKE         HRTIM_FLTINR3_FLT3BLKE_Msk              /*!< Fault 3 Blanking Enable */
#define HRTIM_FLTINR3_FLT3BLKS_Pos     (17)
#define HRTIM_FLTINR3_FLT3BLKS_Msk     (0x1 << HRTIM_FLTINR3_FLT3BLKS_Pos)   /*!< 0x00020000 */
#define HRTIM_FLTINR3_FLT3BLKS         HRTIM_FLTINR3_FLT3BLKS_Msk              /*!< Fault 3 Blanking Source */
#define HRTIM_FLTINR3_FLT3CNT_Pos      (18)
#define HRTIM_FLTINR3_FLT3CNT_Msk      (0xF << HRTIM_FLTINR3_FLT3CNT_Pos)    /*!< 0x003C0000 */
#define HRTIM_FLTINR3_FLT3CNT          HRTIM_FLTINR3_FLT3CNT_Msk               /*!< Fault 3 Counter */
#define HRTIM_FLTINR3_FLT3CNT_0        (0x1 << HRTIM_FLTINR3_FLT3CNT_Pos)    /*!< 0x00040000 */
#define HRTIM_FLTINR3_FLT3CNT_1        (0x2 << HRTIM_FLTINR3_FLT3CNT_Pos)    /*!< 0x00080000 */
#define HRTIM_FLTINR3_FLT3CNT_2        (0x4 << HRTIM_FLTINR3_FLT3CNT_Pos)    /*!< 0x00100000 */
#define HRTIM_FLTINR3_FLT3CNT_3        (0x8 << HRTIM_FLTINR3_FLT3CNT_Pos)    /*!< 0x00200000 */
#define HRTIM_FLTINR3_FLT3CRES_Pos     (22)
#define HRTIM_FLTINR3_FLT3CRES_Msk     (0x1 << HRTIM_FLTINR3_FLT3CRES_Pos)   /*!< 0x00400000 */
#define HRTIM_FLTINR3_FLT3CRES         HRTIM_FLTINR3_FLT3CRES_Msk              /*!< Fault 3 Counter Reset  */
#define HRTIM_FLTINR3_FLT3RSTM_Pos     (23)
#define HRTIM_FLTINR3_FLT3RSTM_Msk     (0x1 << HRTIM_FLTINR3_FLT3RSTM_Pos)   /*!< 0x00800000 */
#define HRTIM_FLTINR3_FLT3RSTM         HRTIM_FLTINR3_FLT3RSTM_Msk              /*!< Fault 3 Counter Reset Mode */
#define HRTIM_FLTINR3_FLT4BLKE_Pos     (24)
#define HRTIM_FLTINR3_FLT4BLKE_Msk     (0x1 << HRTIM_FLTINR3_FLT4BLKE_Pos)   /*!< 0x01000000 */
#define HRTIM_FLTINR3_FLT4BLKE         HRTIM_FLTINR3_FLT4BLKE_Msk              /*!< Fault 4 Blanking Enable */
#define HRTIM_FLTINR3_FLT4BLKS_Pos     (25)
#define HRTIM_FLTINR3_FLT4BLKS_Msk     (0x1 << HRTIM_FLTINR3_FLT4BLKS_Pos)   /*!< 0x02000000 */
#define HRTIM_FLTINR3_FLT4BLKS         HRTIM_FLTINR3_FLT4BLKS_Msk              /*!< Fault 4 Blanking Source */
#define HRTIM_FLTINR3_FLT4CNT_Pos      (26)
#define HRTIM_FLTINR3_FLT4CNT_Msk      (0xF << HRTIM_FLTINR3_FLT4CNT_Pos)    /*!< 0x003C0000 */
#define HRTIM_FLTINR3_FLT4CNT          HRTIM_FLTINR3_FLT4CNT_Msk               /*!< Fault 4 Counter */
#define HRTIM_FLTINR3_FLT4CNT_0        (0x1 << HRTIM_FLTINR3_FLT4CNT_Pos)    /*!< 0x00040000 */
#define HRTIM_FLTINR3_FLT4CNT_1        (0x2 << HRTIM_FLTINR3_FLT4CNT_Pos)    /*!< 0x00080000 */
#define HRTIM_FLTINR3_FLT4CNT_2        (0x4 << HRTIM_FLTINR3_FLT4CNT_Pos)    /*!< 0x00100000 */
#define HRTIM_FLTINR3_FLT4CNT_3        (0x8 << HRTIM_FLTINR3_FLT4CNT_Pos)    /*!< 0x00200000 */
#define HRTIM_FLTINR3_FLT4CRES_Pos     (30)
#define HRTIM_FLTINR3_FLT4CRES_Msk     (0x1 << HRTIM_FLTINR3_FLT4CRES_Pos)   /*!< 0x40000000 */
#define HRTIM_FLTINR3_FLT4CRES         HRTIM_FLTINR3_FLT4CRES_Msk              /*!< Fault 4 Counter Reset  */
#define HRTIM_FLTINR3_FLT4RSTM_Pos     (31)
#define HRTIM_FLTINR3_FLT4RSTM_Msk     (0x1 << HRTIM_FLTINR3_FLT4RSTM_Pos)   /*!< 0x80000000 */
#define HRTIM_FLTINR3_FLT4RSTM         HRTIM_FLTINR3_FLT4RSTM_Msk              /*!< Fault 4 Counter Reset Mode */

/*******************  Bit definition for HRTIM_FLTINR4 register  ***************/
#define HRTIM_FLTINR4_FLT5BLKE_Pos     (0)
#define HRTIM_FLTINR4_FLT5BLKE_Msk     (0x1 << HRTIM_FLTINR4_FLT5BLKE_Pos)   /*!< 0x00000001 */
#define HRTIM_FLTINR4_FLT5BLKE         HRTIM_FLTINR4_FLT5BLKE_Msk              /*!< Fault 5 Blanking Enable */
#define HRTIM_FLTINR4_FLT5BLKS_Pos     (1)
#define HRTIM_FLTINR4_FLT5BLKS_Msk     (0x1 << HRTIM_FLTINR4_FLT5BLKS_Pos)   /*!< 0x00000002 */
#define HRTIM_FLTINR4_FLT5BLKS         HRTIM_FLTINR4_FLT5BLKS_Msk              /*!< Fault 5 Blanking Source */
#define HRTIM_FLTINR4_FLT5CNT_Pos      (2)
#define HRTIM_FLTINR4_FLT5CNT_Msk      (0xF << HRTIM_FLTINR4_FLT5CNT_Pos)    /*!< 0x0000003C */
#define HRTIM_FLTINR4_FLT5CNT          HRTIM_FLTINR4_FLT5CNT_Msk               /*!< Fault 5 Counter */
#define HRTIM_FLTINR4_FLT5CNT_0        (0x1 << HRTIM_FLTINR4_FLT5CNT_Pos)    /*!< 0x00000004 */
#define HRTIM_FLTINR4_FLT5CNT_1        (0x2 << HRTIM_FLTINR4_FLT5CNT_Pos)    /*!< 0x00000008 */
#define HRTIM_FLTINR4_FLT5CNT_2        (0x4 << HRTIM_FLTINR4_FLT5CNT_Pos)    /*!< 0x00000010 */
#define HRTIM_FLTINR4_FLT5CNT_3        (0x8 << HRTIM_FLTINR4_FLT5CNT_Pos)    /*!< 0x00000020 */
#define HRTIM_FLTINR4_FLT5CRES_Pos     (6)
#define HRTIM_FLTINR4_FLT5CRES_Msk     (0x1 << HRTIM_FLTINR4_FLT5CRES_Pos)   /*!< 0x00000040 */
#define HRTIM_FLTINR4_FLT5CRES         HRTIM_FLTINR4_FLT5CRES_Msk              /*!< Fault 5 Counter Reset  */
#define HRTIM_FLTINR4_FLT5RSTM_Pos     (7)
#define HRTIM_FLTINR4_FLT5RSTM_Msk     (0x1 << HRTIM_FLTINR4_FLT5RSTM_Pos)   /*!< 0x00000080 */
#define HRTIM_FLTINR4_FLT5RSTM         HRTIM_FLTINR4_FLT5RSTM_Msk              /*!< Fault 5 Counter Reset Mode */
#define HRTIM_FLTINR4_FLT6BLKE_Pos     (8)
#define HRTIM_FLTINR4_FLT6BLKE_Msk     (0x1 << HRTIM_FLTINR4_FLT6BLKE_Pos)   /*!< 0x00000100 */
#define HRTIM_FLTINR4_FLT6BLKE         HRTIM_FLTINR4_FLT6BLKE_Msk              /*!< Fault 6 Blanking Enable */
#define HRTIM_FLTINR4_FLT6BLKS_Pos     (9)
#define HRTIM_FLTINR4_FLT6BLKS_Msk     (0x1 << HRTIM_FLTINR4_FLT6BLKS_Pos)   /*!< 0x00000200 */
#define HRTIM_FLTINR4_FLT6BLKS         HRTIM_FLTINR4_FLT6BLKS_Msk              /*!< Fault 6 Blanking Source */
#define HRTIM_FLTINR4_FLT6CNT_Pos      (10)
#define HRTIM_FLTINR4_FLT6CNT_Msk      (0xF << HRTIM_FLTINR4_FLT6CNT_Pos)    /*!< 0x00003C00 */
#define HRTIM_FLTINR4_FLT6CNT          HRTIM_FLTINR4_FLT6CNT_Msk               /*!< Fault 6 Counter */
#define HRTIM_FLTINR4_FLT6CNT_0        (0x1 << HRTIM_FLTINR4_FLT6CNT_Pos)    /*!< 0x00000400 */
#define HRTIM_FLTINR4_FLT6CNT_1        (0x2 << HRTIM_FLTINR4_FLT6CNT_Pos)    /*!< 0x00000800 */
#define HRTIM_FLTINR4_FLT6CNT_2        (0x4 << HRTIM_FLTINR4_FLT6CNT_Pos)    /*!< 0x00001000 */
#define HRTIM_FLTINR4_FLT6CNT_3        (0x8 << HRTIM_FLTINR4_FLT6CNT_Pos)    /*!< 0x00002000 */
#define HRTIM_FLTINR4_FLT6CRES_Pos     (14)
#define HRTIM_FLTINR4_FLT6CRES_Msk     (0x1 << HRTIM_FLTINR4_FLT6CRES_Pos)   /*!< 0x00004000 */
#define HRTIM_FLTINR4_FLT6CRES         HRTIM_FLTINR4_FLT6CRES_Msk              /*!< Fault 6 Counter Reset  */
#define HRTIM_FLTINR4_FLT6RSTM_Pos     (15)
#define HRTIM_FLTINR4_FLT6RSTM_Msk     (0x1 << HRTIM_FLTINR4_FLT6RSTM_Pos)   /*!< 0x00008000 */
#define HRTIM_FLTINR4_FLT6RSTM         HRTIM_FLTINR4_FLT6RSTM_Msk              /*!< Fault 6 Counter Reset Mode */

